
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Делает запись в регистр.
// 
// Параметры:
// 	Документ - СправочникСсылка.ВходящиеДокументы, СправочникСсылка.ИсходящиеДокументы
// 	ДокументОтчетности - ОпределяемыйТип.ПредметЦиклаОбмена
Процедура ДобавитьЗапись(Документ, ДокументОтчетности) Экспорт
	
	Запись = РегистрыСведений.СведенияОДокументахОбменСКО.СоздатьМенеджерЗаписи();
	Запись.Документ = Документ;
	Запись.ДокументОтчетности = ДокументОтчетности;
	Запись.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
