
#Область СлужебныйПрограммныйИнтерфейс


// Вызывается после записи приглашения.
// 
// Параметры:
//  СведенияОПриглашении - см. ПриглашенияЭДОСлужебный.СведенияОЗаписанномПриглашении
//
Процедура ПослеИзмененияПриглашения(СведенияОПриглашении) Экспорт
	
	НастройкиЭДО.ПослеИзмененияПриглашения(СведенияОПриглашении);

	СинхронизацияЭДОСобытия.ПослеИзмененияСтатусаПриглашения(
		СведенияОПриглашении.ИдентификаторОрганизации, СведенияОПриглашении.ИдентификаторКонтрагента,
		СведенияОПриглашении.Статус, СведенияОПриглашении.КонтекстДиагностики);
	
КонецПроцедуры

#КонецОбласти