//@strict-types

#Область ПрограммныйИнтерфейс

// Возвращает Истина, если переданное значение является ссылкой или объектом
// одного из типов документов, используемых для обмена с контролирующими органами.
// 
// Параметры:
// 	Значение - ЛюбаяСсылка
// Возвращаемое значение:
// 	Булево 
Функция ЭтоДокументОбменаСКонтролирующимОрганом(Значение) Экспорт
	
	ТипОбъекта = ТипЗнч(Значение);
	
#Если Сервер Тогда
	Если ТипОбъекта = Тип("СправочникСсылка.ПерепискаСКонтролирующимиОрганами")
		Или ТипОбъекта = Тип("СправочникОбъект.ПерепискаСКонтролирующимиОрганами")
		Или ТипОбъекта = Тип("СправочникСсылка.ОписиИсходящихДокументовВНалоговыеОрганы")
		Или ТипОбъекта = Тип("СправочникОбъект.ОписиИсходящихДокументовВНалоговыеОрганы")
		Или ТипОбъекта = Тип("ДокументСсылка.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика")
		Или ТипОбъекта = Тип("ДокументОбъект.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика")
		Или ТипОбъекта = Тип("ДокументСсылка.ПоясненияКДекларацииПоНДС")
		Или ТипОбъекта = Тип("ДокументОбъект.ПоясненияКДекларацииПоНДС")
		Или ТипОбъекта = Тип("ДокументСсылка.УведомлениеОСпецрежимахНалогообложения")
		Или ТипОбъекта = Тип("ДокументОбъект.УведомлениеОСпецрежимахНалогообложения")
		Или ТипОбъекта = Тип("СправочникСсылка.ДокументыРеализацииПолномочийНалоговыхОрганов")
		Или ТипОбъекта = Тип("СправочникОбъект.ДокументыРеализацииПолномочийНалоговыхОрганов") Тогда
		//
		Возврат Истина;
		
	КонецЕсли;
#Иначе
	Если ТипОбъекта = Тип("СправочникСсылка.ПерепискаСКонтролирующимиОрганами")
		Или ТипОбъекта = Тип("СправочникСсылка.ОписиИсходящихДокументовВНалоговыеОрганы")
		Или ТипОбъекта = Тип("ДокументСсылка.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика")
		Или ТипОбъекта = Тип("ДокументСсылка.ПоясненияКДекларацииПоНДС")
		Или ТипОбъекта = Тип("ДокументСсылка.УведомлениеОСпецрежимахНалогообложения")
		Или ТипОбъекта = Тип("СправочникСсылка.ДокументыРеализацииПолномочийНалоговыхОрганов") Тогда
		
		Возврат Истина;
		
	КонецЕсли;
#КонецЕсли
	
	Возврат Ложь;
	
КонецФункции

// Определяет возможность простой печати у типа документа для контролирующего органа. 
// 
// Параметры:
// 	ТипДокумента - Тип - Типа документа для контролирующих органов.
// Возвращаемое значение:
// 	Булево - 
Функция ДоступнаПечать(ТипДокумента) Экспорт
	
	Если ТипДокумента = Тип("СправочникСсылка.ПерепискаСКонтролирующимиОрганами")
		Или ТипДокумента = Тип("ДокументСсылка.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика") Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
