#Область СлужебныеПроцедурыИФункции

Процедура УстановитьИспользованиеВнутреннегоЭДО(Использовать) Экспорт
	
	НастройкиЭДО.УстановитьИспользованиеВнутреннегоЭДО(Использовать);
	
КонецПроцедуры

Функция НовыйПроизвольныйДокумент(ПараметрыФормирования, ПараметрыФайла) Экспорт
	
	Возврат ЭлектронныеДокументыЭДО.СоздатьПроизвольныйДокумент(ПараметрыФормирования, ПараметрыФайла);
	
КонецФункции

Функция КлючНастроекОтправкиОбъектаУчета(ОбъектУчета) Экспорт
	
	ОписаниеОбъектаУчета = ИнтеграцияЭДО.ОписаниеОбъектаУчета(ОбъектУчета);
	КлючНастроек = ЭлектронныеДокументыЭДО.КлючНастроекОтправкиОбъектаУчета(ОписаниеОбъектаУчета);
	Возврат КлючНастроек;
	
КонецФункции

#КонецОбласти