////////////////////////////////////////////////////////////////////////////////
// Общий модуль ИнтеграцияЭДОВызовСервера
// 
////////////////////////////////////////////////////////////////////////////////

Функция ПерезаполнитьДокумент(Знач ПараметрыЗаполнения, КонтекстОперации) Экспорт
	
 	Возврат ИнтеграцияЭДО.ПерезаполнитьДокумент(ПараметрыЗаполнения, КонтекстОперации);
	
КонецФункции

Функция АктуальныйЭлектронныйДокументОбъектаУчета(ОбъектУчета, ВидДокумента) Экспорт
	
	Возврат ИнтеграцияЭДО.АктуальныйЭлектронныйДокументОбъектаУчета(ОбъектУчета, ВидДокумента);
	
КонецФункции

Функция ЭлектронныеДокументыОбъектовУчета(ОбъектУчета) Экспорт
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ИнтеграцияЭДО.ЭлектронныеДокументыОбъектовУчета(ОбъектУчета));
	
КонецФункции

Функция ОсновнойЭлектронныйДокументОбъектаУчета(ОбъектУчета) Экспорт
	
 	Возврат ИнтеграцияЭДО.ОсновнойЭлектронныйДокументОбъектаУчета(ОбъектУчета);	
 	
КонецФункции

Функция ОписаниеОбъектаУчета(ИсточникДанных) Экспорт
	
 	Возврат ИнтеграцияЭДО.ОписаниеОбъектаУчета(ИсточникДанных);
	
КонецФункции

Функция ПредставлениеСостоянияВнутреннегоДокументаОбъектаУчета(ОбъектыУчета, ВидВнутреннегоДокумента) Экспорт
	
	ОписанияОбъектовУчета = ИнтеграцияЭДО.ОписанияОбъектовУчета(ОбъектыУчета);
	Возврат ИнтеграцияЭДО.ПредставлениеСостоянияВнутреннегоДокументаОбъектаУчета(ОписанияОбъектовУчета, ВидВнутреннегоДокумента);
	
КонецФункции

Функция ДанныеСостоянияЭДОДляФормыОбъектаУчета(ОбъектУчета) Экспорт

	Возврат ИнтеграцияЭДО.ДанныеСостоянияЭДОДляФормыОбъектаУчета(ОбъектУчета); 
	
КонецФункции	

Функция ВыполнитьКонтрольСопоставленияНоменклатурыЭлектронногоДокумента(ДанныеЭлектронногоДокумента) Экспорт
	
	Если ДанныеЭлектронногоДокумента.ТипДокумента = Перечисления.ТипыДокументовЭДО.РеквизитыОрганизации Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыПолучения = ЭлектронныеДокументыЭДО.НовыеПараметрыПолученияДанныхДокумента();
	ПараметрыПолучения.ОсновнойФайл = ДанныеЭлектронногоДокумента.ДанныеОсновногоФайла;
	
	ТаблицаТоваров = ЭлектронныеДокументыЭДО.ДанныеНоменклатурыДокумента(ПараметрыПолучения);	
	Владелец = СопоставлениеНоменклатурыКонтрагентовСлужебный.ВладелецНоменклатурыКонтрагента(ДанныеЭлектронногоДокумента.Отправитель);	
	НаборНоменклатурыКонтрагентов = ИнтеграцияЭДО.ЗаполнитьНаборНоменклатурыКонтрагентовПоТаблицеТоваров(ТаблицаТоваров, Владелец);
	
	Возврат ИнтеграцияЭДО.ВыполнитьКонтрольСопоставленияНоменклатуры(Неопределено, НаборНоменклатурыКонтрагентов, Ложь); 
	
КонецФункции

Процедура УстановитьАктуальныйЭлектронныйДокумент(НаборОбъектовУчета, ЭлектронныйДокумент, ВидДокумента) Экспорт
	ИнтеграцияЭДО.УстановитьАктуальныйЭлектронныйДокумент(НаборОбъектовУчета, ЭлектронныйДокумент, ВидДокумента);
КонецПроцедуры

Процедура РазорватьСвязьЭлектронногоДокументаСОбъектомУчета(ЭлектронныйДокумент, ОбъектУчета) Экспорт
	ИнтеграцияЭДО.РазорватьСвязьЭлектронногоДокументаСОбъектомУчета(ЭлектронныйДокумент, ОбъектУчета);
КонецПроцедуры	

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДокументУчета(ДанныеЭлектронногоДокумента, ОбъектыУчета, СпособОбработки = Неопределено) Экспорт
	
	ИнтеграцияЭДО.СохранитьДанныеОбъекта(ДанныеЭлектронногоДокумента, ОбъектыУчета, СпособОбработки);
		
КонецПроцедуры

#Область ГотовностьКДокументообороту

// см. ИнтеграцияЭДО.ПроверкаГотовностиКДокументообороту.
Функция ПроверкаГотовностиКДокументообороту(НаборОбъектовУчета) Экспорт
	
	Возврат ИнтеграцияЭДО.ПроверкаГотовностиКДокументообороту(НаборОбъектовУчета);
	
КонецФункции

#КонецОбласти

#КонецОбласти