
#Область СлужебныеПроцедурыИФункции

// Проверяет наличие используемого регламентного задания "ПроверкаНовыхЭлектронныхДокументов"
// Возвращаемое значение:
//  Булево - используется задание или нет.
//
Функция ЕстьРегламентноеЗаданиеПроверкаНовыхЭлектронныхДокументов() Экспорт
	
	Если РаботаВМоделиСервиса.ДоступноИспользованиеРазделенныхДанных() Тогда
		ЕстьПроверкаНовыхЭД = Ложь;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		ЗаданиеПроверкаНовыхЭлектронныхДокументов = Метаданные.РегламентныеЗадания.Найти("ПроверкаНовыхЭлектронныхДокументов");
		ЕстьПроверкаНовыхЭД = РегламентныеЗаданияСервер.РегламентноеЗаданиеИспользуется(ЗаданиеПроверкаНовыхЭлектронныхДокументов);
	КонецЕсли;
	
	Возврат ЕстьПроверкаНовыхЭД;
	
КонецФункции

#КонецОбласти