
#Область СлужебныйПрограммныйИнтерфейс

// Признак использования библиотеки интернет поддержки пользователей
//
// Возвращаемое значение:
//  Булево - Истина, если используется библиотека интернет поддержки пользователей.
//
Функция ИспользуетсяИнтернетПоддержкаПользователей() Экспорт
	
	Использование = Неопределено;
	ОбменСКонтрагентамиКлиентПереопределяемый.ПроверитьИспользованиеИнтернетПоддержкаПользователей(Использование);
	
	Если Использование = Неопределено Тогда
		
		Использование = Ложь;
		Если Подключение1СТакскомВызовСервера.ДоступноИспользованиеСервиса1СТакском() Тогда
			ОшибкаОбращенияКВебСервису = Ложь;
			Использование = Подключение1СТакскомКлиент.КонфигурацияЗарегистрированаВСервисе1СТакском(ОшибкаОбращенияКВебСервису);
			Если ОшибкаОбращенияКВебСервису Тогда
				Использование = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Использование;
	
КонецФункции

#КонецОбласти