#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Регистрирует данные для обработчика обновления
// 
// Параметры:
//  Параметры - Структура - параметры.
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОтработаныВсеДанные = Ложь;
	Ссылка = Справочники.СообщениеЭДОПрисоединенныеФайлы.ПустаяСсылка();
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	ПараметрыВыборки.ПолныеИменаОбъектов = Ссылка.Метаданные().ПолноеИмя();
	
	Пока Не ОтработаныВсеДанные Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1000
			|	Файлы.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СообщениеЭДОПрисоединенныеФайлы КАК Файлы
			|ГДЕ
			|	Файлы.Ссылка > &Ссылка
			|	И (Файлы.ВладелецФайла = ЗНАЧЕНИЕ(Документ.СообщениеЭДО.ПустаяСсылка)
			|		ИЛИ ВЫРАЗИТЬ(Файлы.ПолноеИмяФайла КАК СТРОКА(1)) = """"
			|		ИЛИ НЕ Файлы.Служебный)
			|УПОРЯДОЧИТЬ ПО
			|	Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, МассивСсылок);
		
		КоличествоСсылок = МассивСсылок.Количество();
		Если КоличествоСсылок < 1000 Тогда
			ОтработаныВсеДанные = Истина;
		КонецЕсли;
		
		Если КоличествоСсылок > 0 Тогда
			Ссылка = МассивСсылок[КоличествоСсылок - 1];
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик обновления.
// 
// Параметры:
//  Параметры - Структура - параметры.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	МетаданныеОбъекта = Метаданные.Справочники.СообщениеЭДОПрисоединенныеФайлы;
	ПолноеИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
	
	Если ОбновлениеИнформационнойБазы.ЕстьЗаблокированныеПредыдущимиОчередямиДанные(Параметры.Очередь,
		"Справочник.ВидыДокументовЭДО") Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
			Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	ПараметрыОтметкиВыполнения = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	
	ВыбранныеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если ВыбранныеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	СвойстваДокументов = СвойстваДокументов(ВыбранныеДанные);
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	
	Для Каждого СтрокаДанных Из ВыбранныеДанные Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Записать = Ложь;
			
			Объект = ОбщегоНазначенияБЭД.ОбъектПоСсылкеДляИзменения(СтрокаДанных.Ссылка);
			
			Если Объект <> Неопределено Тогда
				
				ЗаполнитьВладельцаФайла(Объект, СвойстваДокументов, Записать);
				
				ЗаполнитьПолноеИмяФайла(Объект, Записать);
				
				ЗаполнитьПризнакСлужебногоФайла(Объект, Записать);
				
			КонецЕсли;
			
			Если Записать Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(СтрокаДанных.Ссылка, ПараметрыОтметкиВыполнения);
			КонецЕсли;
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось обработать файл электронного документа: %1 по причине:
				|%2'"), СтрокаДанных.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка, МетаданныеОбъекта, СтрокаДанных.Ссылка, ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ШаблонСообщения = НСтр("ru = 'Не удалось обработать некоторые файлы электронных документов (пропущены): %1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ШаблонСообщения = НСтр("ru = 'Обработана очередная порция файлов электронных документов: %1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектовОбработано);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			МетаданныеОбъекта,, ТекстСообщения);
	КонецЕсли;
	
	Параметры.ПрогрессВыполнения.ОбработаноОбъектов =
		Параметры.ПрогрессВыполнения.ОбработаноОбъектов + ОбъектовОбработано;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
		Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ЧтениеОбъектаРазрешено(ВладелецФайла)
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ИзменениеОбъектаРазрешено(ВладелецФайла)";

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеПроцедурыИФункцииОбработчиковОбновления

Процедура ЗаполнитьВладельцаФайла(Объект, СвойстваДокументов, Записать)
	
	Если ЗначениеЗаполнено(Объект.ВладелецФайла)
		ИЛИ Не ЗначениеЗаполнено(Объект.УдалитьВладелецФайла2) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.УдалитьТипЭлементаВерсииЭД <> Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьДополнительныйЭД Тогда
		
		ВладелецОбъект = СоздатьВладельцаФайла(Объект, СвойстваДокументов);
		Если ВладелецОбъект = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Объект.ВладелецФайла = ВладелецОбъект.Ссылка;
		Записать = Истина;
		Возврат;
		
	КонецЕсли;
	
	ОсновнойФайл = ОсновнойФайлВладельца(Объект);
	Если Не ЗначениеЗаполнено(ОсновнойФайл) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектОсновногоФайла = ОбщегоНазначенияБЭД.ОбъектПоСсылкеДляИзменения(ОсновнойФайл);
	Если ЗначениеЗаполнено(ОбъектОсновногоФайла.ВладелецФайла) Тогда
		Объект.ВладелецФайла = ОбъектОсновногоФайла.ВладелецФайла;
	Иначе
		ВладелецОбъект = СоздатьВладельцаФайла(ОбъектОсновногоФайла, СвойстваДокументов);
		Если ВладелецОбъект = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Объект.ВладелецФайла = ВладелецОбъект.Ссылка;
		ОбъектОсновногоФайла.ВладелецФайла = ВладелецОбъект.Ссылка;
		ОбъектОсновногоФайла.ОбменДанными.Загрузка = Истина;
		ОбъектОсновногоФайла.Записать();
	КонецЕсли;
	
	Записать = Истина;
	
КонецПроцедуры

Функция СоздатьВладельцаФайла(Объект, СвойстваДокументов)
	
	СвойстваДокумента = СвойстваДокументов.Найти(Объект.УдалитьВладелецФайла2, "Ссылка");
	Если СвойстваДокумента = Неопределено
		ИЛИ Не ЗначениеЗаполнено(СвойстваДокумента.УдалитьВидДокумента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СвойстваДокумента.ТипРегламента = ЭлектронныеДокументыЭДО.Обновление_ТипРегламентаПоНовойАрхитектуре(
		СвойстваДокумента.УдалитьТипЭлементаВерсииЭД);
	
	ВладелецОбъект = Документы.СообщениеЭДО.СоздатьДокумент();
	
	ТипЭлементаРегламента = ОпределитьТипЭлементаРегламента(Объект.УдалитьТипЭлементаВерсииЭД);
	
	ВладелецОбъект.Дата = Объект.ДатаСоздания;
	ВладелецОбъект.ОсновнойФайл = Объект.Ссылка;
	ВладелецОбъект.ЭлектронныйДокумент = Объект.УдалитьВладелецФайла2;
	ВладелецОбъект.Направление = Объект.УдалитьНаправлениеЭД;
	ВладелецОбъект.ДополнительнаяИнформация = Объект.УдалитьДополнительнаяИнформация;
	ВладелецОбъект.ТипЭлементаРегламента = ТипЭлементаРегламента;
	ВладелецОбъект.Статус = ЭлектронныеДокументыЭДО.Обновление_СтатусСообщенияПоНовойАрхитектуре(Объект.УдалитьСтатусЭД,
		СвойстваДокумента.ТипРегламента, ВладелецОбъект.ТипЭлементаРегламента, ВладелецОбъект.Направление, СвойстваДокумента.ОбменБезПодписи);
	ВладелецОбъект.ДатаИзмененияСтатуса = Объект.УдалитьДатаИзмененияСтатусаЭД;
	
	Если ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя Тогда
		ВладелецОбъект.ВидСообщения = ЭлектронныеДокументыЭДО.Обновление_ОпределитьВидДокумента(СвойстваДокумента);
	Иначе
		ТипСообщения = ТипСлужебногоСообщенияПоТипуЭлементаРегламента(ТипЭлементаРегламента);
		Если Не ЗначениеЗаполнено(ТипСообщения) Тогда
			ВызватьИсключение НСтр("ru = 'Не удалось определить тип служебного сообщения'");
		КонецЕсли;
		ВладелецОбъект.ВидСообщения = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(ТипСообщения);;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВладелецОбъект.ДатаИзмененияСтатуса)
		И ЗначениеЗаполнено(Объект.ДатаМодификацииУниверсальная) Тогда
		ВладелецОбъект.ДатаИзмененияСтатуса = МестноеВремя(Объект.ДатаМодификацииУниверсальная, ЧасовойПоясСеанса());
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВладелецОбъект.Статус)
		ИЛИ ЭлектронныеДокументыЭДО.Обновление_ДокументооборотЗавершенДоОбновления(
			СвойстваДокумента.УдалитьСостояниеЭДО) Тогда
		ВладелецОбъект.Состояние = Перечисления.СостоянияСообщенийЭДО.Хранение;
	Иначе
		ВладелецОбъект.Состояние = РегламентыЭДО.СостояниеСообщения(ВладелецОбъект, СвойстваДокумента);
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ВладелецОбъект);
	
	Возврат ВладелецОбъект;
	
КонецФункции

Функция ОпределитьТипЭлементаРегламента(ТипЭлементаВерсииЭД)
	
	Результат = ТипЭлементаВерсииЭД;
	
	Если ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьПервичныйЭД
		ИЛИ ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьСЧФДОПУПД
		ИЛИ ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьСЧФУПД
		ИЛИ ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьДОПУПД
		ИЛИ ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьДОП
		ИЛИ ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьКСЧФДИСУКД
		ИЛИ ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьКСЧФУКД
		ИЛИ ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьДИСУКД
		ИЛИ ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьЭСФ Тогда
		
		Результат = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя;
		
	ИначеЕсли ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьСоглашениеОбИзмененииСтоимостиПолучатель
		ИЛИ ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьИнформацияПокупателяУПД
		ИЛИ ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьИнформацияПокупателяУКД
		ИЛИ ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьТОРГ12Покупатель
		ИЛИ ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьАктЗаказчик Тогда
		
		Результат = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя;
		
	ИначеЕсли ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьИПЭСФ Тогда
		
		Результат = Перечисления.ТипыЭлементовРегламентаЭДО.ИОП;
		
	ИначеЕсли ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьПДОЭСФ Тогда
		
		Результат = Перечисления.ТипыЭлементовРегламентаЭДО.ПДО;
		
	ИначеЕсли ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьПДПЭСФ Тогда
		
		Результат = Перечисления.ТипыЭлементовРегламентаЭДО.ПДП;
		
	ИначеЕсли ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьУУЭСФ Тогда
		
		Результат = Перечисления.ТипыЭлементовРегламентаЭДО.УОУ;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТипСлужебногоСообщенияПоТипуЭлементаРегламента(ТипЭлементаРегламента)
	
	ТипСообщения = Перечисления.ТипыДокументовЭДО.ПустаяСсылка();
	
	Если ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПДП
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПДО
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИОП_ПДО
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя_ПДО Тогда
		
		ТипСообщения = Перечисления.ТипыДокументовЭДО.ПодтверждениеОператораЭДО;
		
	ИначеЕсли ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИОП
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПДП_ИОП
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПДО_ИОП
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИОП_ПДО_ИОП
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя_ПДО_ИОП
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.УОУ_ИОП Тогда
		
		ТипСообщения = Перечисления.ТипыДокументовЭДО.ИзвещениеОПолучении;
		
	ИначеЕсли ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПОА Тогда
		
		ТипСообщения = Перечисления.ТипыДокументовЭДО.ПредложениеОбАннулировании;
		
	ИначеЕсли ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.УОУ
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПОА_УОУ Тогда
		
		ТипСообщения = Перечисления.ТипыДокументовЭДО.УведомлениеОбУточнении;
		
	КонецЕсли;
	
	Возврат ТипСообщения;
	
КонецФункции

Процедура ЗаполнитьПолноеИмяФайла(Объект, Записать)
	
	Если ЗначениеЗаполнено(Объект.ПолноеИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяБезРасширения = ?(ЗначениеЗаполнено(Объект.УдалитьНаименованиеФайла),
		Объект.УдалитьНаименованиеФайла, Объект.Наименование);
	Объект.ПолноеИмяФайла = ?(ПустаяСтрока(Объект.Расширение), ИмяБезРасширения,
		ИмяБезРасширения + "." + Объект.Расширение);
	
	Записать = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьПризнакСлужебногоФайла(Объект, Записать)
	
	Если Объект.Служебный Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Служебный = Истина;
	Записать = Истина;
	
КонецПроцедуры

Функция СвойстваДокументов(ВыбранныеДанные)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВыбранныеДанные.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВыбранныеФайлы
		|ИЗ
		|	&ВыбранныеДанные КАК ВыбранныеДанные
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СообщениеЭДОПрисоединенныеФайлы.УдалитьВладелецФайла2 КАК УдалитьВладелецФайла2
		|ПОМЕСТИТЬ ВыбранныеДокументы
		|ИЗ
		|	Справочник.СообщениеЭДОПрисоединенныеФайлы КАК СообщениеЭДОПрисоединенныеФайлы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеФайлы КАК ВыбранныеФайлы
		|		ПО СообщениеЭДОПрисоединенныеФайлы.Ссылка = ВыбранныеФайлы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументЭДО.Ссылка КАК Ссылка,
		|	ДокументЭДО.УдалитьВидДокумента КАК УдалитьВидДокумента,
		|	ДокументЭДО.УдалитьВидПрикладногоДокумента КАК УдалитьВидПрикладногоДокумента,
		|	ДокументЭДО.УдалитьТипДокумента КАК УдалитьТипДокумента,
		|	ДокументЭДО.УдалитьТипЭлементаВерсииЭД КАК УдалитьТипЭлементаВерсииЭД,
		|	ДокументЭДО.ВидДокумента КАК ВидДокумента,
		|	ДокументЭДО.НомерДокумента КАК НомерДокумента,
		|	ДокументЭДО.ДатаДокумента КАК ДатаДокумента,
		|	ДокументЭДО.УдалитьПричинаОтклонения КАК УдалитьПричинаОтклонения,
		|	ДокументЭДО.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
		|	ДокументЭДО.СпособОбмена КАК СпособОбмена,
		|	ДокументЭДО.ОбменБезПодписи КАК ОбменБезПодписи,
		|	ДокументЭДО.УдалитьСостояниеЭДО КАК УдалитьСостояниеЭДО,
		|	ДокументЭДО.ТипРегламента КАК ТипРегламента
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ДокументЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеДокументы КАК ВыбранныеДокументы
		|		ПО ДокументЭДО.Ссылка = ВыбранныеДокументы.УдалитьВладелецФайла2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументЭДО.Ссылка КАК Ссылка,
		|	ДокументЭДО.УдалитьВидДокумента КАК УдалитьВидДокумента,
		|	ДокументЭДО.УдалитьВидПрикладногоДокумента КАК УдалитьВидПрикладногоДокумента,
		|	ДокументЭДО.УдалитьТипДокумента КАК УдалитьТипДокумента,
		|	ДокументЭДО.УдалитьТипЭлементаВерсииЭД КАК УдалитьТипЭлементаВерсииЭД,
		|	ДокументЭДО.ВидДокумента КАК ВидДокумента,
		|	ДокументЭДО.НомерДокумента КАК НомерДокумента,
		|	ДокументЭДО.ДатаДокумента КАК ДатаДокумента,
		|	ДокументЭДО.УдалитьПричинаОтклонения КАК УдалитьПричинаОтклонения,
		|	ДокументЭДО.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
		|	ДокументЭДО.СпособОбмена КАК СпособОбмена,
		|	ДокументЭДО.ОбменБезПодписи КАК ОбменБезПодписи,
		|	ДокументЭДО.УдалитьСостояниеЭДО КАК УдалитьСостояниеЭДО,
		|	ДокументЭДО.ТипРегламента КАК ТипРегламента
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ДокументЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеДокументы КАК ВыбранныеДокументы
		|		ПО ДокументЭДО.Ссылка = ВыбранныеДокументы.УдалитьВладелецФайла2";
	Запрос.УстановитьПараметр("ВыбранныеДанные", ВыбранныеДанные);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ОсновнойФайлВладельца(ОбъектДополнительногоФайла)
	
	Если ЗначениеЗаполнено(ОбъектДополнительногоФайла.УдалитьЭлектронныйДокументВладелец) Тогда
		Возврат ОбъектДополнительногоФайла.УдалитьЭлектронныйДокументВладелец;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщениеЭДОПрисоединенныеФайлы.Ссылка
		|ИЗ
		|	Справочник.СообщениеЭДОПрисоединенныеФайлы КАК СообщениеЭДОПрисоединенныеФайлы
		|ГДЕ
		|	СообщениеЭДОПрисоединенныеФайлы.УдалитьВладелецФайла2 = &УдалитьВладелецФайла2
		|	И СообщениеЭДОПрисоединенныеФайлы.УдалитьТипЭлементаВерсииЭД = &УдалитьТипЭлементаВерсииЭД
		|	И СообщениеЭДОПрисоединенныеФайлы.УдалитьНаправлениеЭД = &УдалитьНаправлениеЭД";
	
	Запрос.УстановитьПараметр("УдалитьВладелецФайла2", ОбъектДополнительногоФайла.УдалитьВладелецФайла2);
	Запрос.УстановитьПараметр("УдалитьТипЭлементаВерсииЭД", Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьПервичныйЭД);
	Запрос.УстановитьПараметр("УдалитьНаправлениеЭД", Перечисления.НаправленияЭДО.Исходящий);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область Документооборот
// УправлениеДоступом

// Возвращает строку, содержащую перечисление полей доступа через запятую
// Это перечисление используется в дальнейшем для передачи в метод 
// ОбщегоНазначения.ЗначенияРеквизитовОбъекта()
Функция ПолучитьПоляДоступа() Экспорт
	
	Возврат "Ссылка";
	
КонецФункции

// Заполняет переданный дескриптор доступа
//
Процедура ЗаполнитьОсновнойДескриптор(ОбъектДоступа, ДескрипторДоступа) Экспорт
	
КонецПроцедуры

// Конец УправлениеДоступом
#КонецОбласти
