#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ОписаниеФайла") Тогда
		СодержаниеСообщения = ЭлектронныеДокументыЭДО.СодержаниеСообщения(Параметры.ОписаниеФайла);
		Если ЗначениеЗаполнено(СодержаниеСообщения) Тогда
			Номер = СодержаниеСообщения.НомерДокумента;
			Дата = СодержаниеСообщения.ДатаДокумента;
			Сумма = СодержаниеСообщения.СуммаДокумента;
			Если ЗначениеЗаполнено(СодержаниеСообщения.ПрикладнойТипДокумента) Тогда
				ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоПрикладномуТипу(
					СодержаниеСообщения.ПрикладнойТипДокумента);
			Иначе
				ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(СодержаниеСообщения.ТипДокумента);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Номер", Номер);
	Результат.Вставить("Дата", Дата);
	Результат.Вставить("Сумма", Сумма);
	Результат.Вставить("ВидДокумента", ВидДокумента);
	
	Закрыть(Результат);	
	
КонецПроцедуры

#КонецОбласти