////////////////////////////////////////////////////////////////////////////////
// ОбменСКонтрагентамиГлобальный: механизм обмена электронными документами.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область ОповещениеОСобытиях

// Выводит сообщение о наличии новых электронных документов в сервисе 1С-ЭДО.
Процедура ПроверитьНаличиеНовыхЭлектронныхДокументов() Экспорт
	
	СинхронизацияЭДОКлиент.ПроверитьНаличиеНовыхЭлектронныхДокументовВСервисе1СЭДО();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
