
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура);
	ПараметрыФормы.Отбор.Вставить("ИдентификаторДокументооборота", ИдентификаторДокументооборота(ПараметрКоманды));
	СинхронизацияЭДОКлиент.ОткрытьСписокТранспортныхКонтейнеров(ПараметрыФормы, ПараметрыВыполненияКоманды);
КонецПроцедуры

&НаСервере
Функция ИдентификаторДокументооборота(Знач ЭлектронныйДокумент)
	Возврат ЭлектронныеДокументыЭДО.СвойстваДокумента(
		ЭлектронныйДокумент, "ИдентификаторДокументооборота").ИдентификаторДокументооборота;
КонецФункции