#Область СлужебныеПроцедурыИФункции

#Область ОбработкаДействийПоЭДО

Функция ВыполнитьДействияПоЭДОВФоне(Знач ПараметрыВыполненияДействий, Знач КонтекстДиагностики) Экспорт
	Возврат ЭлектронныеДокументыЭДО.ВыполнитьДействияПоЭДОВФоне(ПараметрыВыполненияДействий, КонтекстДиагностики);
КонецФункции

Функция ЗаполнитьПодписантовПоСертификату(Знач ПрисоединенныеФайлы, Знач Сертификат, КонтекстДиагностики) Экспорт
	Возврат ЭлектронныеДокументыЭДО.ЗаполнитьПодписантовПоСертификату(ПрисоединенныеФайлы, Сертификат, КонтекстДиагностики);
КонецФункции

Функция ВыполнитьДействияПоЭДОПослеПодписания(Знач ПодписанныеСообщенияКлиент, Знач АдресКонтекста, Знач КонтекстДиагностики) Экспорт
	
	КонтекстНаСервере = ПолучитьИзВременногоХранилища(АдресКонтекста);
	УдалитьИзВременногоХранилища(АдресКонтекста);
	
	Если ЗначениеЗаполнено(КонтекстНаСервере.АдресаДанныхДляОчистки) Тогда
		Для Каждого АдресДанных Из КонтекстНаСервере.АдресаДанныхДляОчистки Цикл
			УдалитьИзВременногоХранилища(АдресДанных);
		КонецЦикла;
	КонецЕсли;
	
	ПодписанныеСообщения = Новый Массив;
	
	Для Каждого ОписаниеДанныхКлиент Из ПодписанныеСообщенияКлиент Цикл
		
		ОписаниеДанных = ЭлектронныеДокументыЭДО.НовоеОписаниеПодписанногоСообщения();
		ОписаниеДанных.Ссылка = ОписаниеДанныхКлиент.Ссылка;
		ОписаниеДанных.ПрисоединенныйФайл = ОписаниеДанныхКлиент.ПрисоединенныйФайл;
		ОписаниеДанных.ВыбранныйСертификат = ОписаниеДанныхКлиент.ВыбранныйСертификат;
		
		Если ТипЗнч(ОписаниеДанныхКлиент.СвойстваПодписи) = Тип("Строка") Тогда
			СвойстваПодписи = ПолучитьИзВременногоХранилища(ОписаниеДанныхКлиент.СвойстваПодписи);
			УдалитьИзВременногоХранилища(ОписаниеДанныхКлиент.СвойстваПодписи);
			ОписаниеДанных.СвойстваПодписи = СвойстваПодписи;
		Иначе
			ОписаниеДанных.СвойстваПодписи = ОписаниеДанныхКлиент.СвойстваПодписи;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОписаниеДанныхКлиент.АдресДанныхДляОбновления) Тогда
			ДанныеДляОбновления = ПолучитьИзВременногоХранилища(ОписаниеДанныхКлиент.АдресДанныхДляОбновления);
			УдалитьИзВременногоХранилища(ОписаниеДанныхКлиент.АдресДанныхДляОбновления);
			ОписаниеДанных.Данные = ДанныеДляОбновления;
			ОписаниеДанных.ОбновитьДанные = Истина;
		КонецЕсли;
		
		ПодписанныеСообщения.Добавить(ОписаниеДанных);
		
	КонецЦикла;
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"ЭлектронныеДокументыЭДО.ВыполнитьДействияПоЭДОПослеПодписания",
		ПодписанныеСообщения, КонтекстНаСервере.ПараметрыВыполнения, КонтекстДиагностики,
		КонтекстНаСервере.ИтогДействийПоЭДО);
	
КонецФункции

Функция РезультатДействийПоЭДО(Знач АдресРезультата) Экспорт
	
	РезультатДействийПоЭДОФоне = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	РезультатДействийПоЭДО = ЭлектронныеДокументыЭДО.ОбработатьРезультатДействийПоЭДОФоне(РезультатДействийПоЭДОФоне);
	
	Возврат РезультатДействийПоЭДО;
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаДокументов

Функция РезультатЗагрузкиДанныхОбъектовКонтейнеров(Знач АдресРезультата) Экспорт
	
	РезультатЗагрузкиВФоне = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	РезультатЗагрузки = ЭлектронныеДокументыЭДО.ОбработатьРезультатЗагрузкиВФоне(РезультатЗагрузкиВФоне);
	
	Возврат РезультатЗагрузки;
	
КонецФункции

Функция ЗагрузитьДанныеОбъектовКонтейнеровПослеПроверкиПодписей(Знач ПроверенныеПодписи, Знач АдресКонтекста, Знач КонтекстДиагностики) Экспорт
	
	Контекст = ПолучитьИзВременногоХранилища(АдресКонтекста);
	УдалитьИзВременногоХранилища(АдресКонтекста);
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"ЭлектронныеДокументыЭДО.ЗагрузитьДанныеОбъектовКонтейнеровПослеПроверкиПодписей",
		Контекст.ДанныеДокументов, ПроверенныеПодписи, КонтекстДиагностики,
		Контекст.ОтпечаткиСертификатов, Контекст.ПаролиСертификатов);
	
КонецФункции

#КонецОбласти

#Область ВидыДокументов

Функция ИспользоватьКраткоеПредставлениеВидовДокументов() Экспорт
	Возврат ОбщегоНазначения.ЭтоМобильныйКлиент();
КонецФункции

#КонецОбласти

#Область Подписи

Функция ПроверитьПодписиДокумента(Знач ЭлектронныйДокумент, КонтекстДиагностики) Экспорт
	Возврат ЭлектронныеДокументыЭДО.ПроверитьПодписиДокумента(ЭлектронныйДокумент, КонтекстДиагностики);
КонецФункции

Функция ЗаписатьРезультатПроверкиПодписейДокумента(Знач ПроверенныеПодписи) Экспорт
	Возврат ЭлектронныеДокументыЭДО.ЗаписатьРезультатПроверкиПодписейДокумента(ПроверенныеПодписи);
КонецФункции

#КонецОбласти

#КонецОбласти