
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого Элт Из СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("ДатаДок,НомДок,ТипДок", ",") Цикл 
		Параметры.Свойство(Элт, ЭтотОбъект[Элт]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	Результат = Новый Структура();
	Для Каждого Элт Из СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("ДатаДок,НомДок,ТипДок", ",") Цикл 
		Результат.Вставить(Элт, ЭтотОбъект[Элт]);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТипДок) И ЗначениеЗаполнено(НомДок) И ЗначениеЗаполнено(ДатаДок) Тогда 
		ОписаниеКА = ТипДок + " №" + ?(ЗначениеЗаполнено(НомДок), НомДок, "б/н") + " от " + Формат(ДатаДок, "ДЛФ=DD; ДП=-");
		Результат.Вставить("ФлагОшибки", Ложь);
	Иначе
		ОписаниеКА = "<Необходимо заполнить реквизиты документа>";
		Результат.Вставить("ФлагОшибки", Истина);
	КонецЕсли;
	Результат.Вставить("ОписаниеКА", СокрЛП(СтрЗаменить(ОписаниеКА, "  ", " ")));
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры
