//@strict-types

#Область ПрограммныйИнтерфейс

Функция СоздатьИлиОбновитьИсходящийДокумент(ДокументОтчетности, РежимОбновления = Ложь) Экспорт
	
	Возврат ОтчетностьВКонтролирующиеОрганы.СоздатьИлиОбновитьИсходящийДокумент(ДокументОтчетности, РежимОбновления);
	
КонецФункции

Функция СоздатьИлиОбновитьВходящийДокумент(ДокументОтчетности, РежимОбновления = Ложь) Экспорт
	
	Возврат ОтчетностьВКонтролирующиеОрганы.СоздатьИлиОбновитьВходящийДокумент(ДокументОтчетности, РежимОбновления);
	
КонецФункции

#КонецОбласти
