#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ТипДокумента <> Перечисления.ТипыДокументовЭДО.Прикладной Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПрикладнойТипДокумента");
	КонецЕсли;
	
	Если ТипДокумента <> Перечисления.ТипыДокументовЭДО.Внутренний Тогда 
		МассивНепроверяемыхРеквизитов.Добавить("ИдентификаторКомандыПечати");
		МассивНепроверяемыхРеквизитов.Добавить("ИдентификаторОбъектаУчета");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивНепроверяемыхРеквизитов) Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипДокумента <> Перечисления.ТипыДокументовЭДО.Прикладной Тогда
		ПрикладнойТипДокумента = Неопределено;
	КонецЕсли;
	
	Если ТипДокумента <> Перечисления.ТипыДокументовЭДО.Внутренний Тогда 
		ИдентификаторОбъектаУчета = Неопределено;
		ИдентификаторКомандыПечати = "";
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ЭтоНовый И Не Отказ Тогда
		ЭлектронныеДокументыЭДОСобытия.ПриЗаписиНовогоВидаДокумента(Ссылка, Отказ);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
