////////////////////////////////////////////////////////////////////////////////
// Модуль содержит переопределяемые процедуры и функции.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции получения сведений об организации.

// Функция возвращает сведения об организации.
//
// Параметры:
//   Организация       - СправочникСсылка.Организации - ссылка на элемент справочника "Организации".
//   ДатаЗначения      - Дата - дата, на которую нужно получить сведения.
//   СписокПоказателей - СписокЗначений - список показателей, значения которых нужно вернуть.
//  
// Возвращаемое значение:
//   Структура - структура с ключами из списка показателей и возвращаемыми значениями.
//
// Пример:
//	 ОргСведения = Новый Структура;
//   Для Каждого Показатель Из СписокПоказателей Цикл
//  	 ИмяПоказателя = Показатель.Представление;
//       Если Имяпоказателя = "КодНО" Тогда
//      	 Значение = Организация.КодНалоговогоОргана;
//       ИначеЕсли ИмяПоказателя = "ОГРН" Тогда
//      	 Значение = Организация.ОГРН;
//       Иначе
//      	 Значение = "";
//       КонецЕсли;
//       ОргСведения.Вставить(ИмяПоказателя, Значение);
//   КонецЦикла;
//   Возврат ОргСведения;
//
Функция ПолучитьСведенияОбОрганизации(Знач Организация, Знач ДатаЗначения = Неопределено, Знач СписокПоказателей = Неопределено) Экспорт
	
	ДанныеБанковскогоСчета = Неопределено;

	// Структура, в которой будут возвращаться найденные значения
	СведенияОбОрганизации = Новый Структура;
	
	Если ДатаЗначения = Неопределено Тогда
		ДатаЗначения = ТекущаяДатаСеанса();
	КонецЕсли;
	ДатаЗначения = КонецДня(ДатаЗначения);
	
	ПустаяДата = '00010101000000';
	ПустойАдрес = ",,,,,,,,,";
	
	// проверить что не осталось Организаций
	ОрганизацияОбъект = Организация.ПолучитьОбъект();
	
	Кэш = Новый Структура;
	Кэш.Вставить("Организация", ОрганизацияОбъект);
	Кэш.Вставить("ДатаЗначения", ДатаЗначения);
	
	// вроде у нас не поддверживаются такие сценарии?
	ПБОЮЛ = ОрганизацияОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
	Кэш.Вставить("ПБОЮЛ", ПБОЮЛ);
	
	РоссийскийАдрес = Новый Соответствие;
	РоссийскийАдрес.Вставить("Индекс",          "");
	РоссийскийАдрес.Вставить("Регион",          "");
	РоссийскийАдрес.Вставить("КодРегиона",      "");
	РоссийскийАдрес.Вставить("Район",           "");
	РоссийскийАдрес.Вставить("Город",           "");
	РоссийскийАдрес.Вставить("НаселенныйПункт", "");
	РоссийскийАдрес.Вставить("Улица",           "");
	РоссийскийАдрес.Вставить("Дом",             "");
	РоссийскийАдрес.Вставить("Корпус",          "");
	РоссийскийАдрес.Вставить("Квартира",        "");
	
	Если СписокПоказателей = Неопределено Тогда
		СписокПоказателей = ВсеПоказателиСведенийОбОрганизации();
	КонецЕсли;
	
	СписокПоказателейЭтоМассив = (ТипЗнч(СписокПоказателей) = Тип("Массив"));
	
	// Дальше есть чтение реквизитов от ссылки, чтобы данные получались из объектного кэша.
	// Вызов получения этих свеедний будет происходить редко.
	
	Для Каждого Показатель Из СписокПоказателей Цикл
		
		Значение = ""; // значение показателя по умолчанию
		
		ИмяПоказателя = ?(СписокПоказателейЭтоМассив, Показатель, Показатель.Представление);
		
		#Область ОбщиеСведения
			
		Если Имяпоказателя = "КодНО"
			Или Имяпоказателя = "КодНалоговогоОргана" Тогда
			
			// данный реквизит заполняется из регистрации в налоговом органе организации
			Если ЗначениеЗаполнено(ОрганизацияОбъект.РегистрацияВНалоговомОргане) Тогда
				Значение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОрганизацияОбъект.РегистрацияВНалоговомОргане, "Код");
			КонецЕсли;
			
			// если заполнить не удалось
			Если Не ЗначениеЗаполнено(Значение) Тогда
				Значение = Организация.КодНалоговогоОргана;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КодОрганаПФР" Тогда
			
			Значение = Организация.КодОрганаПФР;
			
		ИначеЕсли ИмяПоказателя	 = "РегНомПФР" Тогда
			
			Значение = Организация.РегистрационныйНомерПФР;
			
		ИначеЕсли ИмяПоказателя = "КодОрганаФСГС" Тогда
			
			Значение = Организация.КодОрганаФСГС;
			
		ИначеЕсли ИмяПоказателя = "ОГРН" Тогда
			
			Значение = Организация.ОГРН;
		
		ИначеЕсли ИмяПоказателя = "НаимЮЛСокр"  Тогда
			
			Значение = ОрганизацияОбъект.Наименование;
		
		ИначеЕсли ИмяПоказателя = "НаимЮЛПол" Тогда
			
			Значение = ОрганизацияОбъект.НаименованиеПолное;
			
		ИначеЕсли ИмяПоказателя = "ИННЮЛ" Тогда
			
			Значение = СокрЛП(ОрганизацияОбъект.ИНН);
			
		ИначеЕсли ИмяПоказателя = "КППЮЛ" Тогда
			
			Значение = СокрЛП(ОрганизацияОбъект.КПП);
			
		ИначеЕсли ИмяПоказателя = "ОГРН" Тогда
			
			Значение = СокрЛП(ОрганизацияОбъект.ОГРН);
			
		КонецЕсли;
		
		#КонецОбласти
		
		#Область КонтактыИАдресаЮЛ
		
		Если ИмяПоказателя = "ТелОрганизации" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ТелефонОрганизации");

			Если Результат <> Неопределено Тогда
				Значение = Результат.Представление;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ФаксОрганизации" Тогда
			
			Если ПБОЮЛ Тогда
				Значение = "";
			Иначе
				ИмяПредопределенного = Справочники.ВидыКонтактнойИнформации.ФаксОрганизации;
				Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Факс, ИмяПредопределенного);
				Результат = ОрганизацияОбъект.КонтактнаяИнформация.НайтиСтроки(Данные);
				Если Результат.Количество() > 0 Тогда
					Значение = Результат[0].Представление;
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдресЭлПочтыИП" Тогда
			Результат = ПолучитьСУчетомКэша(Кэш, "EmailОрганизации");
			Если Результат = Неопределено Тогда
				Значение = "";
			Иначе
				Значение = Результат.Представление;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдресЭлектроннойПочтыОрганизации" Тогда
			
			Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.EmailОрганизации);
	
			Результат = ОрганизацияОбъект.КонтактнаяИнформация.НайтиСтроки(Данные);
			
			Если Результат.Количество() > 0 Тогда
				Значение = Результат[0].Представление;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрПочт" Тогда
			
			ИмяПредопределенного = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации;
			Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, ИмяПредопределенного);
			Результат = ОрганизацияОбъект.КонтактнаяИнформация.НайтиСтроки(Данные);
			
			Если Результат.Количество() > 0 Тогда
				Значение = РегламентированнаяОтчетность.АдресВФормате9Запятых(Результат[0]);
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			Результат = Неопределено;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрПочт_XML" Тогда
			
			Значение = АдресВXML(ОрганизацияОбъект.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации);
			
		ИначеЕсли ИмяПоказателя = "АдрПочт_JSON" Тогда
			
			Значение = АдресВJSON(ОрганизацияОбъект.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации);
		
		ИначеЕсли ИмяПоказателя = "АдрЮР" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				Значение = РегламентированнаяОтчетность.АдресВФормате9Запятых(Результат);
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
		ИначеЕсли ИмяПоказателя = "АдрЮР_XML" Тогда
			
			Значение = АдресВXML(ОрганизацияОбъект.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
			
		ИначеЕсли ИмяПоказателя = "АдрЮР_JSON" Тогда
			
			Значение = АдресВJSON(ОрганизацияОбъект.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
			
		ИначеЕсли ИмяПоказателя = "ПолныйАдрЮР" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				Значение = Результат.Представление;
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;

		ИначеЕсли ИмяПоказателя = "АдрФакт" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ФактАдресОрганизации");
			Если Результат <> Неопределено Тогда
				Значение = РегламентированнаяОтчетность.АдресВФормате9Запятых(Результат);
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрФакт_XML" Тогда
			
			Значение =
				АдресВXML(ОрганизацияОбъект.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
			
		ИначеЕсли ИмяПоказателя = "АдрФакт_JSON" Тогда
			
			Значение =
				АдресВJSON(ОрганизацияОбъект.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
			
			
		ИначеЕсли ИмяПоказателя = "ОргИндекс" Тогда
			
			Результат = ПолучитьЧастьАдресаСУчетомКэша(Кэш, "ЮрАдресОрганизации", "Индекс", РоссийскийАдрес);
			
		ИначеЕсли ИмяПоказателя = "ОргСубъект" Тогда
			
			Результат = ПолучитьЧастьАдресаСУчетомКэша(Кэш, "ЮрАдресОрганизации", "Регион", РоссийскийАдрес);
			
		ИначеЕсли ИмяПоказателя = "ОргКодСубъект" Тогда
			
			Результат = ПолучитьЧастьАдресаСУчетомКэша(Кэш, "ЮрАдресОрганизации", "КодРегиона", РоссийскийАдрес);
			
		ИначеЕсли ИмяПоказателя = "ОргРайон" Тогда
			
			Результат = ПолучитьЧастьАдресаСУчетомКэша(Кэш, "ЮрАдресОрганизации", "Район", РоссийскийАдрес);
			
		ИначеЕсли ИмяПоказателя = "ОргГород" Тогда
			
			Результат = ПолучитьЧастьАдресаСУчетомКэша(Кэш, "ЮрАдресОрганизации", "Город", РоссийскийАдрес);
			
		ИначеЕсли ИмяПоказателя = "ОргНПункт" Тогда
			
			Результат = ПолучитьЧастьАдресаСУчетомКэша(Кэш, "ЮрАдресОрганизации", "НаселенныйПункт", РоссийскийАдрес);
			
		ИначеЕсли ИмяПоказателя = "ОргУлица" Тогда
			
			Результат = ПолучитьЧастьАдресаСУчетомКэша(Кэш, "ЮрАдресОрганизации", "Улица", РоссийскийАдрес);
			
		ИначеЕсли ИмяПоказателя = "ОргДом" Тогда
			
			Результат = ПолучитьЧастьАдресаСУчетомКэша(Кэш, "ЮрАдресОрганизации", "Дом", РоссийскийАдрес);
			
		ИначеЕсли ИмяПоказателя = "ОргКорпус" Тогда
			
			Результат = ПолучитьЧастьАдресаСУчетомКэша(Кэш, "ЮрАдресОрганизации", "Корпус", РоссийскийАдрес);
			
		ИначеЕсли ИмяПоказателя = "ОргКвартира" Тогда
			
			Результат = ПолучитьЧастьАдресаСУчетомКэша(Кэш, "ЮрАдресОрганизации", "Квартира", РоссийскийАдрес);
			
		КонецЕсли;
		
		#КонецОбласти
		
	#Область КонтактыИАдресИП
		
		Если ИмяПоказателя = "АдрМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				ФизическоеЛицо = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");
				Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
					Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", ФизическоеЛицо);
					Если Результат <> Неопределено Тогда
						Значение = РегламентированнаяОтчетность.АдресВФормате9Запятых(Результат);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрМЖ_XML" Тогда
			Если ПБОЮЛ Тогда
				Значение = АдресВXML(Организация.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
			Иначе
				Значение = Неопределено;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрМЖ_JSON" Тогда
			Если ПБОЮЛ Тогда
				Значение = АдресВJSON(Организация.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
			Иначе
				Значение = Неопределено;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрПрописки" Тогда
			
			Если ПБОЮЛ Тогда
				
				ФизическоеЛицо = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");
				Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
					Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдресПрописки", ФизическоеЛицо);
					Если Результат <> Неопределено Тогда
						Значение = РегламентированнаяОтчетность.АдресВФормате9Запятых(Результат);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрПрописки_XML" Тогда
			Если ПБОЮЛ Тогда
				Значение = АдресВXML(Организация.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
			Иначе
				Значение = Неопределено;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрПрописки_JSON" Тогда
			Если ПБОЮЛ Тогда
				Значение = АдресВJSON(Организация.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
			Иначе
				Значение = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
		#КонецОбласти
		
		#Область БанковскийСчетОрганизации
		
		Если ИмяПоказателя = "БанкСчетНомер" Тогда
			
			Если ДанныеБанковскогоСчета = Неопределено Тогда
				ДанныеБанковскогоСчета =
					Справочники.БанковскиеСчета.ПолучитьРеквизитыБанковскогоСчетаОрганизации(Организация.ОсновнойБанковскийСчет);
			КонецЕсли;
			
			Значение = ДанныеБанковскогоСчета.НомерСчета;
			
		ИначеЕсли ИмяПоказателя = "БанкСчетНаимБанка" Тогда
			
			Если ДанныеБанковскогоСчета = Неопределено Тогда
				ДанныеБанковскогоСчета =
					Справочники.БанковскиеСчета.ПолучитьРеквизитыБанковскогоСчетаОрганизации(Организация.ОсновнойБанковскийСчет);
			КонецЕсли;
			
			Если ДанныеБанковскогоСчета.Банк <> Неопределено Тогда
				Значение = ДанныеБанковскогоСчета.НаименованиеБанка;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "БанкСчетКоррСчетБанка" Тогда
			
			Если ДанныеБанковскогоСчета = Неопределено Тогда
				ДанныеБанковскогоСчета =
					Справочники.БанковскиеСчета.ПолучитьРеквизитыБанковскогоСчетаОрганизации(Организация.ОсновнойБанковскийСчет);
			КонецЕсли;
			
			Значение = ДанныеБанковскогоСчета.КоррСчет;
			
		ИначеЕсли ИмяПоказателя = "БанкСчетБИКБанка" Тогда
			
			Если ДанныеБанковскогоСчета = Неопределено Тогда
				ДанныеБанковскогоСчета =
					Справочники.БанковскиеСчета.ПолучитьРеквизитыБанковскогоСчетаОрганизации(Организация.ОсновнойБанковскийСчет);
			КонецЕсли;
			
			Значение = ДанныеБанковскогоСчета.БИК;
			
		КонецЕсли;
		
		#КонецОбласти

		#Область СведенияОРруководителеОрганизации
		
		Если ИмяПоказателя = "ФИОРук"
			Или ИмяПоказателя = "ФамилияРук"
			Или ИмяПоказателя = "ИмяРук"
			Или ИмяПоказателя = "ОтчествоРук" Тогда
			
			Сведения = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если ЗначениеЗаполнено(Сведения.Пользователь) Тогда
				Если ЗначениеЗаполнено(Сведения.ФизическоеЛицо) Тогда
					Значение = Сведения.ФизическоеЛицо.Наименование;
				Иначе
					Значение = Сведения.Пользователь.Наименование;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Значение) И ИмяПоказателя <> "ФИОРук" Тогда
				// Получим отдельные части ФИО.
				ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(Значение);
				Если ИмяПоказателя = "ФамилияРук" Тогда
					Значение = ЧастиИмени.Фамилия;
				ИначеЕсли ИмяПоказателя = "ИмяРук" Тогда
					Значение = ЧастиИмени.Имя;
				ИначеЕсли ИмяПоказателя = "ОтчествоРук" Тогда
					Значение = ЧастиИмени.Отчество;
				КонецЕсли;
				
			КонецЕсли;
			
			
		ИначеЕсли ИмяПоказателя = "ДолжнРук" Тогда
			Сведения = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если ЗначениеЗаполнено(Сведения.Пользователь) Тогда
				СведенияОПользователе =
					РегистрыСведений.СведенияОПользователяхДокументооборот.ПолучитьСведенияОПользователе(
						Сведения.Пользователь);
				Значение = СведенияОПользователе.Должность;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИННРук" Тогда
			
			Если ПБОЮЛ Тогда
				Значение = ОрганизацияОбъект.ИНН;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДатаРождРук" Тогда
			//ЗащитаПерсональныхДанных
			Сведения = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если ЗначениеЗаполнено(Сведения.ФизическоеЛицо) Тогда
				Значение = Сведения.ФизическоеЛицо.ДатаРождения;
			Иначе
				Значение = ПустаяДата;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "МестоРождРук" Тогда
			
			Значение = "";
			
		ИначеЕсли ИмяПоказателя = "ПолРук" Тогда
			
			Сведения = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если ЗначениеЗаполнено(Сведения.ФизическоеЛицо) Тогда
				Если Сведения.ФизическоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
					Значение = 2;
				ИначеЕсли Сведения.ФизическоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
					Значение = 1;
				Иначе
					Значение = 0;
				КонецЕсли;
			Иначе
				Значение = 0;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ГраждРук" Тогда
			
			Значение = "";
			
		ИначеЕсли ИмяПоказателя = "ГраждСтранаРук" Тогда
			
			Значение = "";
			
		ИначеЕсли ИмяПоказателя = "ТелРук" Тогда
			
			Сведения = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если ЗначениеЗаполнено(Сведения.Пользователь) Тогда
				Значение =
					УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
						Сведения.Пользователь,
						Справочники.ВидыКонтактнойИнформации.ТелефонПользователя,
						Кэш.ДатаЗначения,
						Истина);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Значение)
				И ЗначениеЗаполнено(Сведения.ФизическоеЛицо) Тогда
				Значение =
					УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
						Сведения.ФизическоеЛицо,
						Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица,
						Кэш.ДатаЗначения,
						Истина);
			КонецЕсли;
			
		ИначеЕсли СтрЗаканчиваетсяНа(ИмяПоказателя, "УдЛичнРук") Тогда
			//ЗащитаПерсональныхДанных
			Сведения = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если ЗначениеЗаполнено(Сведения.ФизическоеЛицо) Тогда
				УдостоверениеЛичности =
					ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", Сведения.ФизическоеЛицо);
				Если ЗначениеЗаполнено(УдостоверениеЛичности) Тогда
					
					Если ИмяПоказателя = "КодУдЛичнРук" 
						Или ИмяПоказателя = "КодПодрУдЛичнРук"
						Или ИмяПоказателя = "ВидУдЛичнРук" Тогда
						
						Если ЗначениеЗаполнено(УдостоверениеЛичности.ВидДокумента) Тогда
							
							Если ИмяПоказателя = "КодУдЛичнРук" 
								Или ИмяПоказателя = "КодПодрУдЛичнРук" Тогда
								Значение = УдостоверениеЛичности.ВидДокумента.КодМВД;
							ИначеЕсли ИмяПоказателя = "ВидУдЛичнРук" Тогда
								Значение = УдостоверениеЛичности.ВидДокумента.Наименование;
							КонецЕсли;
						КонецЕсли;
						
					ИначеЕсли ИмяПоказателя = "ОрганВыданУдЛичнРук" Тогда
						Значение = УдостоверениеЛичности.КемВыдан;
					
					ИначеЕсли ИмяПоказателя = "СерияУдЛичнРук" Тогда
						Значение = УдостоверениеЛичности.Серия;
						
					ИначеЕсли ИмяПоказателя = "НомерУдЛичнРук" Тогда
						Значение = УдостоверениеЛичности.Номер;
						
					ИначеЕсли ИмяПоказателя = "ДатаУдЛичнРук" Тогда
						Значение = УдостоверениеЛичности.ДатаВыдачи;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрМЖРукРФ" Тогда
			
			Сведения = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если ЗначениеЗаполнено(Сведения.ФизическоеЛицо) Тогда
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес",Сведения.ФизическоеЛицо);
				Если Результат <> Неопределено Тогда
					Значение = РегламентированнаяОтчетность.АдресВФормате9Запятых(Результат);
				Иначе
					Значение = ПустойАдрес;
				КонецЕсли;
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрМЖРукРФ_XML"
			Или ИмяПоказателя = "АдрМЖРукРФ_JSON" Тогда
			
			Сведения = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если ЗначениеЗаполнено(Сведения.ФизическоеЛицо) Тогда
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Сведения.ФизическоеЛицо);
				Если Результат <> Неопределено Тогда
					Если ИмяПоказателя = "АдрМЖРукРФ_XML" Тогда
						Значение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(
									Результат.ЗначенияПолей, Результат.Представление, Результат.Вид);
					ИначеЕсли ИмяПоказателя = "АдрМЖРукРФ_JSON" Тогда
						Значение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(
									Результат.Значение, Результат.Вид);
					КонецЕсли;
				Иначе
					Значение = Неопределено;
				КонецЕсли;
			Иначе
				Значение = Неопределено;
			КонецЕсли;
			
		ИначеЕсли СтрЗаканчиваетсяНа(ИмяПоказателя, "МЖРук") Тогда
			
			Сведения = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если ЗначениеЗаполнено(Сведения.ФизическоеЛицо) Тогда
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Сведения.ФизическоеЛицо);
				Если Результат <> Неопределено Тогда
					
					РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
					Если ИмяПоказателя = "ИндексМЖРук" Тогда
						Значение = РоссийскийАдрес["Индекс"];
						
					ИначеЕсли ИмяПоказателя = "СубъектМЖРук" Тогда
						Значение = РоссийскийАдрес["Регион"];
						
					ИначеЕсли ИмяПоказателя = "КодСубъектМЖРук" Тогда
						Значение = РоссийскийАдрес["КодРегиона"];
						
					ИначеЕсли ИмяПоказателя = "РайонМЖРук" Тогда
						Значение = РоссийскийАдрес["Район"];
						
					ИначеЕсли ИмяПоказателя = "ГородМЖРук" Тогда
						Значение = РоссийскийАдрес["Город"];
						
					ИначеЕсли ИмяПоказателя = "НПунктМЖРук" Тогда
						Значение = РоссийскийАдрес["НаселенныйПункт"];
						
					ИначеЕсли ИмяПоказателя = "УлицаМЖРук" Тогда
						Значение = РоссийскийАдрес["Улица"];
						
					ИначеЕсли ИмяПоказателя = "ДомМЖРук" Тогда
						Значение = РоссийскийАдрес["Дом"];
						
					ИначеЕсли ИмяПоказателя = "КорпусМЖРук" Тогда
						Значение = РоссийскийАдрес["Корпус"];
						
					ИначеЕсли ИмяПоказателя = "КвартираМЖРук" Тогда
						Значение = РоссийскийАдрес["Квартира"];
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		#КонецОбласти
		
		#Область СведенияОГлавномБухгалтере
		
		Если ИмяПоказателя = "ФИОБух"
			Или ИмяПоказателя = "ФамилияБух"
			Или ИмяПоказателя = "ИмяБух"
			Или ИмяПоказателя = "ОтчествоБух" Тогда
			
			Сведения = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если ЗначениеЗаполнено(Сведения.Пользователь) Тогда
				Если ЗначениеЗаполнено(Сведения.ФизическоеЛицо) Тогда
					Значение = Сведения.ФизическоеЛицо.Наименование;
				Иначе
					Значение = Сведения.Пользователь.Наименование;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Значение) И ИмяПоказателя <> "ФИОБух" Тогда
				// Получим отдельные части ФИО.
				ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(Значение);
				Если ИмяПоказателя = "ФамилияБух" Тогда
					Значение = ЧастиИмени.Фамилия;
				ИначеЕсли ИмяПоказателя = "ИмяБух" Тогда
					Значение = ЧастиИмени.Имя;
				ИначеЕсли ИмяПоказателя = "ОтчествоБух" Тогда
					Значение = ЧастиИмени.Отчество;
				КонецЕсли;
				
			КонецЕсли;
			
			
		ИначеЕсли ИмяПоказателя = "ДатаРождБух" Тогда
			//ЗащитаПерсональныхДанных
			Сведения = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если ЗначениеЗаполнено(Сведения.ФизическоеЛицо) Тогда
				Значение = Сведения.ФизическоеЛицо.ДатаРождения;
			Иначе
				Значение = ПустаяДата;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "МестоРождБух" Тогда
			
			Значение = "";
			
		ИначеЕсли ИмяПоказателя = "ПолБух" Тогда
			
			Сведения = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если ЗначениеЗаполнено(Сведения.ФизическоеЛицо) Тогда
				Если Сведения.ФизическоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
					Значение = 2;
				ИначеЕсли Сведения.ФизическоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
					Значение = 1;
				Иначе
					Значение = 0;
				КонецЕсли;
			Иначе
				Значение = 0;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ГраждБух" Тогда
			
			Значение = "";
			
		ИначеЕсли ИмяПоказателя = "ГраждСтранаБух" Тогда
			
			Значение = "";
			
		ИначеЕсли ИмяПоказателя = "ТелБух" Тогда
			
			Сведения = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если ЗначениеЗаполнено(Сведения.Пользователь) Тогда
				Значение =
					УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
						Сведения.Пользователь,
						Справочники.ВидыКонтактнойИнформации.ТелефонПользователя,
						Кэш.ДатаЗначения,
						Истина);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Значение)
				И ЗначениеЗаполнено(Сведения.ФизическоеЛицо) Тогда
				Значение =
					УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
						Сведения.ФизическоеЛицо,
						Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица,
						Кэш.ДатаЗначения,
						Истина);
			КонецЕсли;
			
		ИначеЕсли СтрЗаканчиваетсяНа(ИмяПоказателя, "УдЛичнБух") Тогда
			
			//ЗащитаПерсональныхДанных
			Сведения = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если ЗначениеЗаполнено(Сведения.ФизическоеЛицо) Тогда
				УдостоверениеЛичности =
					ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", Сведения.ФизическоеЛицо);
				Если ЗначениеЗаполнено(УдостоверениеЛичности) Тогда
					
					Если ИмяПоказателя = "КодУдЛичнБух" 
						Или ИмяПоказателя = "КодПодрУдЛичнБух"
						Или ИмяПоказателя = "ВидУдЛичнБух" Тогда
						
						Если ЗначениеЗаполнено(УдостоверениеЛичности.ВидДокумента) Тогда
							
							Если ИмяПоказателя = "КодУдЛичнБух" 
								Или ИмяПоказателя = "КодПодрУдЛичнБух" Тогда
								Значение = УдостоверениеЛичности.ВидДокумента.КодМВД;
							ИначеЕсли ИмяПоказателя = "ВидУдЛичнБух" Тогда
								Значение = УдостоверениеЛичности.ВидДокумента.Наименование;
							КонецЕсли;
						КонецЕсли;
						
					ИначеЕсли ИмяПоказателя = "ОрганВыданУдЛичнБух" Тогда
						Значение = УдостоверениеЛичности.КемВыдан;
					
					ИначеЕсли ИмяПоказателя = "СерияУдЛичнБух" Тогда
						Значение = УдостоверениеЛичности.Серия;
						
					ИначеЕсли ИмяПоказателя = "НомерУдЛичнБух" Тогда
						Значение = УдостоверениеЛичности.Номер;
						
					ИначеЕсли ИмяПоказателя = "ДатаУдЛичнБух" Тогда
						Значение = УдостоверениеЛичности.ДатаВыдачи;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
			
		#КонецОбласти
		
		СведенияОбОрганизации.Вставить(ИмяПоказателя, Значение);
		
	КонецЦикла;
	
	Возврат СведенияОбОрганизации;
	
КонецФункции


// Функция возвращает сведения о физлице.
//
// Параметры:
//   ФизЛицо           - СправочникСсылка.ФизическиеЛица - ссылка на элемент справочника "ФизическиеЛица".
//   ДатаЗначения      - Дата - дата, на которую нужно получить сведения.
//   МассивПоказателей - Массив - массив показателей, значения которых нужно вернуть.
//  
// Возвращаемое значение:
//   Структура - структура с ключами из массива показателей и возвращаемыми значениями.
//
// Пример:
//	 Если МассивПоказателей = Неопределено Тогда
//		 МассивПоказателей = Новый Массив;
//		 МассивПоказателей.Добавить("ИНН");
//		 МассивПоказателей.Добавить("Фамилия");
//		 МассивПоказателей.Добавить("Имя");
//		 МассивПоказателей.Добавить("Отчество");
//	 КонецЕсли;
//	 ФЛСведения = Новый Структура;
//	 Для Каждого ИмяПоказателя Из МассивПоказателей Цикл
//		 Если ИмяПоказателя = "ИНН" Тогда
//			 Значение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФизЛицо, "ИНН");
//		 ИначеЕсли ИмяПоказателя = "Фамилия"
//			   ИЛИ ИмяПоказателя = "Имя"
//			   ИЛИ ИмяПоказателя = "Отчество" Тогда
//			 ТаблицаСрезПоследних = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизическоеЛицо", ФизЛицо));
//			 Если ТаблицаСрезПоследних.Количество() > 0 Тогда
//				 Значение = ТаблицаСрезПоследних[0][ИмяПоказателя];
//			 Иначе
//				 Значение = "";
//			 КонецЕсли;
//		 ИначеЕсли ИмяПоказателя = "ТелефонРабочий" Тогда
//			 Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(
//				 Справочники.ВидыКонтактнойИнформации, "ТелефонРабочийФизическиеЛица") Тогда
//				 Значение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
//				 ФизЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица, ДатаЗначения);
//			 Иначе
//				 Значение = "";
//			 КонецЕсли;
//		 ИначеЕсли ИмяПоказателя = "ТелефонДомашний" Тогда
//			 Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(
//				 Справочники.ВидыКонтактнойИнформации, "ТелефонДомашнийФизическиеЛица") Тогда
//				 Значение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
//				 ФизЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица, ДатаЗначения);
//			 Иначе
//				 Значение = "";
//			 КонецЕсли;
//		 ИначеЕсли ИмяПоказателя = "АдресЭлектроннойПочты" Тогда
//			 Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(
//				 Справочники.ВидыКонтактнойИнформации, "EMailФизическиеЛица") Тогда
//				 Значение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
//				 ФизЛицо, Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица, ДатаЗначения);
//			 Иначе
//				 Значение = "";
//			 КонецЕсли;
//		 Иначе
//			 Значение = "";
//		 КонецЕсли;
//		 ФЛСведения.Вставить(ИмяПоказателя, Значение);
//	 КонецЦикла;
//	 Возврат ФЛСведения;
//
Функция ПолучитьСведенияОФизЛице(Знач ФизЛицо, Знач МассивПоказателей = Неопределено, Знач ДатаЗначения = Неопределено) Экспорт
	
	ДанныеФизическогоЛица = Новый Структура;
	
	Если ДатаЗначения = Неопределено Тогда
		ДатаЗначения = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если МассивПоказателей = Неопределено Тогда
		ДанныеФизическогоЛица.Вставить("ИНН");
		ДанныеФизическогоЛица.Вставить("Фамилия");
		ДанныеФизическогоЛица.Вставить("Имя");
		ДанныеФизическогоЛица.Вставить("Отчество");
	Иначе
		Для Каждого ЗапрашиваемыйПоказатель Из МассивПоказателей Цикл
			ДанныеФизическогоЛица.Вставить(ЗапрашиваемыйПоказатель);
		КонецЦикла;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(ФизЛицо) Тогда
		
		ФИО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФизЛицо, "Наименование");
		ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИО);
		ЗаполнитьЗначенияСвойств(ДанныеФизическогоЛица, ЧастиИмени);
		
	КонецЕсли;
	
	Возврат ДанныеФизическогоЛица;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции получения сведений об обособленном подразделении.

// Процедура возвращает признак того, что в конфигурации используется механизм отправки
// по различным направлениям в Росстат (для обособленных подразделений).
//
// Параметры:
// ПризнакИспользования - Булево - Истина, если реализована отправка по различным направлениям
Процедура ИспользуетсяОтправкаВРосстатПоРазнымНаправлениям(ПризнакИспользования) Экспорт
	
КонецПроцедуры

// Получает код ОКПО обособленного подразделения.
// 
// Параметры:
//   Подразделение - СправочникСсылка.ПодразделенияОрганизаций - подразделение организации.
//   КодОКПО       - Строка (длина - 14) - код ОКПО обособленного подразделения.
//
Процедура ПолучитьКодОКПОПодразделения(Знач Подразделение, КодОКПО) Экспорт
	
КонецПроцедуры

// Получает код органа ФСГС обособленного подразделения.
// 
// Параметры:
//   Подразделение - СправочникСсылка.ПодразделенияОрганизаций - подразделение организации.
//   КодФСГС       - Строка (длина - 5) - код органа ФСГС для подразделения (например, "23-45").
//
Процедура ПолучитьКодОрганаФСГСПодразделения(Знач Подразделение, КодФСГС) Экспорт
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции механизма автоматического заполнения.

// Функция возвращает структуру показателей.
// Ключ структуры - идентификатор показателя.
// Значение структуры – массив из трех элементов:
// 	- признак автозаполнения показателя;
//  - признак расшифровки показателя;
//  - признак запрета редактирования показателя.
//
// Параметры:
// 	 ИДОтчета         - Строка - идентификатор отчета.
//	 ИДРедакцииОтчета - Строка - идентификатор редакции формы отчета.
//   ПараметрыОтчета  - Структура - структура параметров отчета.
//
// Возвращаемое значение:
//   Структура - показатели отчета.
//
// Пример реализации:
//	 ПоказателиОтчета = Новый Структура;
//	 Если ИДОтчета = "РегламентированныйОтчетРСВ1" Тогда
//		 Если ИДРедакцииОтчета = "ФормаОтчета2011Кв1" Тогда
//			РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000100010003", Истина, Истина, Истина);
//		 КонецЕсли;
//	 КонецЕсли;
//	 Возврат ПоказателиОтчета;
//
Функция ПолучитьСведенияОПоказателяхОтчета(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета = Неопределено) Экспорт
	
КонецФункции

// Функция возвращает признак реализации настройки автозаполняемых показателей регл. отчета.
//
// Параметры:
//   ИДОтчета         - Строка - идентификатор отчета.
//	 ИДРедакцииОтчета - Строка - идентификатор редакции формы отчета.
//
// Возвращаемое значение:
//   Булево - признак реализации настройки автозаполняемых показателей регл. отчета.
//
// Пример:
//   Если ИДОтчета = "РегламентированныйОтчетСтатистикаФормаП1" Тогда
//		 Если ИДРедакцииОтчета = "ФормаОтчета2010Кв1" Тогда	
//			 Возврат Истина;
//		 КонецЕсли;
//	 КонецЕсли;
//	 Возврат Ложь;
//
Функция РеализованаНастройкаАвтозаполняемыхПоказателейРеглОтчета(ИДОтчета, ИДРедакцииОтчета) Экспорт
	
КонецФункции

// Процедура заполняет переданную в виде контейнера структуру данных отчета.
//
// Параметры:
//   ИДОтчета - Строка - имя регл. отчета.
//   ИДРедакцииОтчета - Строка - имя формы регл. отчета.
//   ПараметрыОтчета - Структура - параметры регл. отчета.
//   Контейнер - Структура - данные регл. отчета.
//
// Пример:
//	Если ИДОтчета = "РегламентированныйОтчетРСВ1" Тогда
//		Если ИДРедакцииОтчета = "ФормаОтчета2011Кв1" Тогда	
//			Контейнер.Раздел30.П000300030103 = 100;
//			Контейнер.Раздел41.Добавить();
//		КонецЕсли;
//	КонецЕсли;
//
Процедура ЗаполнитьОтчет(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер) Экспорт
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции статистики.

// Автоматически заполняет отчет в фоновом режиме.
//
Процедура ЗаполнитьОтчетВФоне(ПараметрыОтчета, АдресХранилища) Экспорт
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры интеграции со списком задач бухгалтера.

// Процедура изменят заголовки кнопок.
//
// Параметры:
//   КнопкаСправочникОтчетов - Строка - заголовок кнопки, при щелчке по которой открывается справочник регл. отчетов.
//   КнопкаКалендарь - Строка - заголовок кнопки, при щелчке по которой открывается календарь бухгалтера.
//
Процедура НастроитьКнопкиКалендаряБухгалтера(КнопкаСправочникОтчетов = Неопределено, КнопкаКалендарь = Неопределено) Экспорт
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры интерфейса взаимодействия с конфигурациями (библиотеками)
// - потребителями.

// Процедура возвращает структуру с табличными документами разделов 2.5 и 6 формы РСВ-1.
//
// Параметры:
//   СсылкаНаСохрРеглОтчет - ДокументСсылка.РегламентированныйОтчет - ссылка на регламентированный отчет.
//   СтруктураРазделов     - Структура - разделы:
//     * ключ     - Строка - имя раздела;
//     * значение - Массив - массив структур с полями:
//      ** Описание - Строка - описание;
//      ** ТабличныйДокумент - ТабличныйДокумент - раздел.
//   НумероватьСтраницы              - Булево - признак нумерации страниц.
//   НомерПервойстраницыРаздела25    - Число - номер первой страницы раздела 2.5.
//   НомерПоследнейстраницыРаздела25 - Число - номер последней страницы раздела 2.5.
//   НомерПервойстраницыРаздела6     - Число - номер первой страницы раздела 6.
//   ОбщееКоличествоСтраницРаздела6  - Число - общее количество страниц раздела 6.
//
Процедура ПолучитьРаздел25иРаздел6ФормыРСВ1(СсылкаНаСохрРеглОтчет, СтруктураРазделов,
	                                        НумероватьСтраницы,
											НомерПервойстраницыРаздела25,
											НомерПоследнейстраницыРаздела25,
											НомерПервойстраницыРаздела6,
											ОбщееКоличествоСтраницРаздела6) Экспорт
	
КонецПроцедуры

// Процедура заполняет данные для выгрузки раздела 2.5 формы РСВ-1
//
// Параметры:
//   СсылкаНаСохрРеглОтчет - ДокументСсылка.РегламентированныйОтчет - ссылка на регламентированный отчет.
//   ДанныеРаздела25       - Структура - с ключами "Таблица_2_5_1" и "Таблица_2_5_2":
//     * Таблица_2_5_1     - ТаблицаЗначений - заполняется данными многострочной
//                           части подраздела 2.5.1 по колонкам 2 - 5:
//       ** П000251000102  - Число - (длина - 15, точность - 2);
//       ** П000251000103  - Число - (длина - 15, точность - 2);
//       ** П000251000104  - Число - (длина - 3, точность - 0);
//       ** П000251000105  - Строка - (длина - 100);
//     * Таблица_2_5_2     - ТаблицаЗначений - заполняется данными многострочной
//                           части подраздела 2.5.2 по колонкам 2 - 8:
//       ** П000252000102  - Число - (длина - 1, точность - 0);
//       ** П000252000103  - Число - (длина - 4, точность - 0);
//       ** П000252000104  - Число - (длина - 15, точность - 2);
//       ** П000252000105  - Число - (длина - 15, точность - 2);
//       ** П000252000106  - Число - (длина - 15, точность - 2);
//       ** П000252000107  - Число - (длина - 3, точность - 0);
//       ** П000252000108  - Строка - (длина - 100).
//
Процедура ЗаполнитьДанныеДляВыгрузкиРаздела25РСВ_1(СсылкаНаСохрРеглОтчет, ДанныеРаздела25) Экспорт
	
КонецПроцедуры

// Процедура вызывается при создании на сервере формы регламентированного отчета.
//
// Параметры:
//  ИмяОтчета - Строка - имя отчета в дереве объектов метаданных;
//  ИмяФормы  - Строка - имя формы отчета;
//  Форма     - УправляемаФорма - форма, из которой вызывается процедура.
//
Процедура ПриСозданииФормыРеглОтчета(ИмяОтчета, ИмяФормы, Форма) Экспорт
	
КонецПроцедуры

#Область ПроцедурыИФункцииСпискаЗадачБухгалтера

// Вызывается при изменении ручных статусов.
// См. также ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервераПереопределяемый.ПриИзмененииСтатусаОтправкиДокумента
//
// Параметры:
//	Ссылка - ДокументСсылка - ссылка на документ.
//	Статус - Строка         - актуальный статус; предполагает сравнение с СтатусСданоСтрокой().
//
// Пример реализации:
//  ВыполнениеЗадачБухгалтера.ЗарегистрироватьИзменениеСтатусаЗадачиПодготовкиОтчета(Ссылка, Статус);
//
Процедура ИзменитьРучнойСтатус(Ссылка, Статус) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОтчетностиПоАлкогольнойПродукции

// Возвращает в параметре "СтрокаИмениОбъекта" имя объекта, 
// соответствующего "РегистрСведений.СведенияОбАлкогольнойПродукции" в БП.
// Если такого объекта нет - пустая строка.
//
// Параметры:
//  СтрокаИмениОбъекта - Строка - имя объекта, соответствующего "РегистрСведений.СведенияОбАлкогольнойПродукции" в БП. 
//
// Пример реализации:
//  СтрокаИмениОбъекта = "РегистрСведений.СведенияОбАлкогольнойПродукции";
//
Процедура СтрокаРегистрСведенийСведенияОбАлкогольнойПродукции(СтрокаИмениОбъекта) Экспорт
	
КонецПроцедуры

// Возвращает в параметре "СтрокаИмениОбъекта" имя объекта,
// соответствующего "Перечисление.ВидыЛицензийНаПродажуАлкоголя.Пиво" в БП.
// Если такого объекта нет - пустая строка.
//
// Параметры:
//	СтрокаИмениОбъекта - Строка - имя объекта, соответствующего "Перечисление.ВидыЛицензийНаПродажуАлкоголя.Пиво" в БП.
//
// Пример реализации:
//  СтрокаИмениОбъекта = "Перечисление.ВидыЛицензийНаПродажуАлкоголя.Пиво";
//
Процедура СтрокаПеречислениеВидыЛицензийНаПродажуАлкоголяПиво(СтрокаИмениОбъекта) Экспорт
	
КонецПроцедуры

// Возвращает в параметре "СтрокаИмениОбъекта" имя объекта,
// соответствующего "РегистрСведений.ЛицензииПоставщиковАлкогольнойПродукции" в БП.
// Если такого объекта нет - пустая строка.
//
// Параметры:
//	СтрокаИмениОбъекта - Строка - имя объекта, соответствующего "РегистрСведений.ЛицензииПоставщиковАлкогольнойПродукции" в БП.
//
// Пример реализации:
//  СтрокаИмениОбъекта = "РегистрСведений.ЛицензииПоставщиковАлкогольнойПродукции";
//
Процедура СтрокаРегистрСведенийЛицензииПоставщиковАлкогольнойПродукции(СтрокаИмениОбъекта) Экспорт
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// Служебные процедуры и функции.

// Функция возвращает идентификатор конфигурации.
// Длина идентификатора не должна превышать 8 символов.
//
// Возвращаемое значение:
//   Строка - идентификатор конфигурации.
//
// Пример:
//   Возврат "БПКОРП";
//
Функция ИДКонфигурации() Экспорт
	
	Возврат "DocMng21";
	
КонецФункции

// Функция возвращает краткое название конфигурации.
// Длина возвращаемого значения не должна превышать 30 символов.
//
// Возвращаемое значение:
//   Строка - краткое название конфигурации.
//
// Пример:
//   Возврат "1С:Бухгалтерия";
//
Функция КраткоеНазваниеПрограммы() Экспорт
	
	Возврат НСтр("ru='1С:Документооборот 8'");
	
КонецФункции

// Функция возвращает список используемых в конфигурации регламентированных отчетов.
//
// Возвращаемое значение:
//   СписокЗначений - список регламентированных отчетов.
//
// Пример:
//   СписокРегламентированныхОтчетов = Новый СписокЗначений;
//   СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчетНДС");
//	 Возврат СписокРегламентированныхОтчетов;
//
Функция ПолучитьСписокРегламентированныхОтчетов() Экспорт
	
	Возврат Новый СписокЗначений;
	
КонецФункции

// Функция возвращает признак - является ли организация физ. или юр. лицом.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - ссылка на элемент справочника "Организации".
//
// Возвращаемое значение:
//   Истина - организация является юр. лицом;
//   Ложь   - организация является физ. лицом.
//
// Пример:
//   Если Организация.ИностраннаяОрганизация Тогда
//		 Возврат Истина;
//	 Иначе
//		 Возврат (Организация.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо);
//	 КонецЕсли;
//
Функция ЭтоЮридическоеЛицо(Организация) Экспорт
	
	ЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮрФизЛицо", Истина);
	
	Возврат (ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо
			Или ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент);
	
КонецФункции

// Возвращает признак уплаты налогоплательщиком единого налога на вмененный доход (ЕНВД).
//
// Параметры:
//   Организация   - СправочникСсылка.Организации - ссылка на элемент справочника "Организации".
//   Период        - Дата - дата, на которую нужно получить признак.
//   НачалоПериода - Дата - дата начала периода, за который нужно получить признак.
//
// Возвращаемое значение:
//   Истина - налогоплательщик уплачивает ЕНВД.
//   Ложь   - налогоплательщик не уплачивает ЕНВД.
//
// Пример:
// Если НачалоПериода = Неопределено Тогда
//     Возврат УчетнаяПолитика.ПлательщикЕНВД(Организация, Период);
// Иначе
//     Возврат УчетнаяПолитика.ПлательщикЕНВДЗаПериод(Организация, НачалоПериода, Период);
// КонецЕсли;
//
Функция ПлательщикЕНВД(Организация, Период, НачалоПериода = Неопределено) Экспорт
	
КонецФункции

// Функция возвращает систему налогообложения организации.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - ссылка на элемент справочника "Организации".
//   Период      - Дата - дата, на которую нужно получить систему налогообложения.
//
// Возвращаемое значение:
//   Общая      - общая система налогообложения.
//   Упрощенная - упрощенная система налогообложения.
//
// Пример:
//   УчетнаяПолитикаОрганизации = УчетнаяПолитика.СистемаНалогообложения(Организация, Период);
//	 Если УчетнаяПолитикаОрганизации = Перечисления.СистемыНалогообложения.Общая Тогда
//		 Возврат "Общая";
//	 Иначе
//		 Возврат "Упрощенная";
//	 КонецЕсли;
//
Функция СистемаНалогообложения(Организация, Период) Экспорт
	
КонецФункции

// Функция возвращает признак применения ПБУ 18/02.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - ссылка на элемент справочника "Организации".
//   Период      - Дата - дата, на которую нужно получить признак.
//
// Возвращаемое значение:
//   Истина - ПБУ 18/02 применяется.
//   Ложь   - ПБУ 18/02 не применяется.
//
// Пример:
//   Возврат УчетнаяПолитика.ПоддержкаПБУ18(Организация, Период);
//
Функция ПрименяетсяПБУ18(Организация, Период) Экспорт
	
КонецФункции

// Функция возвращает признак - является ли организация иностранной.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - ссылка на элемент справочника "Организации".
//
// Возвращаемое значение:
//   Истина - организация является иностранной;
//   Ложь   - организация не является иностранной.
//
// Пример:
//   Если Организация.Метаданные().Реквизиты.Найти("ИностраннаяОрганизация") <> Неопределено Тогда
//		 Возврат Организация.ИностраннаяОрганизация;
//	 Иначе
//		 Возврат Ложь;
//	 КонецЕсли;
//
Функция ЭтоИностраннаяОрганизация(Организация) Экспорт
	
	ЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮрФизЛицо", Истина);
	
	Возврат ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент;
	
КонецФункции

// Функция возвращает сведения о сотрудниках (застрахованных лицах) организации по состоянию на указанную дату.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - ссылка на элемент справочника Организации, по которому требуется получить сведения.
//   ДатаЗапроса - Дата - дата, по состоянию на которую требуется получить сведения.
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица значений с колонками "Фамилия", "Имя", "Отчество" и "СтраховойНомерПФР",
//                     в которых содержится информация о фамилии, имени, отчестве и страховом номере (СНИЛС)
//                     каждого из сотрудников (застрахованных лиц) организации соответственно.
//
// Пример:
//   СтруктураПараметров = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизаций();
//   СтруктураПараметров.Организация = Организация;
//   СтруктураПараметров.ОкончаниеПериода = ДатаЗапроса;
//
//   Сотрудники = КадровыйУчет.СотрудникиОрганизации(Истина, СтруктураПараметров);
//
//   Возврат КадровыйУчет.КадровыеДанныеСотрудников(Истина, Сотрудники.ВыгрузитьКолонку("Сотрудник"), "Фамилия,Имя,Отчество,СтраховойНомерПФР", ДатаЗапроса);
//
Функция ПолучитьСписокЗастрахованныхЛицОрганизации(Организация, ДатаЗапроса) Экспорт
	
КонецФункции

// Процедура добавляет в форму назначаемую команду.
//
// Параметры:
//   Форма - Форма - форма, в которую добавляется команда.
//   ГруппаФормы - Форма.Элементы - группа формы, в которой будет располагаться команда.
//
Процедура ДобавитьНазначаемуюКоманду(Форма, ГруппаФормы) Экспорт
	
КонецПроцедуры

// Функция возвращает заголовок формы "УправлениеОтчетностью" обработки "ОбщиеОбъектыРеглОтчетности".
// Если функция возвращает пустую строку, то используется заголовок формы, указанный по умолчанию.
//
// Возвращаемое значение:
//   Строка - заголовок формы управление отчетностью.
//
// Пример:
//   Возврат "";
//
Функция ЗаголовокФормыУправлениеОтчетностью() Экспорт
	
КонецФункции

// Процедура возвращает признак - является ли индивидуальный предприниматель работодателем для наемных сотрудников.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - ссылка на элемент справочника "Организации".
//  ИПИспользуетТрудНаемныхРаботников - Булево - признак - является ли индивидуальный предприниматель
//                                               работодателем для наемных сотрудников.
//                                               Истина - ИП является работодателем;
//                                               Ложь   - ИП не является работодателем.
//  ДатаНачалаПериодаОтчета - Дата - дата начала периода отчета.
//  ДатаКонцаПериодаОтчета - Дата - дата конца периода отчета.
//
// Пример:
//	ИПИспользуетТрудНаемныхРаботников = НЕ ЭтоЮридическоеЛицо(Организация)
//		И (ЗначениеЗаполнено(Организация.РегистрационныйНомерПФР)
//		ИЛИ ЗначениеЗаполнено(Организация.КодОрганаПФР)
//		ИЛИ ЗначениеЗаполнено(Организация.НаименованиеТерриториальногоОрганаПФР)
//		ИЛИ ЗначениеЗаполнено(Организация.РегистрационныйНомерТФОМС)
//		ИЛИ ЗначениеЗаполнено(Организация.РегистрационныйНомерФСС)
//		ИЛИ ЗначениеЗаполнено(Организация.КодПодчиненностиФСС)
//		ИЛИ ЗначениеЗаполнено(Организация.НаименованиеТерриториальногоОрганаФСС));
//
Процедура ПолучитьПризнакИспользованияИПТрудаНаемныхРаботников(Организация,
															   ИПИспользуетТрудНаемныхРаботников,
															   ДатаНачалаПериодаОтчета = Неопределено,
										  					   ДатаКонцаПериодаОтчета  = Неопределено) Экспорт
	
КонецПроцедуры

// Функция возвращает имя справочника обособленных подразделений,
// используемого для автоматического заполнения статистической отчетности.
//
// Параметры:
//   ИмяОтчета - Строка - имя регламентированного отчета (например, "РегламентированныйОтчетСтатистикаФорма1ТГМС").
//
// Возвращаемое значение:
//   Строка - имя справочника обособленных подразделений.
//
// Пример реализации:
//   Возврат "ПодразделенияОрганизаций";
//
Функция ИмяСправочникаОбособленныхПодразделений(ИмяОтчета = "") Экспорт
	
КонецФункции

// Функция возвращает имя реквизита справочника подразделений, который
// определяет, является ли подразделение обособленным (в трактовке Росстата).
// Используется для автоматического заполнения статистической отчетности.
//
// Параметры:
//   ИмяОтчета - Строка - имя регламентированного отчета (например, "РегламентированныйОтчетСтатистикаФорма1ТГМС").
//
// Возвращаемое значение:
//   Булево - если значение реквизита равно Истина - подразделение является обособленным,
//            иначе значение реквизита равно Ложь - подразделение не является обособленным.
//
// Пример реализации:
//   Возврат "ИмеетНомерТерриториальногоОрганаРосстата";
//
Функция ИмяРеквизитаПризнакаОбособленногоПодразделения(ИмяОтчета = "") Экспорт
	
КонецФункции

// Функция возвращает значение Раздела 3 Строки 130 Книги учета доходов и расходов.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - организация, по которой построен регл. отчет.
//   ДатаОкончанияПериода - Дата - дата окончания периода отчета (СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета).
//
// Возвращаемое значение:
//   Число - значение по строке 130 раздела 3 книги учета доходов и расходов.
//
Функция СуммаФактическогоУменьшенияНалоговойБазы(Организация, ДатаОкончанияПериода) Экспорт
	
КонецФункции

// Функция возвращает код вида документа физического лица.
//
// Параметры:
//   ВидДокументаФизическогоЛица - СправочникСсылка.ВидыДокументовФизическихЛиц - ссылка на элемент справочника "ВидыДокументовФизическихЛиц".
//
// Возвращаемое значение:
//   Строка (длина - 2) - код вида документа физического лица.
//
// Пример:
//	 Возврат ВидДокументаФизическогоЛица.КодМВД;
//
Функция ПолучитьКодВидаДокументаФизическогоЛица(ВидДокументаФизическогоЛица) Экспорт
	
КонецФункции

// Процедура возвращает ссылку на предопределенный элемент из справочника "ВидыКонтактнойИнформации".
//
// Параметры:
//   ВидКИ      - СправочникСсылка.ВидыКонтактнойИнформации - ссылка на предопределенный элемент справочника "ВидыКонтактнойИнформации".
//   НаимВидаКИ - Строка - наименование предопределенного элемента справочника "ВидыКонтактнойИнформации".
//
// Пример:
//   ВидКИ = Справочники.ВидыКонтактнойИнформации[НаимВидаКИ];
//
Процедура ПолучитьВидКонтактнойИнформации(ВидКИ, НаимВидаКИ) Экспорт
	
КонецПроцедуры

// Процедура возвращает признак ведения персонифицированного учета во внешней программе.
//
// Параметры:
//  ПризнакПерсУчета - булево - признак ведения персонифицированного учета во внешней программе.
//                     Истина - персонифицированный учет ведется во внешней программе;
//                     Ложь   - персонифицированный учет ведется в конфигурации.
//
Процедура ПолучитьПризнакВеденияПерсонифицированногоУчетаВоВнешнейПрограмме(ПризнакПерсУчета) Экспорт
	
КонецПроцедуры

// Процедура возвращает признак учета расходов по элементам затрат.
//
// Параметры:
//  НачалоПериода        - Дата - начало периода отчета (СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета).
//  КонецПериода         - Дата - окончание периода отчета (СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета).
//  Организация          - СправочникСсылка - ссылка на элемент справочника "Организации".
//  ПризнакУчетаРасходов - Булево или Неопределено - признак учета расходов по элементам затрат.
//                           Истина       - расходы учитываются по элементам затрат;
//                           Ложь         - расходы не учитываются по элементам затрат;
//                           Неопределено - в конфигурации не реализован функционал учета расходов по элементам затрат.
// Пример:
//  ПризнакУчетаРасходов = ЭлементыЗатратНастройкаПараметровУчета.РасходыУчитываютсяПоЭлементамЗатрат(
//  	НачалоПериода, КонецПериода, Организация);
//
Процедура ПолучитьПризнакУчетаРасходовПоЭлементамЗатрат(НачалоПериода, КонецПериода, Организация, ПризнакУчетаРасходов) Экспорт
	
КонецПроцедуры

// Процедура возвращает признак плательщика торгового сбора.
//
// Параметры:
//  НачалоПериода        - Дата - начало года, предшествовавшему периоду отчета
//                               (НачалоГода(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, - 12))).
//  КонецПериода         - Дата - окончание периода отчета (СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета).
//  Организация          - СправочникСсылка - ссылка на элемент справочника "Организации".
//  ПризнакПлательщикаТС - Булево - признак плательщика торгового сбора.
//                           Истина - организация является плательщиком торгового сбора;
//                           Ложь   - организация не является плательщиком торгового сбора.
// Пример:
//  ПризнакПлательщикаТС = УчетнаяПолитика.ПлательщикТорговогоСбораЗаПериод(Организация, НачалоПериода, КонецПериода);
//
Процедура ПолучитьПризнакПлательщикаТорговогоСбораЗаПериод(Организация, НачалоПериода, КонецПериода, ПризнакПлательщикаТС) Экспорт
	
КонецПроцедуры

// Процедура возвращает объект налогообложения УСН.
//
// Параметры:
//  НачалоПериода - Дата - начало периода отчета (СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета).
//  КонецПериода  - Дата - окончание периода отчета (СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета).
//  Организация   - СправочникСсылка - ссылка на элемент справочника "Организации".
//  ОбъектНалУСН  - Число или Неопределено - объект налогообложения УСН.
//                    1 - объект налогообложения - доходы;
//                    2 - объект налогообложения - доходы, уменьшенные на величину расходов;
//                    Неопределено - не применялась УСН за период или в конфигурации не реализован
//                                   функционал получения объекта налогообложения УСН за период.
//
Процедура ПолучитьОбъектНалогообложенияУСНЗаПериод(Организация, НачалоПериода, КонецПериода, ОбъектНалУСН) Экспорт
	
КонецПроцедуры

// Процедура возвращает УИД конфигурации для целей регламентированной отчетности.
//
// Параметры:
// 	УИДКонфигурации - Строка - Уникальный идентификатор конфигурации 
//							   для целей регламентированной отчетности.
//
// Пример:
//  УИДКонфигурации = "e54b72a0-171f-11df-85fa-001b24e002fe";
//
Процедура ПолучитьУИДКонфигурации(УИДКонфигурации) Экспорт
	
КонецПроцедуры

// Возвращает результат проверки актуализации данных учета.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - ссылка на элемент справочника "Организации".
//  Период      - Дата - отчетный период.
//  РезультатПроверки - Структура - возвращаемая структура параметров актуализации.
//
// Пример реализации:
//  АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено);
//  ПараметрыПроверки = Новый Структура;
//  ПараметрыПроверки.Вставить("Организация", Организация);
//  ПараметрыПроверки.Вставить("Период",      Период);
//  ПараметрыПроверки.Вставить("УИДЗамера",   Новый УникальныйИдентификатор);
//  ПараметрыПроверки.Вставить("АктуализироватьВесьПериод", Истина);
//  Обработки.ЗакрытиеМесяца.ПроверитьАктуальностьВФоне(ПараметрыПроверки, АдресХранилища);
//  РезультатПроверки = ПолучитьИзВременногоХранилища(АдресХранилища);
//
Процедура ПолучитьРезультатПроверкиАктуализацииДанныхУчета(Организация, Период, РезультатПроверки) Экспорт
	
КонецПроцедуры

// Возвращает массив ссылок на элементы справочника "РегистрацииВНалоговомОргане".
//
// Параметры:
//   Организация            - СправочникСсылка.Организации - ссылка на элемент справочника "Организации".
//   ДатаКонцаПериодаОтчета - Дата - дата конца периода отчета.
//   НалоговыеОрганы        - Массив - ссылки на элементы справочника "РегистрацииВНалоговомОргане".
//   НаименованиеРеглОтчета - Строка - наименование регламентированного отчета.
//
// Пример реализации:
//   Если НаименованиеРеглОтчета = "РегламентированныйОтчетПрибыль" Тогда
//		...
//	 ИначеЕсли НаименованиеРеглОтчета = "РегламентированныйОтчет6НДФЛ" Тогда	
//	 	...
//	 КонецЕсли;	
//
Процедура ПолучитьНалоговыеОрганы(Организация, ДатаКонцаПериодаОтчета, НалоговыеОрганы, НаименованиеРеглОтчета = "") Экспорт
	
КонецПроцедуры

// Устанавливает флаг того, что конфигурация дает возможность интерактивно задать подписантов непосредственно
// из формы отчетности.
//
// Параметры:
//   ПризнакИспользования - Булево - флаг, который необходимо установить, если конфигурация будет давать
//									 возможность настроить подписанта прямо из формы отчетности.
//
// Пример реализации:
//   ПризнакИспользования = Истина;
//
Процедура ИспользоватьКонтекстнуюНастройкуПодписантовСтатистики(ПризнакИспользования) Экспорт
	
КонецПроцедуры

#Область НоваяФормаРегламентированнойОтчетности

// Процедура переопределяет обработчик подписки на событие "ЗаписьОбъектовРегламентированнойОтчетности*"
//
// Параметры:
//	Ссылка - СправочникСсылка, ДокументСсылка - Ссылка на объект - источник события
//	Отказ  - Булево - Управляет значением параметра "Отказ" вызывающего обработчика подписки на событие
//	СтандартнаяОбработка - Булево - Если СтандартнаяОбработка = Истина, то будут выполнены действия вызывающего обработчика подписки на событие
//
// Пример реализации:
//
//  	// БПКОРП с ФО "Расширенный функционал".
//  	Если НЕ ПолучитьФункциональнуюОпцию("РасширенныйФункционал") Тогда
//  		ОтчетыВходяшиеВРасширенныйФункционал = Новый СписокЗначений;
//  		ПолучитьСписокОтчетовИУведомленийВходяшихВРасширенныйФункционал(ОтчетыВходяшиеВРасширенныйФункционал);
//  		
//  		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РегламентированныйОтчет") Тогда
//  			Если ОтчетыВходяшиеВРасширенныйФункционал.НайтиПоЗначению(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ИсточникОтчета")) <> Неопределено Тогда
//  				Сообщение = Новый СообщениеПользователю;
//  				Сообщение.Текст = НСтр("ru='Сохранение отчета в текущем используемом тарифе программы недоступно.'");
//  				Сообщение.Сообщить();
//  				
//  				Отказ = Истина;
//  				СтандартнаяОбработка = Ложь;
//  			КонецЕсли;
//  		ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.УведомлениеОСпецрежимахНалогообложения") Тогда
//  			Если ОтчетыВходяшиеВРасширенныйФункционал.НайтиПоЗначению(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ВидУведомления")) <> Неопределено Тогда
//  				Сообщение = Новый СообщениеПользователю;
//  				Сообщение.Текст = НСтр("ru='Сохранение уведомления в текущем используемом тарифе программы недоступно.'");
//  				Сообщение.Сообщить();
//  				
//  				Отказ = Истина;
//  				СтандартнаяОбработка = Ложь;
//  			КонецЕсли;
//  		КонецЕсли;
//  	КонецЕсли;
//
Процедура ЗаписьОбъектовРегламентированнойОтчетности(Ссылка, Отказ, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Процедура переопределяет свойства объекта, с которыми он будет отображен в форме Отчетность
// Параметры:
//  СвойстваОбъектов  - ТаблицаЗначений - Таблица, содержащая в себе описания ссылок, переданных в закладке Ссылка таблицы
//		Каждая колонка таблицы соотвествует свойству объекта.
//		Таблица содержит следующие колонки:
//			- ДатаСоздания - Дата - Дата создания объекта
//			- Наименование - Строка - Наименование объекта, с которым он будет отображаться в форме Отчетность
//			- КодКонтролирующегоОргана - Строка - Код контролирующего органа, в который отправляется отчетности по ТКС
//			- ДатаНачала - Дата - Дата начала периода. Пустая, если дата начала периода отсуствует
//			- ДатаОкончания - Дата - Дата окончания периода. Пустая, если дата окончания периода отсуствует 
//			- ВариантОтчета - Строка, Число - Если первичный, то указываем "П", если нет признака первичный/корректирующий - "-",
//				иначе - "К/" + <номер корректировки>; вариант отчета в числовом коде: 0 - первичный, число больше нуля - корректирующий
//			- ПометкаУдаления - Булево - Истина, если объект помечен на удаление 
//			- Организация - СправочникСсылка.Организации - Организация, которой принадлежит объект
//			- Комментарий - Строка - Комментарий из объекта
//
Процедура ОпределитьСвойстваОбъектовДляОтображенииВФормеОтчетность(СвойстваОбъектов) Экспорт
	
КонецПроцедуры

// Определяет свойства, касающиеся общих свойств объектов конфигураций-потребителей для отображения в форме Отчетность
// и возможности содания новый объектов из формы Отчетность
//
// Параметры:
//  ТаблицаОписания  - ТаблицаЗначений - Таблица, содержащая в себе описания объектов конфигураций-потребителей
//		Каждая колонка таблицы соотвествует свойству объекта.
//		Таблица содержит следующие колонки:
//			- Наименование - Строка - Наименование вида отчета, как оно должно отображаться в форме создания отчета
//			- ТипОбъекта - Тип - Тип описываемого объекта
//			- ВидКонтролирующегоОргана - Перечисления.ТипыКонтролирующихОрганов - контролирующий орган, в который сдается отчетности
//			- ГруппаВДереве - Строка - Определяет имя группы, в которой будет отображаться объект в случае иерархическкого отображения списка объектов
//			- ВидДокумента - Перечисления.СтраницыЖурналаОтчетность - Определяет страницу формы Отчетность, на которой будет отображаться объект
//				Может принимать одно из следующих значений:
//						Перечисления.СтраницыЖурналаОтчетность.Уведомления
//						Перечисления.СтраницыЖурналаОтчетность.Отчеты
//			- НеОтправляетсяВКонтролирующийОрган - Булево - Истина, если объект не отправляется в контролирующий орган по ТКС
//			- ЯвляетсяАктуальным - Булево - Определяет, можно ли создавать новые объекты данного вида
//			- ИмяОсновногоМакетаДляПечати - Строка - имя макета, который будет использоваться для печати по умолчанию
//			- ВидЭлектронногоПредставления - СправочникСсылка.ВидыОтправляемыхДокументов - вид электронного представления (справочник 
// ЭлектронныеПредставленияРегламентированныхОтчетов), соответствующий данному типу объекта. Неопределено, если такого вида отправляемого документа не существует
//
Процедура ОпределитьТаблицуОписанияОбъектовРегламентированнойОтчетности(ТаблицаОписания) Экспорт
	
КонецПроцедуры

// Дополняет дерево регламентированных отчетов для использования в форме выбора видов отчетов,
// которая вызывается из формы "Отчетность" при нажатии на кнопку "Создать" на вкладке "Отчеты"
//
// Параметры:
//  ДеревоОтчетов - ДеревоЗначений - Дерево содержит описания видов отчетов, дополняемые из конфигураций-потребителей
//		Деревоз значений содержит следующие колонки:
//			- Наименование - Строка - Наименование вида отчета, как оно должно отображаться в форме
//			- ПолноеИмя - Строка - Полное имя (как в метаданных) документа или справочник для хранения данных отчета,
//				например: "Документ.РегламентированныйОтчет" или "Документ.УниверсальныйРегламентированныйОтчет" (для БГУ)
//			- Ссылка - СправочникСсылка - Ссылка на элемент справочника, содержащий описание вида отчета (если существует),
//				например, ссылка на элемент справочника "ВидыОтчетов" в БГУ
//			- ТипПолучателя - Перечисления.ТипыКонтролирующихОрганов - контролирующий орган, в который сдается отчетность
//			- Категория - Строка - Наименование категории отчета или название группы, в которую входит отчет (для группировки в форме)
//			- ЭтоГруппа - Булево - Если элемент дерева должен отображаться в форме как группа
//
Процедура ДобавитьВДеревоРегламентированныхОтчетовДругиеОтчеты(ДеревоОтчетов) Экспорт
	
КонецПроцедуры

// Процедура переопределяет параметры отчета
//
// Параметры:
//  Отчет                      - Структура("Наименование,ПолноеИмя,Ссылка").
//  ОрганизацияОтчета          - Ссылка или Неопределено, организация отчета.
//  ДатаНачалаПериодаОтчета    - Дата или Неопределено, дата начала периода отчета.
//  ДатаОкончанияПериодаОтчета - Дата или Неопределено, дата окончания периода отчета.
//  ПараметрыОткрытия          - Структура, переопределяемые параметры открытия формы отчета.
//
Процедура ПереопределитьПараметрыОтчета(Отчет, ОрганизацияОтчета, ДатаНачалаПериодаОтчета, ДатаОкончанияПериодаОтчета, ПараметрыОткрытия) Экспорт
	
КонецПроцедуры

// Дополняет функционал обработчика "ПриСозданииНаСервере" общей формы "Регламентированная отчетность",
// здесь можно добавлять новые конопки в командные панели, расширять возможности интерфейса.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения, общая форма "Регламентированная отчетность".
//
// Пример:
//  ГруппаКоманды = Форма.Элементы["ОтчетыГруппа3"];
//  
//  ИмяКоманды = "ОтчетыПоказатьДополнительнуюИнформацию";
//  Команда = Форма.Команды.Добавить(ИмяКоманды);
//  Команда.Подсказка = НСтр("ru = 'Показать дополнительную информацию'");
//  Команда.Отображение = ОтображениеКнопки.КартинкаИТекст;
//  Команда.Картинка = БиблиотекаКартинок.Лупа;
//  Команда.Действие = "Подключаемый_ВыполнитьНазначаемуюКоманду";
//  
//  Кнопка = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаКоманды);
//  Кнопка.Заголовок = НСтр("ru = 'Инфо'");
//  Команда.ИзменяетСохраняемыеДанные = Ложь;
//  Кнопка.ИмяКоманды = ИмяКоманды;
//
Процедура ФормаРегламентированнойОтчетности_ПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область РасширенныйФункционал

// Дополняет функционал обработчика "ПриСозданииНаСервере" формы списка справочника "Регламентированные отчеты",
// здесь можно инициализировать переменные, расширять возможности интерфейса.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма списка справочника "Регламентированные отчеты".
//
// Пример реализации:
//
//  ОтчетыВходяшиеВРасширенныйФункционал = Новый СписокЗначений;
//  ПолучитьСписокОтчетовИУведомленийВходяшихВРасширенныйФункционал(ОтчетыВходяшиеВРасширенныйФункционал);
//  
//  Для Каждого ЭлементСписка Из ОтчетыВходяшиеВРасширенныйФункционал Цикл
//  	Если ТипЗнч(ЭлементСписка.Значение) = Тип("Строка") Тогда
//  		
//  		Форма.Ограничения.Добавить(ЭлементСписка.Представление);
//  		
//  	КонецЕсли;
//  КонецЦикла;
//
Процедура СправочникРегламентированныеОтчеты_ПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

// Процедура удаляет из исходного дерева отчеты, которые отключатся функциональной опцией "Расширенный функционал".
//
// Параметры:
//  ДеревоОтчетов - Дерево значений - Содержит исходное дерево используемых в конфигурации регламентированных отчетов.
//
// Пример реализации:
//  РасширенныйФункционалФО = ПолучитьФункциональнуюОпцию("РасширенныйФункционал");
//
//  Если НЕ РасширенныйФункционалФО Тогда // удаляем отчеты входящие в расширенный функционал
//  	
//  	ОтчетыВходяшиеВРасширенныйФункционал = Новый СписокЗначений;
//  	ПолучитьСписокОтчетовИУведомленийВходяшихВРасширенныйФункционал(ОтчетыВходяшиеВРасширенныйФункционал);
//  	
//  	Для Каждого ЭлементСписка Из ОтчетыВходяшиеВРасширенныйФункционал Цикл
//  		Если СтрНачинаетсяС(ЭлементСписка.Значение, "РегламентированныйОтчет") Тогда
//  			
//  			НаименованиеОтчета = ЭлементСписка.Представление;
//  			
//  			УдаляемыеОтчеты = ДеревоОтчетов.Строки.НайтиСтроки(
//  				Новый Структура("Наименование,ЭтоГруппа", НаименованиеОтчета, Ложь), Истина);
//  				
//  			Для Каждого ЭлементОтчет Из УдаляемыеОтчеты Цикл
//  				РодительЭлемента = ЭлементОтчет.Родитель;
//  				Если РодительЭлемента = Неопределено Тогда
//  					РодительЭлемента = ЭлементОтчет.Владелец();
//  				КонецЕсли;
//  				
//  				КоличествоЭлементовВДеревеОтчетов = КоличествоЭлементовВДеревеОтчетов - 1;
//  				
//  				РодительЭлемента.Строки.Удалить(ЭлементОтчет);
//  			КонецЦикла;
//  			
//  		КонецЕсли;
//  	КонецЦикла;
//  	
//  	ВсеГруппыОтчетов = ДеревоОтчетов.Строки.НайтиСтроки(Новый Структура("ЭтоГруппа", Истина), Истина);
//  	
//  	КоличествоГрупп = ВсеГруппыОтчетов.Количество();
//  	Для НомГруппы = 1 По КоличествоГрупп Цикл // просматриваем группы в обратном порядке
//  		
//  		ГруппаОтчетов = ВсеГруппыОтчетов[КоличествоГрупп - НомГруппы];
//  		Если ГруппаОтчетов.Строки.Количество() = 0 Тогда
//  			РодительГруппы = ГруппаОтчетов.Родитель;
//  			Если РодительГруппы = Неопределено Тогда
//  				РодительГруппы = ГруппаОтчетов.Владелец();
//  			КонецЕсли;
//  			
//  			РодительГруппы.Строки.Удалить(ГруппаОтчетов);
//  		КонецЕсли;
//  		
//  	КонецЦикла;
//  	
//  КонецЕсли;
//
Процедура УдалитьОтчетыВходяшиеВРасширенныйФункционал(ДеревоОтчетов, КоличествоЭлементовВДеревеОтчетов) Экспорт
	
КонецПроцедуры

// Процедура возвращает в параметре список регламентированных отчетов и регламентированных уведомлений, входящих в расширенный функционал,
// который определяется функциональной опцией "Расширенный функционал".
//
// Параметры:
//  СписокОтчетовИУведомлений - СписокЗначений - Список регламентированных отчетов и регламентированных уведомлений:
//   Значение      - источник регламентированного отчета или вид уведомления,
//   Представление - синоним основной формы регламентированного отчета или синоним объекта метаданных регламентированного уведомления.
//
// Пример реализации:
//  Если ТипЗнч(СписокОтчетовИУведомлений) <> Тип("СписокЗначений") Тогда
//  	СписокОтчетовИУведомлений = Новый СписокЗначений;
//  КонецЕсли;
//  
//  Если ПолучитьФункциональнуюОпцию("РасширенныйФункционал") Тогда
//  	Возврат; // возвращаем пустой список при включенной ФО
//  КонецЕсли;
//  	
//  СписокОтчетовИУведомлений.Добавить("РегламентированныйОтчетОперацииСДенежнымиСредствамиНФО",
//  	"Информация об операциях с денежными средствами НФО");
//  
//  СписокОтчетовИУведомлений.Добавить(Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ФормаКИК,
//  	"Уведомление о контролируемых иностранных компаниях");
//
Процедура ПолучитьСписокОтчетовИУведомленийВходяшихВРасширенныйФункционал(СписокОтчетовИУведомлений) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ФильтрацияОрганизацийВСтартовойФормеРегламентированногоОтчета

// Процедура возвращает текст запроса для получения организаций - юридических лиц.
//
// Параметры:
//  ТекстЗапроса - Строка - текст запроса для получения организаций, являющихся юридическими лицами.
//
// Пример:
//	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
//				   |	Организации.Ссылка,
//				   |	Организации.Наименование
//				   |ИЗ
//				   |	Справочник.Организации КАК Организации
//				   |ГДЕ
//				   |	Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
//				   |	И НЕ Организации.ПометкаУдаления
//				   |
//				   |УПОРЯДОЧИТЬ ПО
//				   |	Наименование";
//
Процедура СформироватьТекстЗапросаДляПолученияДоступныхЮридическихЛиц(ТекстЗапроса) Экспорт
	
КонецПроцедуры

// Процедура возвращает текст запроса для получения организаций - индивидуальных предпринимателей.
//
// Параметры:
//  ТекстЗапроса - Строка - текст запроса для получения организаций, являющихся индивидуальными предпринимателями.
//
// Пример:
//	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
//				   |	Организации.Ссылка,
//				   |	Организации.Наименование
//				   |ИЗ
//				   |	Справочник.Организации КАК Организации
//				   |ГДЕ
//				   |	Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
//				   |	И НЕ Организации.ПометкаУдаления
//				   |
//				   |УПОРЯДОЧИТЬ ПО
//				   |	Наименование";
//
Процедура СформироватьТекстЗапросаДляПолученияДоступныхИндивидуальныхПредпринимателей(ТекстЗапроса) Экспорт
	
КонецПроцедуры

// Процедура возвращает текст запроса для получения организаций -
// юридических лиц и индивидуальных предпринимателей.
//
// Параметры:
//  ТекстЗапроса - Строка - текст запроса для получения организаций -
//                          юридических лиц и индивидуальных предпринимателей.
//
// Пример:
//	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
//				   |	Организации.Ссылка,
//				   |	Организации.Наименование
//				   |ИЗ
//				   |	Справочник.Организации КАК Организации
//				   |ГДЕ
//				   |	НЕ Организации.ПометкаУдаления
//				   |
//				   |УПОРЯДОЧИТЬ ПО
//				   |	Наименование";
//
Процедура СформироватьТекстЗапросаДляПолученияДоступныхОрганизаций(ТекстЗапроса) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеПредставленияУведомления

// Процедура используется для переопределения представления документа УведомлениеОСпецрежимахНалогообложения.
// В случае, если такое переопределение произошло, необходимо установить флаг СтандартнаяОбработка в Ложь.
// Параметры аналогичны событию ОбработкаПолученияПолейПредставления в модуле менеджера документа УведомлениеОСпецрежимахНалогообложения.
//
// Параметры:
//   Поля - Массив - содержит имена полей, которые нужны для формирования представления объекта или ссылки.
//   СтандартнаяОбработка - Булево - в данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаПолученияПолейПредставления_УведомлениеОСпецрежимахНалогообложения(Поля, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Процедура используется для переопределения представления документа УведомлениеОСпецрежимахНалогообложения.
// В случае, если такое переопределение произошло, необходимо установить флаг СтандартнаяОбработка в Ложь.
// Параметры аналогичны событию ОбработкаПолученияПредставления в модуле менеджера документа УведомлениеОСпецрежимахНалогообложения.
//
// Параметры:
//   Данные - Структура - содержит значения полей, из которых формируется представление.
//   Представление - Строка - строка, в которую нужно поместить представление объекта или ссылки.
//   СтандартнаяОбработка - Булево - в данный параметр передается признак формирования стандартного представления объекта или ссылки.
//
Процедура ОбработкаПолученияПредставления_УведомлениеОСпецрежимахНалогообложения(Данные, Представление, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ЗапросВФНСНаПроверкуСведенийРаботников

// Процедура формирует сведения, необходимые для представления в налоговую инспекцию
// запроса работодателя на проверку ИНН, ФИО, СНИЛС работающих лиц в электронной форме.
//
// Параметры:
//  СтруктураПараметров - Структура - свойства:
//     * Организация - СправочникСсылка.Организации - организация, по работникам
//                     которой будут формироваться сведения для файла;
//     * ДатаПодписи - Дата - дата, на которую будут формироваться сведения для файла.
//     * ИНН - Строка - возвращается ИНН организации;
//     * КПП - Строка - возвращается КПП организации (пустая строка в случае ИП);
//     * КодНалоговогоОргана - Строка - возвращается четырехзначный код налогового органа;
//     * РазмерПачки - Число - допустимое количество физических лиц в одном файле
//                     (необязательный параметр, по умолчанию допустимое количество равно 200;
//                     в случае превышения, будет записано необходимое количество файлов);
//     * СведенияОРаботниках - ТаблицаЗначений - возвращается таблица с колонками:
//        ** Фамилия - Строка - фамилия физического лица;
//        ** Имя - Строка - имя физического лица;
//        ** Отчество - Строка - отчество физического лица;
//        ** ИНН - Строка - ИНН физического лица;
//        ** СтраховойНомерПФР - Строка - СНИЛС физического лица;
//        ** ДатаРождения - Дата - дата рождения физического лица;
//        ** ВидДокумента - Строка - двузначный код вида документа, удостоверяющего личность физического лица;
//        ** СерияДокумента - Строка - серия документа, удостоверяющего личность физического лица;
//        ** НомерДокумента - Строка - номер документа, удостоверяющего личность физического лица.
//
Процедура ПолучитьДанныеДляЗапросаВФНСНаПроверкуСведенийРаботников(СтруктураПараметров) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область Используется1СОтчетность

// Процедура возвращает признак использования отправки регламентированной отчетности.
//
// Параметры:
//  ПризнакИспользования - Булево - признак использования отправки регламентированной отчетности.
//                         Истина - отправка регл. отчетности выполняется в стандартном режиме
//                                  (при подключенном сервисе "1С-Отчетность");
//                         Ложь   - отправка регл. отчетности выполняется через DataTransfer БТС.
// Пример реализации:
//
//  ПризнакИспользования = РегламентированнаяОтчетностьБП.Используется1СОтчетность();
//
//
Процедура ПолучитьПризнакИспользования1СОтчетности(ПризнакИспользования) Экспорт
	
КонецПроцедуры

// Процедура возвращает признак отправки объекта РО без использования "1С-Отчетность", состояние (если отправлялся).
//
// Параметры:
//  ОбъектРеглОтчетности - Документ  - Документ регламентированного отчета.
//  ОбъектОтправлялся    - Булево    - признак использования отправки объекта регламентированной отчетности.
//                         Истина    - отправка РО выполнялась без использования "1С-Отчетность" (через DataTransfer БТС);
//                         Ложь      - отправка РО не выполнялась или выполнялась в стандартном режиме.
//  Состояние - Строка, Неопределено - Содержит имя значения перечисления состояния отправленного объекта РО.
// 
//  Пример реализации:
//
//  	ОбъектОтправлялся = Ложь;
//  	
//  	Запрос = Новый Запрос();
//  	Запрос.Параметры.Вставить("Документ", ОбъектРеглОтчетности);
//  	
//  	Запрос.Текст = "ВЫБРАТЬ
//  	|	ДокументыИнтеграцииСБанком.Состояние КАК Состояние
//  	|ИЗ
//  	|	РегистрСведений.ДокументыИнтеграцииСБанком КАК ДокументыИнтеграцииСБанком
//  	|ГДЕ
//  	|	ДокументыИнтеграцииСБанком.Документ = &Документ";
//  	
//  	Выборка = Запрос.Выполнить().Выбрать();
//  	Если Выборка.Следующий() Тогда
//  		
//  		ОбъектОтправлялся = Истина;
//  		
//  		Если ЗначениеЗаполнено(Выборка.Состояние) Тогда
//  			Состояние = ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.Состояние);
//  		Иначе
//  			Состояние = "";
//  		КонецЕсли;
//  		
//  	КонецЕсли;
//
Процедура ПолучитьПризнакОбъектРеглОтчетностиОтправлялсяБезИспользования1СОтчетности(ОбъектРеглОтчетности, ОбъектОтправлялся, Состояние) Экспорт
	
КонецПроцедуры

// Процедура возвращает результат выполнения фонового задания для получения данных баннера состояния интеграции с банком.
//
//  Пример реализации:
//
//  	ПараметрыПроцедуры = Новый Структура;
//  	
//  	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
//  	ПараметрыВыполнения.ОжидатьЗавершение = 0;
//  	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка состояния интеграции с банками.'");
//  	
//  	Результат = ДлительныеОперации.ВыполнитьВФоне(
//  		"РегистрыСведений.ДокументыИнтеграцииСБанком.ДанныеБаннераИнтеграцииСБанкомВФоне",
//  		ПараметрыПроцедуры,
//  		ПараметрыВыполнения);
//
Процедура ПолучитьСостояниеИнтеграцииСБанкомВФоне(УникальныйИдентификатор, Результат) Экспорт
	
КонецПроцедуры

// Показывает баннер по предварительно полученным данным баннера.
//
// Параметры:
//  Форма            - ФормаКлиентскогоПриложения - Форма "1С-Отчетность".
//                     Форма должна иметь группу ГруппаБаннерСостоянияОтправки с 2 элементами: БаннерСостоянияОтправкиТекст и ДекорацияБаннерСостоянияОтправкиКартинка.
//                     Также форма должна иметь реквизиты формы ИнтервалПроверкиСостоянияИнтеграцииСБанком (Число) и ХешДанныхБаннера (Число).
//  ДанныеБаннера    - Структура - Структура с данными баннера.
//                     См. РегистрыСведений.ДокументыИнтеграцииСБанком.ДанныеБаннераИнтеграцииСБанкомДляПомощников.
//  Пример реализации:
//
//  	ИнтеграцияСБанкамиФормы.ПоказатьБаннерСостоянияОтправки(Форма, ДанныеБаннера);
//
Процедура ПоказатьБаннерСостоянияОтправки(Форма, ДанныеБаннера) Экспорт
	
КонецПроцедуры

// Процедура возвращает данные интеграции для баннера в регламентированных отчетах.
//
// Параметры:
//  СсылкаНаОтчет - ДокументСсылка.РегламентированныйОтчет - Ссылка на регламентированный отчет.
//  ДанныеБаннера - Структура - Текст баннера, картинка и т.д.
//                  См. РегистрыСведений.ДокументыИнтеграцииСБанком.ДанныеБаннераИнтеграцииСБанкомДляПомощников.
//  Пример реализации:
//
//  	СостоянияИнтеграцииДокументов = РегистрыСведений.ДокументыИнтеграцииСБанком.СостоянияИнтеграцииДокументов(
//  		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СсылкаНаОтчет));
//  		
//  	Если СостоянияИнтеграцииДокументов <> Неопределено 
//  		И ИнтеграцияСБанкамиПовтИсп.ИнтеграцияВИнформационнойБазеВключена() Тогда
//  		
//  		ДанныеБаннера = РегистрыСведений.ДокументыИнтеграцииСБанком.ДанныеБаннераИнтеграцииСБанкомДляПомощников(
//  			СостоянияИнтеграцииДокументов);
//  	КонецЕсли;
//
Процедура ПолучитьДанныеБаннераИнтеграцииСБанком(СсылкаНаОтчет, ДанныеБаннера) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ФильтрацияИзбранного

// Заполняется таблица избранного по правилам, определяемым в самом потребителе.
//
// Параметры:
// ПараметрыОтбора - структура, содержащая значения:
//   Организация - СправочникСсылка.Организации - ссылка на элемент справочника Организации.
//   РанееСозданныеОтчеты - пустая таблица избранного с колонками:
//     * Наименование - Строка - наименование отчета.
//     * ПолноеИмя    - Строка - имя объекта отчета.
//     * Ссылка       - ДокументСсылка.РегламентированныйОтчет или иной документ, который приравнен к отчетам.
//     * ЭтоГруппа    - Булево.
//
Процедура ЗаполнитьИзбранноеДоступнымиОтчетами(ПараметрыОтбора) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет таблицу действующими льготами по кадастровым номерам замельных участков.
// Параметры:
//   ТаблицаЗемельныхУчастков - пустая таблица земельных участков с колонками:
//     * КадастровыйНомер - Строка - кадастровый номер земельного участка.
//     * ПроцентУменьшенияСуммыНалога - Число - значение льготы в виде уменьшения суммы налога.
//     * СниженнаяНалоговаяСтавка - Число - значение льготы в виде понижения налоговой ставки.
//   ОрганизацияВладелец - СправочникСсылка.Организации - ссылка на элемент справочника Организации.
//   ДатаСреза - Дата - дата, на момент которой определяются льготы.
//
// Пример:
//
//  Запрос = Новый Запрос;
//  Запрос.Текст = "ВЫБРАТЬ
//                 |	РегистрацияЗемельныхУчастковСрезПоследних.КадастровыйНомер КАК КадастровыйНомер,
//                 |	РегистрацияЗемельныхУчастковСрезПоследних.ПроцентУменьшенияСуммыНалога КАК ПроцентУменьшенияСуммыНалога,
//                 |	РегистрацияЗемельныхУчастковСрезПоследних.СниженнаяНалоговаяСтавка КАК СниженнаяНалоговаяСтавка
//                 |ИЗ
//                 |	РегистрСведений.РегистрацияЗемельныхУчастков.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК РегистрацияЗемельныхУчастковСрезПоследних";
//  Запрос.УстановитьПараметр("Организация", ОрганизацияВладелец);
//  Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
//
//  ТаблицаЗемельныхУчастков = Запрос.Выполнить().Выгрузить();
//  ТаблицаЗемельныхУчастков.Индексы.Добавить("КадастровыйНомер");
//
// Пример:
//
//  Запрос = Новый Запрос;
//  Запрос.Текст = "ВЫБРАТЬ
//                 |	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомер КАК КадастровыйНомер,
//                 |	РегистрацияЗемельныхУчастковСрезПоследних.ПроцентУменьшенияСуммыНалога КАК ПроцентУменьшенияСуммыНалога,
//                 |	РегистрацияЗемельныхУчастковСрезПоследних.СниженнаяНалоговаяСтавка КАК СниженнаяНалоговаяСтавка
//                 |ИЗ
//                 |	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(&ДатаСреза, Учреждение = &Организация) КАК СведенияКадастровогоУчетаСрезПоследних
//                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияЗемельныхУчастков.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК РегистрацияЗемельныхУчастковСрезПоследних
//                 |		ПО СведенияКадастровогоУчетаСрезПоследних.ОсновноеСредство = РегистрацияЗемельныхУчастковСрезПоследних.ОсновноеСредство
//                 |			И СведенияКадастровогоУчетаСрезПоследних.Учреждение = РегистрацияЗемельныхУчастковСрезПоследних.Организация";
//  Запрос.УстановитьПараметр("Организация", ОрганизацияВладелец);
//  Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
//
//  ТаблицаЗемельныхУчастков = Запрос.Выполнить().Выгрузить();
//  ТаблицаЗемельныхУчастков.Индексы.Добавить("КадастровыйНомер");
//
Процедура ПолучитьЛьготыПоКадастровымНомерам(ТаблицаЗемельныхУчастков, ОрганизацияВладелец, ДатаСреза) Экспорт
	
КонецПроцедуры

// Заполняет контейнер данными бухгалтерской отчетности и помещает его во временное хранилище.
Процедура ПолучитьПоказателиАвтозаполненияБухгалтерскойОтчетности(ПараметрыОтчета, Контейнер) Экспорт
	
КонецПроцедуры

// Процедура возращает код тарифа или размер тарифа страховых взносов в процентах по коду категории и отчетному году.
//
// Параметры:
//  КодКатегории - Строка - код из приложения № 8 Приказ ФНС России от 10.10.2016 N ММВ-7-11/551@
//                          "Об утверждении формы расчета по страховым взносам, порядка его заполнения,
//                          а также формата представления расчета по страховым взносам в электронной форме".
//  ОтчетныйГод - Число - четырехзначное число, соответствующее отчетному году.
//  КодИлиРазмерТарифа  - Строка, Число, Неопределено - код тарифа("Строка"), размер тарифа ("Число"),
//                                      "Неопределено" - в случае, если соответствие коду категории не найдено.
//  ВернутьРазмерТарифа - Булево - если "Истина", то возвращается размер тарифа в процентах, иначе - код тарифа.
//
// Пример реализации:
//  ОтчетныйПериод = Дата(ОтчетныйГод, 1, 1);
//  КатегорияЗастрахованногоЛица = Перечисления.КатегорииЗастрахованныхЛицДляПФР[КодКатегории];
//  
//  Если ВернутьРазмерТарифа Тогда
//  	
//  	ЗначенияТарифов = 
//  		ПерсонифицированныйУчет.ТарифыПоКатегориям(ОтчетныйПериод).Получить(КатегорияЗастрахованногоЛица);
//  	Если ЗначенияТарифов = Неопределено Тогда
//  		КодИлиРазмерТарифа = Неопределено;
//  	Иначе
//  		КодИлиРазмерТарифа = ЗначенияТарифов.ПФРСтраховая;
//  	КонецЕсли;
//  	
//  Иначе
//  	
//  	Запрос = Новый Запрос;
//  	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
//  	Запрос.УстановитьПараметр("ОтчетныйГод", ОтчетныйГод);
//  	Запрос.УстановитьПараметр("КатегорияЗастрахованногоЛица", КатегорияЗастрахованногоЛица);
//  	
//  	ПерсонифицированныйУчет.СформироватьВТСоответствиеТарифаИВидаЗЛКатегории(
//  		Запрос.МенеджерВременныхТаблиц, ОтчетныйГод);
//  	УчетСтраховыхВзносов.СоздатьВТКодыВидовТарифаСтраховыхВзносов(
//  		ОтчетныйПериод, ОтчетныйПериод, Запрос.МенеджерВременныхТаблиц);
//  	
//  	ТекстЗапроса =
//  		"ВЫБРАТЬ
//  		|	СоответствиеТарифаИВидаЗЛКатегории.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
//  		|	МИНИМУМ(СоответствиеТарифаИВидаЗЛКатегории.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
//  		|ПОМЕСТИТЬ ВТТарифыПоКатегориям
//  		|ИЗ
//  		|	ВТСоответствиеТарифаИВидаЗЛКатегории КАК СоответствиеТарифаИВидаЗЛКатегории
//  		|ГДЕ
//  		|	&ОтчетныйГод МЕЖДУ СоответствиеТарифаИВидаЗЛКатегории.ГодС И СоответствиеТарифаИВидаЗЛКатегории.ГодПо
//  		|
//  		|СГРУППИРОВАТЬ ПО
//  		|	СоответствиеТарифаИВидаЗЛКатегории.КатегорияЗастрахованныхЛиц
//  		|;
//  		|
//  		|////////////////////////////////////////////////////////////////////////////////
//  		|ВЫБРАТЬ
//  		|	СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
//  		|	КодыВидовТарифаСтраховыхВзносов.ИмяПоля КАК КодТарифа
//  		|ИЗ
//  		|	ВТТарифыПоКатегориям КАК СоответствиеТарифаКатегории
//  		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКодыВидовТарифаСтраховыхВзносов КАК КодыВидовТарифаСтраховыхВзносов
//  		|		ПО СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов =
//  		|			КодыВидовТарифаСтраховыхВзносов.ВидТарифаСтраховыхВзносов
//  		|			И (&ОтчетныйГод = КодыВидовТарифаСтраховыхВзносов.РасчетныйПериод)
//  		|			И (&КатегорияЗастрахованногоЛица = СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц) ";
//  	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ИмяПоля", ?(ОтчетныйГод < 2017, "КодПФР", "КодФНС"));
//  	
//  	КодИлиРазмерТарифа = Неопределено;
//  	
//  	Выборка = Запрос.Выполнить().Выбрать();
//  	Пока Выборка.Следующий() Цикл
//  		Если ЗначениеЗаполнено(Выборка.КатегорияЗастрахованныхЛиц) Тогда
//  			КодИлиРазмерТарифа = Выборка.КодТарифа;
//  			Прервать;
//  		КонецЕсли;
//  	КонецЦикла;
//  	
//  КонецЕсли;
//
Процедура ПолучитьКодИлиРазмерТарифаПоКодуКатегории(КодКатегории,
													ОтчетныйГод,
													КодИлиРазмерТарифа,
													ВернутьРазмерТарифа) Экспорт
	
КонецПроцедуры

// Определяет признак учета отложенного налога балансовым методом
// по ПБУ 18/02 с изменениями по приказу Минфина от 20.11.2018 N 236н.
//
// Параметры:
//   УчетБалансовымМетодом - Булево - переменная, в которую будет помещен результат определения.
//   Организация - СправочникСсылка.Организации - ссылка на элемент справочника "Организации".
//   Период - Дата - дата, на которую нужно получить признак.
//
// Пример реализации:
//   СпособУчетаОтложенногоНалога = НалогНаПрибыльБухгалтерскийУчет.ВариантУчетаОтложенногоНалога(Период, Организация);
//   УчетБалансовымМетодом = (СпособУчетаОтложенногоНалога = Перечисления.ВариантыУчетаОтложенногоНалога.БалансовыйМетод);
//
Процедура ОпределитьУчетОтложенногоНалогаБалансовымМетодом(УчетБалансовымМетодом, Организация, Период) Экспорт
	
КонецПроцедуры

// Определяет признак разделения авансов по видам активов для отражения в бухгалтерской отчетности.
// 
// Параметры:
//   РазделятьАвансы - Булево - переменная, в которую будет помещен результат определения.
//   Организация - СправочникСсылка.Организации - организация, по которой нужно определить признак.
//   Период - Дата - дата, на которую нужно получить признак.
//
// Пример реализации:
//   СпособОтражения = УчетнаяПолитика.СпособОтраженияАвансовВыданных(Организация, Период);
//   РазделятьАвансы = (СпособОтражения = Перечисления.СпособОтраженияАвансовВыданных.РазделятьПоВидамАктивов);
//
Процедура ОпределитьРазделениеАвансовПоВидамАктивов(РазделятьАвансы, Организация, Период) Экспорт
	
КонецПроцедуры

// Изменяет признаки включения разделов регламентированного отчета при создании.
//
// Параметры:
//   ИДОтчета - Строка - имя регламентированного отчета.
//   ИДРедакцииОтчета - Строка - имя формы регламентированного отчета.
//   ПараметрыОтчета - Структура - параметры регламентированного отчета, требующиеся для изменения признаков.
//   РазделыОтчета - ДеревоЗначений - разделы и признаки разделов регламентированного отчета:
//     * Идентификатор - Строка - идентификатор отчета
//     * Название - Строка - название отчета
//     * ВключенВОтчет - Булево - признак включения отчета в состав отчетности.
//
// Пример реализации:
//   Если ИДОтчета = "РегламентированныйОтчетБухОтчетность" Тогда
//       Если ИДРедакцииОтчета = "ФормаОтчета2019Кв1" Тогда
//           ОписаниеРаздела = РазделыОтчета.Строки.Найти("Баланс", "Идентификатор");
//           Если ОписаниеРаздела <> Неопределено Тогда
//               ОписаниеРаздела.ВключенВОтчет = Истина;
//           КонецЕсли;
//       КонецЕсли;
//   КонецЕсли;
//
Процедура ИзменитьСоставОтчета(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, РазделыОтчета) Экспорт
	
КонецПроцедуры

Функция ВсеПоказателиСведенийОбОрганизации()
	
	СписокПоказателей = Новый Массив;
	
	СписокПоказателей.Добавить("КодНО");
	СписокПоказателей.Добавить("КодНалоговогоОргана");
	СписокПоказателей.Добавить("КодОрганаПФР");
	СписокПоказателей.Добавить("КодОрганаФСГС");
	СписокПоказателей.Добавить("ОГРН");
	СписокПоказателей.Добавить("НаимЮЛСокр");
	СписокПоказателей.Добавить("НаимЮЛПол");
	СписокПоказателей.Добавить("ИННЮЛ");
	СписокПоказателей.Добавить("КППЮЛ");
	СписокПоказателей.Добавить("ТелОрганизации");
	СписокПоказателей.Добавить("ФаксОрганизации");
	СписокПоказателей.Добавить("АдресЭлПочтыИП");
	СписокПоказателей.Добавить("АдресЭлектроннойПочтыОрганизации");
	СписокПоказателей.Добавить("АдрПочт");
	СписокПоказателей.Добавить("АдрПочт_XML");
	СписокПоказателей.Добавить("АдрПочт_JSON");
	СписокПоказателей.Добавить("АдрЮР");
	СписокПоказателей.Добавить("АдрЮР_XML");
	СписокПоказателей.Добавить("АдрЮР_JSON");
	СписокПоказателей.Добавить("ПолныйАдрЮР");
	СписокПоказателей.Добавить("АдрФакт");
	СписокПоказателей.Добавить("АдрФакт_XML");
	СписокПоказателей.Добавить("АдрФакт_JSON");
	СписокПоказателей.Добавить("ОргИндекс");
	СписокПоказателей.Добавить("ОргСубъект");
	СписокПоказателей.Добавить("ОргКодСубъект");
	СписокПоказателей.Добавить("ОргРайон");
	СписокПоказателей.Добавить("ОргГород");
	СписокПоказателей.Добавить("ОргНПункт");
	СписокПоказателей.Добавить("ОргУлица");
	СписокПоказателей.Добавить("ОргДом");
	СписокПоказателей.Добавить("ОргКорпус");
	СписокПоказателей.Добавить("ОргКвартира");
	СписокПоказателей.Добавить("АдрМЖ");
	СписокПоказателей.Добавить("АдрМЖ_XML");
	СписокПоказателей.Добавить("АдрМЖ_JSON");
	СписокПоказателей.Добавить("АдрПрописки");
	СписокПоказателей.Добавить("АдрПрописки_XML");
	СписокПоказателей.Добавить("АдрПрописки_JSON");
	СписокПоказателей.Добавить("БанкСчетНомер");
	СписокПоказателей.Добавить("БанкСчетНаимБанка");
	СписокПоказателей.Добавить("БанкСчетКоррСчетБанка");
	СписокПоказателей.Добавить("БанкСчетБИКБанка");
	СписокПоказателей.Добавить("ФИОРук");
	СписокПоказателей.Добавить("ФамилияРук");
	СписокПоказателей.Добавить("ИмяРук");
	СписокПоказателей.Добавить("ОтчествоРук");
	СписокПоказателей.Добавить("ДолжнРук");
	СписокПоказателей.Добавить("ИННРук");
	СписокПоказателей.Добавить("ДатаРождРук");
	СписокПоказателей.Добавить("МестоРождРук");
	СписокПоказателей.Добавить("ПолРук");
	СписокПоказателей.Добавить("ГраждРук");
	СписокПоказателей.Добавить("ГраждСтранаРук");
	СписокПоказателей.Добавить("ТелРук");
	СписокПоказателей.Добавить("КодУдЛичнРук");
	СписокПоказателей.Добавить("КодПодрУдЛичнРук");
	СписокПоказателей.Добавить("ВидУдЛичнРук");
	СписокПоказателей.Добавить("ОрганВыданУдЛичнРук");
	СписокПоказателей.Добавить("СерияУдЛичнРук");
	СписокПоказателей.Добавить("НомерУдЛичнРук");
	СписокПоказателей.Добавить("ДатаУдЛичнРук");
	СписокПоказателей.Добавить("АдрМЖРукРФ");
	СписокПоказателей.Добавить("АдрМЖРукРФ_XML");
	СписокПоказателей.Добавить("АдрМЖРукРФ_JSON");
	СписокПоказателей.Добавить("ИндексМЖРук");
	СписокПоказателей.Добавить("СубъектМЖРук");
	СписокПоказателей.Добавить("КодСубъектМЖРук");
	СписокПоказателей.Добавить("РайонМЖРук");
	СписокПоказателей.Добавить("ГородМЖРук");
	СписокПоказателей.Добавить("НПунктМЖРук");
	СписокПоказателей.Добавить("УлицаМЖРук");
	СписокПоказателей.Добавить("ДомМЖРук");
	СписокПоказателей.Добавить("КорпусМЖРук");
	СписокПоказателей.Добавить("КвартираМЖРук");
	СписокПоказателей.Добавить("ФИОБух");
	СписокПоказателей.Добавить("ФамилияБух");
	СписокПоказателей.Добавить("ИмяБух");
	СписокПоказателей.Добавить("ОтчествоБух");
	СписокПоказателей.Добавить("ДатаРождБух");
	СписокПоказателей.Добавить("МестоРождБух");
	СписокПоказателей.Добавить("ПолБух");
	СписокПоказателей.Добавить("ГраждБух");
	СписокПоказателей.Добавить("ГраждСтранаБух");
	СписокПоказателей.Добавить("ТелБух");
	СписокПоказателей.Добавить("КодУдЛичнБух");
	СписокПоказателей.Добавить("КодПодрУдЛичнБух");
	СписокПоказателей.Добавить("ВидУдЛичнБух");
	СписокПоказателей.Добавить("ОрганВыданУдЛичнБух");
	СписокПоказателей.Добавить("СерияУдЛичнБух");
	СписокПоказателей.Добавить("НомерУдЛичнБух");
	СписокПоказателей.Добавить("ДатаУдЛичнБух");
	
	Возврат СписокПоказателей;
	
КонецФункции

// Функция возвращает информацию об организации с учетом предыдущих обращений к сведениям.
// Параметры:
//		Кэш - структура, содержащая информацию с данными об организации, которые запрашивались ранее (кэш сведений);
//		Параметр - строка, имя запрашиваемого параметра;
//		ФизЛицо - переменная типа СправочникСсылка.ФизическиеЛица. Параметр необязателен, необходим 
//			для получения лишь некоторых параметров (сведений об ответственных лицах организации).
// Возвращаемое значение:
//		Значение запрашиваемого параметра, полученное с учетом кэша.
//
Функция ПолучитьСУчетомКэша(Кэш, Параметр, ФизЛицо = Неопределено)//ЗначениеПараметра
	
	Перем Значение;
	
	Если Кэш.Свойство(Параметр, Значение) Тогда
		Возврат Значение;
	КонецЕсли;
	
	Если Параметр = "СтавкаНалогаНаПрибыль" Тогда
			Возврат Неопределено;
	ИначеЕсли Параметр = "ЮрАдресОрганизации" ИЛИ Параметр = "ФактАдресОрганизации"  Тогда
		
		Если Кэш.ПБОЮЛ Тогда
			
			ЭлементАдрес = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
			Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, ЭлементАдрес);
			Результат = Кэш.Организация.КонтактнаяИнформация.НайтиСтроки(Данные);
			Если Результат.Количество() > 0 Тогда
				Результат = Результат[0];
			Иначе
				Результат = Неопределено;
			КонецЕсли;
			
		Иначе
			
			ЭлементАдрес = ?(Параметр = "ЮрАдресОрганизации",Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации , Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
			Результат = Неопределено;
			Для Каждого Элемент Из Кэш.Организация.КонтактнаяИнформация Цикл
				Если Элемент.Вид.Наименование = ЭлементАдрес.Наименование Тогда
					Результат = Элемент;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли Параметр = "СведенияОбИндивидуальномПредпринимателе" Тогда
		Возврат Кэш.Организация.ИндивидуальныйПредприниматель;
		
	ИначеЕсли Параметр = "СведенияОРуководителе"
		Или Параметр = "СведенияОБухгалтере"
		Или Параметр = "СведенияОбИсполнителе" Тогда
		
		ВидОтветственногоЛица = "Руководитель";
		Если Параметр = "СведенияОБухгалтере" Тогда
			ВидОтветственногоЛица = "ГлавныйБухгалтер";
		ИначеЕсли Параметр = "СведенияОбИсполнителе" Тогда
			ВидОтветственногоЛица = "Исполнитель";
		ИначеЕсли Параметр = "СведенияОУполномоченномПредставителе" Тогда
			ВидОтветственногоЛица = "УполномоченныйПредставительФНС";
		КонецЕсли;
		
		Результат = Новый Структура("ФизическоеЛицо, Пользователь");
		Результат.Пользователь =
			РаботаСОрганизациями.ПолучитьОтветственноеЛицо(ВидОтветственногоЛица, Кэш.Организация.Ссылка, Кэш.ДатаЗначения);
		Если ЗначениеЗаполнено(Результат.Пользователь) Тогда
			Результат.ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Результат.Пользователь, "ФизЛицо");
		КонецЕсли;
		
	ИначеЕсли Параметр = "ТелефонОрганизации" Тогда
		ЭлементТелефон = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации;
		Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Телефон, ЭлементТелефон);
		Результат = Кэш.Организация.КонтактнаяИнформация.НайтиСтроки(Данные);
		Если Результат.Количество() > 0 Тогда
			Результат = Результат[0];
		Иначе
			Результат = Неопределено;
		КонецЕсли;
	ИначеЕсли Параметр = "EmailОрганизации" Тогда
		ЭлементEmail = Справочники.ВидыКонтактнойИнформации.EmailОрганизации;
		Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, ЭлементEmail);
		Результат = Кэш.Организация.КонтактнаяИнформация.НайтиСтроки(Данные);
		Если Результат.Количество() > 0 Тогда
			Результат = Результат[0];
		Иначе
			Результат = Неопределено;
		КонецЕсли;
	ИначеЕсли Параметр = "СведенияОбИндивидуальномПредпринимателеПаспортныеДанные" Тогда
		Результат = РегламентированнаяОтчетность.ПолучитьДокФизЛица(Кэш.Организация.ФизическоеЛицо, Кэш.ДатаЗначения);
	ИначеЕсли Параметр = "СведенияОРуководителеПаспортныеДанные" 
		ИЛИ Параметр = "СведенияОБухгалтереПаспортныеДанные" 
		ИЛИ Параметр = "СведенияОУполномоченномПредставителеПаспортныеДанные" Тогда
		
		Результат = РегламентированнаяОтчетность.ПолучитьДокФизЛица(ФизЛицо, Кэш.ДатаЗначения);
		
	ИначеЕсли Параметр = "СведенияОбИндивидуальномПредпринимателеАдрес" 
		ИЛИ Параметр = "СведенияОРуководителеАдрес" 
		ИЛИ Параметр = "СведенияОБухгалтереАдрес" 
		ИЛИ Параметр = "СведенияОУполномоченномПредставителеАдрес" Тогда
		
			ПолучитьКонтактнуюИнформациюОрганизации(
				Результат,
				ФизЛицо.Ссылка,
				Перечисления.ТипыКонтактнойИнформации.Адрес,
				Справочники.ВидыКонтактнойИнформации.ДомашнийАдресФизическогоЛица,
				,
				,
				Неопределено);
		
	ИначеЕсли Параметр = "СведенияОбИндивидуальномПредпринимателеАдресПрописки" Тогда
		
		ПолучитьКонтактнуюИнформациюОрганизации(
			Результат,
			ФизЛицо.Ссылка,
			Перечисления.ТипыКонтактнойИнформации.Адрес,
			Справочники.ВидыКонтактнойИнформации.ДомашнийАдресФизическогоЛица,
			,
			,
			Неопределено);
		
	ИначеЕсли Параметр = "СведенияОбИндивидуальномПредпринимателеГражданство" 
		ИЛИ Параметр = "СведенияОРуководителеГражданство" 
		ИЛИ Параметр = "СведенияОБухгалтереГражданство" 
		ИЛИ Параметр = "СведенияОУполномоченномПредставителеГражданство" Тогда
		
		Результат = Справочники.СтраныМира.Россия;
		
	КонецЕсли;
				
	Кэш.Вставить(Параметр, Результат);
	Возврат Результат;
	
КонецФункции

// Функция возвращает информацию о адресе организации с учетом предыдущих обращений к сведениям.
// Параметры:
//		Кэш - структура, содержащая информацию с данными об организации, которые запрашивались ранее (кэш сведений);
//		Параметр - строка, имя параметра, запрашиваемого в кэше;
//		ЧастьАдреса - строка, часть адреса, которую нужно вернуть.
//		РоссийскийАдрес - Структура, описывает возможные части адреса.
// Возвращаемое значение:
//		Значение части адреса, полученное с учетом кэша.
//
Функция ПолучитьЧастьАдресаСУчетомКэша(Знач Кэш, Знач Параметр, Знач ЧастьАдреса, Знач РоссийскийАдрес)
	
	Значение = "";
	ДанныеКэша = ПолучитьСУчетомКэша(Кэш, Параметр);
	Если ДанныеКэша <> Неопределено Тогда
		РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(ДанныеКэша.ЗначенияПолей, РоссийскийАдрес);
		Значение = РоссийскийАдрес[ЧастьАдреса];
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция АдресВXML(КонтактнаяИнформация, ВидАдреса)
	
	Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, ВидАдреса);
	
	Результат = КонтактнаяИнформация.НайтиСтроки(Данные);
	
	Если Результат.Количество() > 0 Тогда
		Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(Результат[0].ЗначенияПолей, Результат[0].Представление, ВидАдреса);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция АдресВJSON(КонтактнаяИнформация, ВидАдреса)
	
	Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, ВидАдреса);
	
	Результат = КонтактнаяИнформация.НайтиСтроки(Данные);
	
	Если Результат.Количество() > 0 Тогда
		Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(Результат[0].Значение, ВидАдреса);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьКонтактнуюИнформациюОрганизации(Значение, ВладелецКИ, Тип, Вид,
	ПолеРезультата = Неопределено, ПреобразоватьВФорматАдреса = Ложь, ПустоеЗначение = "")
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ВладелецКИ);
	
	КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивОбъектов,, Вид, ТекущаяДатаСеанса());
	
	Отбор = Новый Структура("Тип, Вид", Тип, Вид);
	Результат = КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Если Результат.Количество() > 0 Тогда
		
		Если ПолеРезультата = Неопределено Тогда
			Значение = Результат[0];
		Иначе
			Значение = Результат[0][ПолеРезультата];
		КонецЕсли;
		
		Если ПреобразоватьВФорматАдреса Тогда
			Значение = РегламентированнаяОтчетность.АдресВФормате9Запятых(Значение);
		КонецЕсли;
		
		Если ПустаяСтрока(Значение) Тогда
			Значение = ПустоеЗначение;
		КонецЕсли;
		
	Иначе
		
		Значение = ПустоеЗначение;
		
	КонецЕсли;

КонецФункции

#КонецОбласти