
////////////////////////////////////////////////////////////////////////////////
// Общий модуль ИнтеграцияЭДО
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область АктуальныйЭлектронныйДокумент

// Возвращает ссылку на основной электронный документ объекта учета.
// 
// Параметры:
//  ОбъектУчета - ОпределяемыеТипы.ОснованияЭлектронныхДокументовЭДО
//  ВидДокумнета - СправочникСсылка.ВидыДокументовЭДО
//
// Возвращаемое значение:
//  ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО, Неопределено - ссылка на электронный документ.
//  Неопределено - ЭлектронныйДокумент не найден.
//
Функция АктуальныйЭлектронныйДокументОбъектаУчета(ОбъектУчета, ВидДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АктуальныеДокументыЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент
	|ИЗ
	|	РегистрСведений.АктуальныеДокументыЭДО КАК АктуальныеДокументыЭДО
	|ГДЕ
	|	АктуальныеДокументыЭДО.ОбъектУчета = &ОбъектУчета
	|	И АктуальныеДокументыЭДО.ВидЭлектронногоДокумента = &ВидДокумента";
	
	Запрос.УстановитьПараметр("ОбъектУчета", ОбъектУчета);
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.ЭлектронныйДокумент;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает таблицу актуальных электронных документов по объектам учета.
// 
// Параметры:
//  ОбъектыУчета - Массив Из ОпределяемыеТипы.ОснованияЭлектронныхДокументовЭДО
//
// Возвращаемое значение:
//  ТаблицаЗначений - данные соответствия.
//   * ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - ссылка на объект учета.
//   * ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - актуальный ЭлектронныйДокумент.
//
Функция АктуальныеЭлектронныеДокументы(Знач ОбъектыУчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	АктуальныеДокументыЭДО.ОбъектУчета КАК ОбъектУчета,
	|	АктуальныеДокументыЭДО.ВидЭлектронногоДокумента КАК ВидДокумента,
	|	АктуальныеДокументыЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент
	|ИЗ
	|	РегистрСведений.АктуальныеДокументыЭДО КАК АктуальныеДокументыЭДО
	|ГДЕ
	|	АктуальныеДокументыЭДО.ОбъектУчета В (&ОбъектУчета)";
	Запрос.Параметры.Вставить("ОбъектУчета", ОбъектыУчета);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает таблицу объектов учета актуальных электронных документов.
// 
// Параметры:
// ЭлектронныеДокументы - Массив Из ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//
// Возвращаемое значение:
//  ТаблицаЗначений - данные соответствия.
//   * ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - ссылка на объект учета.
//   * ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - актуальный электронный документ.
//
Функция ОбъектыУчетаАктуальныхЭлектронныхДокументов(Знач ЭлектронныеДокументы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	АктуальныеДокументыЭДО.ОбъектУчета КАК ОбъектУчета,
	|	АктуальныеДокументыЭДО.ВидЭлектронногоДокумента КАК ВидДокумента,
	|	АктуальныеДокументыЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент
	|ИЗ
	|	РегистрСведений.АктуальныеДокументыЭДО КАК АктуальныеДокументыЭДО
	|ГДЕ
	|	АктуальныеДокументыЭДО.ЭлектронныйДокумент В (&ЭлектронныеДокументы)";
	Запрос.Параметры.Вставить("ЭлектронныеДокументы", ЭлектронныеДокументы);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает текст запроса для выборки актуального электронного документа по объекта учета.
// Запрос содержит поля:
//  * ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - ссылка на объект учета.
//  * ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - актуальный ЭлектронныйДокумент.
// Результат помещается во временную таблицу "АктуальныеЭлектронныеДокументы".
// Запрос выполняется с отбором объектов учета через параметр "ОбъектыУчета",
// значение которого следует задавать массивом или единичном значением типа ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО.
//
// Возвращаемое значение:
//  Строка - текст запроса.
//
Функция ТекстЗапросаАктуальныхЭлектронныхДокументовОбъектовУчета() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	АктуальныеДокументыЭДО.ОбъектУчета КАК ОбъектУчета,
	|	АктуальныеДокументыЭДО.ВидЭлектронногоДокумента КАК ВидДокумента,
	|	АктуальныеДокументыЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент
	|ПОМЕСТИТЬ АктуальныеЭлектронныеДокументы
	|ИЗ
	|	РегистрСведений.АктуальныеДокументыЭДО КАК АктуальныеДокументыЭДО
	|ГДЕ
	|	АктуальныеДокументыЭДО.ОбъектУчета В (&ОбъектыУчета)";

	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает текст запроса для выборки актуальных объектов учета электронных документов.
// Запрос содержит поля:
//  * ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - ссылка на объект учета.
//  * ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - основной ЭлектронныйДокумент.
// Результат помещается во временную таблицу "АктуальныеЭлектронныеДокументы".
// Запрос выполняется с отбором электронного документа через параметр "ЭлектронныеДокументы",
// значение которого следует задавать массивом или единичном значением типа ДокументСсылка.ЭлектронныйДокументВходящийЭДО, 
// ДокументСсылка.ЭлектронныйДокументИсходящийЭДО.
//
// Возвращаемое значение:
//  Строка - текст запроса.
//
Функция ТекстЗапросаОбъектовУчетаАктуальныхЭлектронныхДокументов() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	АктуальныеДокументыЭДО.ОбъектУчета КАК ОбъектУчета,
	|	АктуальныеДокументыЭДО.ВидЭлектронногоДокумента КАК ВидДокумента,	
	|	АктуальныеДокументыЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент
	|ПОМЕСТИТЬ АктуальныеЭлектронныеДокументы
	|ИЗ
	|	РегистрСведений.АктуальныеДокументыЭДО КАК АктуальныеДокументыЭДО
	|ГДЕ
	|	АктуальныеДокументыЭДО.ЭлектронныйДокумент В (&ЭлектронныеДокументы)";

	Возврат ТекстЗапроса;
	
КонецФункции

Процедура РазорватьСвязьЭлектронногоДокументаСОбъектомУчета(ЭлектронныйДокумент, ОбъектУчета) Экспорт
	
	Отказ = Ложь;
	ОчиститьАктуальныйЭлектронныйДокумент(ОбъектУчета);
	
	НачатьТранзакцию();
	Попытка
		
		Набор = РегистрыСведений.ОбъектыУчетаДокументовЭДО.СоздатьНаборЗаписей();
		Набор.Отбор.ЭлектронныйДокумент.Установить(ЭлектронныйДокумент);
		Набор.Отбор.ОбъектУчета.Установить(ОбъектУчета);
	
		ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(Набор);
		
		Набор.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		Отказ = Истина;
		ОтменитьТранзакцию();
		
		ИмяСобытия = НСтр("ru = 'Разрыв связи электронного документа с объектом учета'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
	КонецПопытки;
	
	Если ТипЗнч(ЭлектронныйДокумент) = Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО") Тогда
		ВыполнитьКонтрольОтраженияВУчете(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЭлектронныйДокумент));
	КонецЕсли;
	
	Если Не Отказ Тогда
		УдаленныеДокументы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектУчета);
		ОбменСКонтрагентамиПереопределяемый.ПослеИзмененияОтраженияВУчете(ЭлектронныйДокумент, Новый Массив, УдаленныеДокументы);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьСвязьЭлектронногоДокументаСОбъектомУчета(ЭлектронныйДокумент, ВидДокумента, ОбъектУчета, СпособОбработки = "") Экспорт
	
	Отказ = Ложь;
	Состояние = ЭлектронныеДокументыЭДО.СостояниеДокумента(ЭлектронныйДокумент);
	
	НачатьТранзакцию();
	Попытка
		
		ЗаписатьАктуальныйЭлектронныйДокумент(ОбъектУчета, ЭлектронныйДокумент, ВидДокумента);
		УстановитьСостояниеЭлектронногоДокументаОбъектаУчета(ОбъектУчета, Состояние);
		
		Набор = РегистрыСведений.ОбъектыУчетаДокументовЭДО.СоздатьНаборЗаписей();
		Набор.Отбор.ЭлектронныйДокумент.Установить(ЭлектронныйДокумент);
		Набор.Отбор.ОбъектУчета.Установить(ОбъектУчета);
	
		ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(Набор);
		
		Запись = Набор.Добавить();
		Запись.ЭлектронныйДокумент = ЭлектронныйДокумент;
		Запись.ОбъектУчета = ОбъектУчета;		
		Запись.СпособОбработки = СпособОбработки;
		
		Набор.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		Отказ = Истина;
		ОтменитьТранзакцию();
		
		ИмяСобытия = НСтр("ru = 'Установка связи электронного документа с объектом учета'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
	КонецПопытки;
	
	Если ТипЗнч(ЭлектронныйДокумент) = Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	КонтрольОтраженияВУчетеЭДО.ЭлектронныйДокумент
			|ИЗ
			|	РегистрСведений.КонтрольОтраженияВУчетеЭДО КАК КонтрольОтраженияВУчетеЭДО
			|ГДЕ
			|	КонтрольОтраженияВУчетеЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент
			|	И КонтрольОтраженияВУчетеЭДО.СоздатьУчетныйДокумент";
		
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
		
		Если Не Запрос.Выполнить().Пустой() Тогда
			
			НаборЭлектронныхДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЭлектронныйДокумент);
			
			НаборПроверок = Новый Массив;
			НаборПроверок.Добавить("СоздатьУчетныйДокумент");
			НаборПроверок.Добавить("ПровестиУчетныйДокумент");
			ВыполнитьКонтрольОтраженияВУчете(НаборЭлектронныхДокументов, НаборПроверок)
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не Отказ Тогда
		ДобавленныеДокументы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектУчета);
		ОбменСКонтрагентамиПереопределяемый.ПослеИзмененияОтраженияВУчете(ЭлектронныйДокумент, ДобавленныеДокументы, Новый Массив);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает ссылку на основной электронный документ объекта учета.
// 
// Параметры:
//  ОбъектУчета - ОпределяемыеТипы.ОснованияЭлектронныхДокументовЭДО
//
// Возвращаемое значение:
//  ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО, Неопределено - ссылка на электронный документ.
//  Неопределено - электронный документ не найден.
//
Функция ОсновнойЭлектронныйДокументОбъектаУчета(Знач ОбъектУчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АктуальностьЭлектронныхДокументов.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
	|	АктуальностьЭлектронныхДокументов.ВидЭлектронногоДокумента КАК ВидДокумента,
	|	&Организация КАК Организация 
	|ПОМЕСТИТЬ ДанныеДокументовОбъектаУчета
	|ИЗ
	|	РегистрСведений.АктуальныеДокументыЭДО КАК АктуальностьЭлектронныхДокументов
	|ГДЕ
	|	АктуальностьЭлектронныхДокументов.ОбъектУчета = &ОбъектУчета";
	
	Запрос.УстановитьПараметр("ОбъектУчета", ОбъектУчета);
	ОписаниеОбъектаУчета = ОписаниеОбъектаУчета(ОбъектУчета);
	Запрос.УстановитьПараметр("Организация", ОписаниеОбъектаУчета.Организация);
	
	ПоляТаблицы = 
		"	ДанныеДокументовОбъектаУчета.ЭлектронныйДокумент КАК ЭлектронныйДокумент";
	ИмяТаблицы = 
		"	ДанныеДокументовОбъектаУчета КАК ДанныеДокументовОбъектаУчета";
	
	ПоляКлючаНастройки = НастройкиЭДО.НовоеОписаниеПолейКлючаНастройкиВнутреннегоЭДО();
	ПоляКлючаНастройки.Организация = "ДанныеДокументовОбъектаУчета.Организация";
	ПоляКлючаНастройки.ВидВнутреннегоДокумента = "ДанныеДокументовОбъектаУчета.ВидДокумента";
	
	ТекстЗапросаСНастройками = НастройкиЭДО.ТекстЗапросаДополнениеНастройкамиВнутреннегоЭДО(ИмяТаблицы, ПоляТаблицы, ПоляКлючаНастройки);
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(Запрос.Текст);
	ТекстыЗапросов.Добавить(ТекстЗапросаСНастройками);
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());

	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() Тогда
		Если ОписаниеОбъектаУчета.Направление = Перечисления.НаправленияЭДО.Внутренний Тогда
			ДокументСВидомПоУмолчанию = Выборка.Найти(Истина, "ЭтоОсновнойВидДокумента"); 
			Если ДокументСВидомПоУмолчанию <> Неопределено Тогда
				Возврат ДокументСВидомПоУмолчанию.ЭлектронныйДокумент;
			КонецЕсли;
		Иначе
			Возврат Выборка[0].ЭлектронныйДокумент;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ОчиститьАктуальностьЭлектронногоДокумента(ЭлектронныйДокумент) Экспорт

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОбъектыУчетаДокументовЭДО");
	ЭлементБлокировки.УстановитьЗначение("ЭлектронныйДокумент", ЭлектронныйДокумент);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		ТаблицаОбъектовУчета = ОбъектыУчетаЭлектронныхДокументов(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЭлектронныйДокумент));
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.АктуальныеДокументыЭДО");
		ЭлементБлокировки.ИсточникДанных = ТаблицаОбъектовУчета;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ОбъектУчета", "ОбъектУчета");
		Блокировка.Заблокировать();
		
		АктуальныеЭлектронныеДокументы = АктуальныеЭлектронныеДокументы(
			ТаблицаОбъектовУчета.ВыгрузитьКолонку("ОбъектУчета"));
		
		Для Каждого СтрокаТаблицы Из АктуальныеЭлектронныеДокументы Цикл
			НаборЗаписей = РегистрыСведений.АктуальныеДокументыЭДО.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ОбъектУчета.Установить(СтрокаТаблицы.ОбъектУчета);
			НаборЗаписей.Отбор.ВидЭлектронногоДокумента.Установить(СтрокаТаблицы.ВидДокумента);
			НаборЗаписей.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ИмяСобытия = НСтр("ru = 'Очистка информации о состоянии актуального электронного документа'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение;
	КонецПопытки;	

КонецПроцедуры

#КонецОбласти

#Область ГотовностьКДокументообороту

// Возвращает описание проверки готовности объектов учета к документообороту.
//
// Параметры:
//  НаборОбъектовУчета - Массив из ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - объекты на проверку.
//
// Возвращаемое значение:
//  см. НоваяПроверкаГотовностиКДокументообороту
//
Функция ПроверкаГотовностиКДокументообороту(НаборОбъектовУчета) Экспорт
	
	ОбъектыПроверки = ОбщегоНазначения.СкопироватьРекурсивно(НаборОбъектовУчета);
	
	ЭлектронноеВзаимодействиеПереопределяемый.ПроверитьГотовностьИсточников(ОбъектыПроверки);
	
	Готовые = Новый Массив;
	Неготовые = Новый Массив;
	Для каждого ОбъектУчета Из НаборОбъектовУчета Цикл
		
		Если ОбъектыПроверки.Найти(ОбъектУчета) = Неопределено Тогда
			Неготовые.Добавить(ОбъектУчета);
		Иначе
			Готовые.Добавить(ОбъектУчета);
		КонецЕсли;
	
	КонецЦикла;
	
	Проверка = НоваяПроверкаГотовностиКДокументообороту(Готовые, Неготовые);
	
	Возврат Проверка;
	
КонецФункции

// Проверяет готовность прикладного электронного документа к отражению в учете.
// 
// Параметры:
//  ПараметрыОтражения - Структура - данные для подготовки к отражению в учете:
//   * ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - отражаемый в учете электронный документ.
//   * ТипДокумента - ОпределяемыйТип.ПрикладныеТипыЭлектронныхДокументовЭДО - прикладной тип электронного документа. 
//   * СпособОбработки - Строка - выбранный способ отражения в учете.
//
Функция ПрикладнойЭлектронныйДокументГотовКОтражениюВУчете(ПараметрыОтражения) Экспорт
	
	ГотовКОтражению = Истина;
	
	Если НЕ ИспользоватьСопоставлениеНоменклатуры(ПараметрыОтражения.ТипДокумента) Тогда
		Возврат ГотовКОтражению;
	КонецЕсли;
	
	СвойстваЭлектронногоДокумента = Новый Структура("СпособОбработки", ПараметрыОтражения.СпособОбработки);
	Настройки = Новый Структура("ОтражатьТолькоСопоставленные", Истина);
	ОбменСКонтрагентамиПереопределяемый.ПриОтраженииВУчетеПрикладногоЭлектронногоДокументаСНоменклатурой(
		СвойстваЭлектронногоДокумента, Настройки);
	Если Настройки.ОтражатьТолькоСопоставленные Тогда
		ОтборПоДокументу = Новый Структура("ЭлектронныйДокумент", ПараметрыОтражения.ЭлектронныйДокумент);
		ГотовКОтражению = НЕ ЗначениеЗаполнено(НоменклатураКонтрагентовНаКонтроле(ОтборПоДокументу));
	КонецЕсли;
	
	Возврат ГотовКОтражению;
	
КонецФункции

#КонецОбласти

#Область ОписаниеОбъектаУчета

Функция НовоеОписаниеОбъектаУчета() Экспорт
	
	Возврат ИнтеграцияЭДОКлиентСервер.НовоеОписаниеОбъектаУчета();
	
КонецФункции

Функция ОписаниеОбъектаУчета(ИсточникДанных) Экспорт
	
	Описание = НовоеОписаниеОбъектаУчета();
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(ИсточникДанных) Тогда
		ИсточникДанныхСсылка = ИсточникДанных;
	Иначе // передан объект.
		ИсточникДанныхСсылка = ИсточникДанных.Ссылка;
	КонецЕсли;
	Описание.ОбъектУчета = ИсточникДанныхСсылка;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.КоммерческиеПредложения") Тогда
		МодульКоммерческиеПредложенияСлужебный = ОбщегоНазначения.ОбщийМодуль("КоммерческиеПредложенияСлужебный");
		ЭтоОснованиеЭлектронногоДокументаПоЗапросуКоммерческихПредложений =
			МодульКоммерческиеПредложенияСлужебный.ЭтоОснованиеЭлектронногоДокументаПоЗапросуКоммерческихПредложений(ИсточникДанныхСсылка);
	Иначе
		ЭтоОснованиеЭлектронногоДокументаПоЗапросуКоммерческихПредложений = Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.КоммерческиеПредложения") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("КоммерческиеПредложенияСлужебный");
		ЭтоКоммерческоеПредложение = МодульПодсистемы.ЭтоКоммерческоеПредложениеКлиенту(ИсточникДанныхСсылка);
	Иначе
		ЭтоКоммерческоеПредложение = Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.КоммерческиеПредложения") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("КоммерческиеПредложенияСлужебный");
		ЭтоЗапросКоммерческогоПредложенияОтКлиента = МодульПодсистемы.ЭтоЗапросКоммерческогоПредложенияОтКлиента(ИсточникДанныхСсылка);
	Иначе
		ЭтоЗапросКоммерческогоПредложенияОтКлиента = Ложь;
	КонецЕсли;
	
	КоммерческоеПредложениеКлиенту =
		"ЭлектронноеВзаимодействие.КоммерческиеПредложения.КоммерческиеПредложенияДокументы.КоммерческоеПредложениеКлиенту";
	
	ЗапросКоммерческогоПредложенияОтКлиента =
		"ЭлектронноеВзаимодействие.КоммерческиеПредложения.КоммерческиеПредложенияДокументы.ЗапросКоммерческогоПредложенияОтКлиента";
		
	СправочникОрганизации = ИмяПрикладногоСправочника("Организации");
		
	ПараметрыИсточника = Новый Структура;
	ПараметрыИсточника.Вставить("Тип");
	ПараметрыИсточника.Вставить("ФормированиеУниверсальногоДокумента");
	ПараметрыИсточника.Вставить("Направление");
	ПараметрыИсточника.Вставить("Организация");
	ПараметрыИсточника.Вставить("Контрагент");
	ПараметрыИсточника.Вставить("ДоговорКонтрагента", Метаданные.ОпределяемыеТипы.ДоговорСКонтрагентомЭДО.Тип.ПривестиЗначение());
	ПараметрыИсточника.Вставить("СоглашениеЭД");
	ПараметрыИсточника.Вставить("Партнер");
	
	Если ТипЗнч(ИсточникДанныхСсылка) = Тип("СправочникСсылка.НастройкиЭДО")  Тогда
		
		Описание.ТипДокумента = Перечисления.ТипыДокументовЭДО.КаталогТоваров;
		Описание.Направление = Перечисления.НаправленияЭДО.Исходящий;
		Описание.ОбъектУчета = ИсточникДанныхСсылка;
		Описание.Контрагент = ИсточникДанныхСсылка.Контрагент;
		Описание.Организация = ИсточникДанныхСсылка.Организация;
		Описание.Договор = ИсточникДанныхСсылка.ДоговорКонтрагента;
	
	ИначеЕсли ТипЗнч(ИсточникДанныхСсылка) = Тип("СправочникСсылка." + СправочникОрганизации)
		Или ТипЗнч(ИсточникДанныхСсылка) = Тип("СправочникОбъект." + СправочникОрганизации) Тогда
		
		Описание.ТипДокумента = Перечисления.ТипыДокументовЭДО.РеквизитыОрганизации;
		Описание.Организация = ИсточникДанныхСсылка;
		Описание.Направление = Перечисления.НаправленияЭДО.Исходящий;
		
	ИначеЕсли ЭтоОснованиеЭлектронногоДокументаПоЗапросуКоммерческихПредложений Тогда
		
		МодульКоммерческиеПредложенияСлужебный.ЗаполнитьПараметрыЭлектронногоДокументаПоОснованию(ИсточникДанныхСсылка,
			ПараметрыИсточника);
		
		Описание.ТипДокумента = ПараметрыИсточника.Тип;
		Описание.Направление  = ПараметрыИсточника.Направление;
		Описание.Организация  = ПараметрыИсточника.Организация;
		Описание.Контрагент   = ПараметрыИсточника.Контрагент;
		Описание.Договор      = ПараметрыИсточника.ДоговорКонтрагента;
		
	ИначеЕсли ЭтоКоммерческоеПредложение
		И ОбщегоНазначения.ПодсистемаСуществует(КоммерческоеПредложениеКлиенту) Тогда
		
		МодульДокумента = ОбщегоНазначения.ОбщийМодуль("Документы.КоммерческоеПредложениеКлиенту");
		МодульДокумента.ЗаполнитьПараметрыЭлектронногоДокумента(ИсточникДанныхСсылка, ПараметрыИсточника);

		Описание.ТипДокумента = ПараметрыИсточника.Тип;
		Описание.Направление  = ПараметрыИсточника.Направление;
		Описание.Организация  = ПараметрыИсточника.Организация;
		Описание.Контрагент   = ПараметрыИсточника.Контрагент;
		Описание.Договор      = ПараметрыИсточника.ДоговорКонтрагента;

	ИначеЕсли ЭтоЗапросКоммерческогоПредложенияОтКлиента
		И ОбщегоНазначения.ПодсистемаСуществует(ЗапросКоммерческогоПредложенияОтКлиента) Тогда
		
		МодульДокумента = ОбщегоНазначения.ОбщийМодуль("Документы.ЗапросКоммерческогоПредложенияОтКлиента");
		МодульДокумента.ЗаполнитьПараметрыЭлектронногоДокумента(ИсточникДанныхСсылка, ПараметрыИсточника);

		Описание.ТипДокумента = ПараметрыИсточника.Тип;
		Описание.Направление  = ПараметрыИсточника.Направление;
		Описание.Организация  = ПараметрыИсточника.Организация;
		Описание.Контрагент   = ПараметрыИсточника.Контрагент;
		Описание.Договор      = ПараметрыИсточника.ДоговорКонтрагента;

	Иначе		
	
		ОбменСКонтрагентамиПереопределяемый.ЗаполнитьПараметрыЭДПоИсточнику(ИсточникДанных, ПараметрыИсточника);
		
		Описание.ТипДокумента = ТипСкорректированныйПоПрикладнымНастройкам(ПараметрыИсточника,
			ПараметрыИсточника.ФормированиеУниверсальногоДокумента);
		Описание.Направление  = ПараметрыИсточника.Направление;
		Описание.Организация  = ПараметрыИсточника.Организация;
		Описание.Контрагент   = ПараметрыИсточника.Контрагент;
		Описание.Договор      = ПараметрыИсточника.ДоговорКонтрагента;
		
		Если Не ЗначениеЗаполнено(ПараметрыИсточника.Тип) Тогда
			
			ПараметрыИсточника.Вставить("ПрикладнойТипДокумента");
			ПараметрыИсточника.Вставить("Входящий");
			ПараметрыИсточника.Вставить("Организация");
			ПараметрыИсточника.Вставить("Контрагент");
			ПараметрыИсточника.Вставить("ДоговорКонтрагента");
			ПараметрыИсточника.Вставить("Партнер");
			
			ОбменСКонтрагентамиПереопределяемый.ПриОпределенииПараметровПрикладногоЭлектронногоДокументаПоИсточнику(
				ИсточникДанных, ПараметрыИсточника);
			
			Если ЗначениеЗаполнено(ПараметрыИсточника.ПрикладнойТипДокумента) Тогда
				
				Описание.ТипДокумента           = Перечисления.ТипыДокументовЭДО.Прикладной;
				Описание.ПрикладнойТипДокумента = ПараметрыИсточника.ПрикладнойТипДокумента;
				
				Если ПараметрыИсточника.Входящий = Истина Тогда
					Описание.Направление = Перечисления.НаправленияЭДО.Входящий;
				Иначе
					Описание.Направление = Перечисления.НаправленияЭДО.Исходящий;
				КонецЕсли;
								
				Описание.Организация            = ПараметрыИсточника.Организация;
				Описание.Контрагент             = ПараметрыИсточника.Контрагент;
				Описание.Договор                = ПараметрыИсточника.ДоговорКонтрагента;
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции

Функция ОписанияОбъектовУчета(НаборОбъектовУчета) Экспорт
	
	ОписанияОбъектовУчета = Новый ТаблицаЗначений();
	
	Типы = Метаданные.ОпределяемыеТипы.ОснованияЭлектронныхДокументовЭДО.Тип.Типы();
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Типы, Метаданные.ОпределяемыеТипы.Организация.Тип.Типы());
	
	ОписанияОбъектовУчета.Колонки.Добавить("ОбъектУчета", Новый ОписаниеТипов(Типы));
	ОписанияОбъектовУчета.Колонки.Добавить("Направление", Новый ОписаниеТипов("ПеречислениеСсылка.НаправленияЭДО"));
	ОписанияОбъектовУчета.Колонки.Добавить("ТипДокумента", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыДокументовЭДО"));
	ОписанияОбъектовУчета.Колонки.Добавить("ПрикладнойТипДокумента", Метаданные.ОпределяемыеТипы.ПрикладныеТипыЭлектронныхДокументовЭДО.Тип);
	ОписанияОбъектовУчета.Колонки.Добавить("Организация", Метаданные.ОпределяемыеТипы.Организация.Тип);
	ОписанияОбъектовУчета.Колонки.Добавить("Контрагент", Метаданные.ОпределяемыеТипы.УчастникЭДО.Тип);
	ОписанияОбъектовУчета.Колонки.Добавить("ДоговорКонтрагента", Метаданные.ОпределяемыеТипы.ДоговорСКонтрагентомЭДО.Тип);
	
	Для Каждого ОбъектУчета Из НаборОбъектовУчета Цикл
		
		НовоеОписание = ОписанияОбъектовУчета.Добавить();
		ОписаниеОбъектаУчета = ОписаниеОбъектаУчета(ОбъектУчета);
		ЗаполнитьЗначенияСвойств(НовоеОписание, ОписаниеОбъектаУчета);
		НовоеОписание.ДоговорКонтрагента = ОписаниеОбъектаУчета.Договор;
	
	КонецЦикла;
	
	Возврат ОписанияОбъектовУчета;
	
КонецФункции

// См. ОбменСКонтрагентамиКлиент.ВариантыФормированияУниверсальныхДокументов
Функция ВариантыФормированияУниверсальныхДокументов() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Разрешено", "Разрешено");
	Результат.Вставить("Запрещено", "Запрещено");
	Результат.Вставить("Обязательно", "Обязательно");
	
	Возврат Результат;
	
КонецФункции

// Определяет необходимость вывода в интерфейсах настроек отправки электронных документов опций формирования первичных /
// корректировочных документов и счетов-фактур в составе единого документа (т.е. использования УПД / УКД).
// 
// Возвращаемое значение:
// 	Использовать - Булево - Выходной параметр. Необходимо присвоить Истина, в случае, если прикладное решение
// 	                        самостоятельно определяет для каждого экземпляра учетного документа необходимость формирования 
// 	                        универсальных документов (УПД / УКД) - см. ЗаполнитьПараметрыЭДПоИсточнику, либо не использует их.
//
Функция ИспользуютсяНастройкиФормированияУниверсальныхДокументов() Экспорт
	
	Результат = Истина;
	ОбменСКонтрагентамиПереопределяемый.ИспользованиеНастройкиФормированияУниверсальныхДокументов(Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область СостояниеЭДООбъектаУчета

Функция ПредставлениеСостоянияЭДООбъектаУчета(ОбъектУчета, Состояние = Неопределено) Экспорт
 
 	ОписаниеОбъектаУчета = ОписаниеОбъектаУчета(ОбъектУчета);
 	
 	Если ОписаниеОбъектаУчета.Направление = Перечисления.НаправленияЭДО.Внутренний Тогда
		ОписанияОбъектовУчета = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОписаниеОбъектаУчета);
		Возврат ПредставлениеСостоянияВнутреннегоДокументаОбъектаУчета(ОписанияОбъектовУчета);
	Иначе
		ПредставлениеПрогрессаПодписания = Неопределено;
		ПредставлениеСтатуса = Строка(Состояние);
		Если Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание Тогда
			ЭлектронныйДокумент = ОсновнойЭлектронныйДокументОбъектаУчета(ОбъектУчета);

			Если ЗначениеЗаполнено(ЭлектронныйДокумент) Тогда
				Результат = ЭлектронныеДокументыЭДО.ДанныеЭлементовСхемыРегламента(ЭлектронныйДокумент);
				ОсновнойДокумент = Результат.Найти(Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя, "ТипЭлементаРегламента");
				
				Если ЗначениеЗаполнено(ОсновнойДокумент) Тогда 
					УстановленныеПодписи = ЭлектроннаяПодпись.УстановленныеПодписи(ОсновнойДокумент.ПрисоединенныйФайл);
					ПредставлениеПрогрессаПодписания = МаршрутыПодписанияБЭД.ПредставлениеПрогрессаПодписания(
						ОсновнойДокумент.ПрисоединенныйФайл, УстановленныеПодписи.Количество());
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		Если ЗначениеЗаполнено(ПредставлениеПрогрессаПодписания) Тогда
			Возврат СтрШаблон("%1 %2", ПредставлениеСтатуса, ПредставлениеПрогрессаПодписания);
		Иначе
			Возврат ПредставлениеСтатуса;
		КонецЕсли;
 	КонецЕсли;
 	
КонецФункции

Функция ПредставлениеСостоянияВнутреннегоДокументаОбъектаУчета(ОписанияОбъектовУчета, ВидДокумента = Неопределено) Экспорт
	
	ДанныеОбъектовУчета = Новый ТаблицаЗначений;
	ДанныеОбъектовУчета.Колонки.Добавить("ОбъектУчета", Документы.ТипВсеСсылки());
	ДанныеОбъектовУчета.Колонки.Добавить("Организация", Метаданные.ОпределяемыеТипы.Организация.Тип);  
	ДанныеОбъектовУчета.Колонки.Добавить("ИдентификаторОбъектаУчета", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовМетаданных"));

	Для Каждого ОписаниеОбъектаУчета Из ОписанияОбъектовУчета Цикл 
		
		ДанныеОбъектаУчета = ДанныеОбъектовУчета.Добавить();		 
	
		ДанныеОбъектаУчета.ОбъектУчета = ОписаниеОбъектаУчета.ОбъектУчета;
		ДанныеОбъектаУчета.Организация = ОписаниеОбъектаУчета.Организация;
		ДанныеОбъектаУчета.ИдентификаторОбъектаУчета = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОписаниеОбъектаУчета.ОбъектУчета.Метаданные());

	КонецЦикла;
	
	ПриоритетыСостояний = Новый Массив;
	ПриоритетыСостояний.Добавить(НСтр("ru='Не начат'"));
	ПриоритетыСостояний.Добавить(НСтр("ru='В работе'"));
	ПриоритетыСостояний.Добавить(НСтр("ru='Завершен'"));
	
	Запрос = Новый Запрос;
	ТекстЗапросаДанныхОбъектовУчета = 
		"ВЫБРАТЬ
		|	ДанныеОбъектовУчета.ОбъектУчета КАК ОбъектУчета,
		|	ДанныеОбъектовУчета.Организация КАК Организация,
		|	ДанныеОбъектовУчета.ИдентификаторОбъектаУчета КАК ИдентификаторОбъектаУчета
		|ПОМЕСТИТЬ ДанныеОбъектовУчета
		|ИЗ
		|	&ДанныеОбъектовУчета КАК ДанныеОбъектовУчета";
		
	ОтборВидовДокументовВнутреннегоЭДО = ЭлектронныеДокументыЭДО.НовыйОтборВидовДокументов();
	ОтборВидовДокументовВнутреннегоЭДО.ТипДокумента = "ЗНАЧЕНИЕ(Перечисление.ТипыДокументовЭДО.Внутренний)";
	ОтборВидовДокументовВнутреннегоЭДО.ИдентификаторОбъектаУчета = "ВЫБРАТЬ ИдентификаторОбъектаУчета ИЗ ДанныеОбъектовУчета";

	ИмяТаблицыВидовДокументовВнутреннегоЭДО = "ВидыВнутреннегоЭДО";
	ТекстЗапросаВидовДокументовВнутреннегоЭДО = ЭлектронныеДокументыЭДО.ЗапросВидовДокументов(
		ИмяТаблицыВидовДокументовВнутреннегоЭДО, ОтборВидовДокументовВнутреннегоЭДО).Текст;

	ТекстЗапросаДанныхАктуальности = 
		"ВЫБРАТЬ
		|	ДанныеОбъектовУчета.ОбъектУчета КАК ОбъектУчета,
		|	ДанныеОбъектовУчета.Организация КАК Организация,
		|	ВидыДокументовЭДО.Ссылка КАК ВидДокумента,
		|	АктуальныеДокументыЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент
		|ПОМЕСТИТЬ ДанныеАктуальности
		|ИЗ
		|	ДанныеОбъектовУчета КАК ДанныеОбъектовУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыВнутреннегоЭДО КАК ВидыДокументовЭДО
		|		ПО ДанныеОбъектовУчета.ИдентификаторОбъектаУчета = ВидыДокументовЭДО.ИдентификаторОбъектаУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеДокументыЭДО КАК АктуальныеДокументыЭДО
		|		ПО ДанныеОбъектовУчета.ОбъектУчета = АктуальныеДокументыЭДО.ОбъектУчета
		|		И ВидыДокументовЭДО.Ссылка = АктуальныеДокументыЭДО.ВидЭлектронногоДокумента";
	
	ОтборНастроекОтправкиВнутреннегоЭДО = НастройкиЭДО.НовыйОтборНастроекВнутреннегоЭДО();
	ОтборНастроекОтправкиВнутреннегоЭДО.Организация = "ВЫБРАТЬ Организация ИЗ ДанныеАктуальности";
	ОтборНастроекОтправкиВнутреннегоЭДО.ВидДокумента = "ВЫБРАТЬ ВидДокумента ИЗ ДанныеАктуальности";
	
	ИмяТаблицыНастроекВнутреннегоЭДО = "НастройкиВнутреннегоЭДО";
	ТекстЗапросаНастроекВнутреннегоЭДО = НастройкиЭДО.ЗапросНастроекВнутреннегоЭДО(
		ИмяТаблицыНастроекВнутреннегоЭДО, ОтборНастроекОтправкиВнутреннегоЭДО).Текст;

	ИмяТаблицыСостоянийЭлектронныхДокументов = "СостоянияЭлектронныхДокументов";
	УсловиеВыбораСостоянийЭлектронныхДокументов = " ВЫБРАТЬ ДанныеАктуальности.ЭлектронныйДокумент ИЗ ДанныеАктуальности";

	ТекстСостоянийЭлектронныхДокументов = ЭлектронныеДокументыЭДО.ЗапросСостоянийДокументов(
		ИмяТаблицыСостоянийЭлектронныхДокументов, УсловиеВыбораСостоянийЭлектронныхДокументов).Текст;

	ТекстЗапросаИтоговыхДанных = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ДанныеАктуальности.ОбъектУчета) КАК КоличествоДокументов,
		|	ЕСТЬNULL(СостоянияЭДО.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.НеСформирован)) КАК СостояниеЭД,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СостоянияЭДО.Состояние,
		|			ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.НеСформирован)) = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.НеСформирован)
		|		ИЛИ ЕСТЬNULL(СостоянияЭДО.Состояние,
		|			ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.НеСформирован)) = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.ЗакрытПринудительно)
		|			ТОГДА 0
		|		КОГДА СостоянияЭДО.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.Аннулирован)
		|		ИЛИ СостоянияЭДО.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.ОбменЗавершен)
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ПриоритетСостояниеЭДО
		|ИЗ
		|	ДанныеАктуальности КАК ДанныеАктуальности
		|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиВнутреннегоЭДО КАК НастройкиВнутреннегоЭДО
		|		ПО ДанныеАктуальности.ВидДокумента = НастройкиВнутреннегоЭДО.ВидВнутреннегоДокумента
		|		И ДанныеАктуальности.Организация = НастройкиВнутреннегоЭДО.Организация
		|		ЛЕВОЕ СОЕДИНЕНИЕ СостоянияЭлектронныхДокументов КАК СостоянияЭДО
		|		ПО ДанныеАктуальности.ЭлектронныйДокумент = СостоянияЭДО.Ссылка
		|ГДЕ
		|	(ЕСТЬNULL(НастройкиВнутреннегоЭДО.Формировать, ЛОЖЬ)
		|	ИЛИ
		|	НЕ ДанныеАктуальности.ЭлектронныйДокумент ЕСТЬ NULL)
		|	И &УсловиеПоВиду
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СостоянияЭДО.Состояние,
		|			ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.НеСформирован)) = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.НеСформирован)
		|		ИЛИ ЕСТЬNULL(СостоянияЭДО.Состояние,
		|			ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.НеСформирован)) = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.ЗакрытПринудительно)
		|			ТОГДА 0
		|		КОГДА СостоянияЭДО.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.Аннулирован)
		|		ИЛИ СостоянияЭДО.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.ОбменЗавершен)
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ,
		|	ЕСТЬNULL(СостоянияЭДО.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.НеСформирован))
		|УПОРЯДОЧИТЬ ПО
		|	ПриоритетСостояниеЭДО";
	
	Запросы = Новый Массив;
	Запросы.Добавить(ТекстЗапросаДанныхОбъектовУчета);
	Запросы.Добавить(ТекстЗапросаВидовДокументовВнутреннегоЭДО);
	Запросы.Добавить(ТекстЗапросаДанныхАктуальности);
	Запросы.Добавить(ТекстЗапросаНастроекВнутреннегоЭДО);
	Запросы.Добавить(ТекстСостоянийЭлектронныхДокументов);
	Запросы.Добавить(ТекстЗапросаИтоговыхДанных);
	
	ИтоговыйЗапрос = СтрСоединить(Запросы, ОбщегоНазначения.РазделительПакетаЗапросов());
		
	Запрос.Текст = ИтоговыйЗапрос;
			
	УсловиеПоВиду = "ИСТИНА";	
	
	Если ЗначениеЗаполнено(ВидДокумента) Тогда
		УсловиеПоВиду = "ДанныеАктуальности.ВидДокумента = &ВидДокумента";
		Запрос.Параметры.Вставить("ВидДокумента", ВидДокумента);	
	КонецЕсли;	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоВиду", УсловиеПоВиду);
	
	Запрос.Параметры.Вставить("ДанныеОбъектовУчета", ДанныеОбъектовУчета);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ПредставлениеСтатуса = "";
	
	Если ЗначениеЗаполнено(РезультатЗапроса) Тогда 
		
		МинимальныйПриоритет = РезультатЗапроса[0].ПриоритетСостояниеЭДО;

		Если РезультатЗапроса.Количество() = 1 Тогда 
			
			ПредставлениеСтатуса = Строка(РезультатЗапроса[0].СостояниеЭД);
			Если РезультатЗапроса[0].КоличествоДокументов > 1 Тогда
				ШаблонКоличестваДокументов = "%1 (%2)";
				ПредставлениеСтатуса = СтрШаблон(ШаблонКоличестваДокументов, ПредставлениеСтатуса, РезультатЗапроса[0].КоличествоДокументов);  
			КонецЕсли;
			
		Иначе
			
			РезультатЗапроса.Свернуть("ПриоритетСостояниеЭДО","КоличествоДокументов");
			
			КоличествоДокументовВМинимальномСостоянии = РезультатЗапроса[0].КоличествоДокументов;
			
			Состояние = ПриоритетыСостояний[МинимальныйПриоритет]; 
			ВсегоВозможныхДокументов = РезультатЗапроса.Итог("КоличествоДокументов");
			
			Если РезультатЗапроса.Количество() = 1 Тогда
				Шаблон = "%1 (%2)";
				ПредставлениеСтатуса = СтрШаблон(Шаблон, Состояние, ВсегоВозможныхДокументов);  
			Иначе
				Шаблон = НСтр("ru = '%1 (%2/%3)'");
				ПредставлениеСтатуса = СтрШаблон(Шаблон, Состояние, КоличествоДокументовВМинимальномСостоянии, ВсегоВозможныхДокументов); 
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат ПредставлениеСтатуса;
	
КонецФункции

Функция СостояниеОбъектаУчетаУстановлено(ОбъектУчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СостоянияПоОбъектамУчетаЭДО.СсылкаНаОбъект
		|ИЗ
		|	РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияПоОбъектамУчетаЭДО
		|ГДЕ
		|	СостоянияПоОбъектамУчетаЭДО.СсылкаНаОбъект = &СсылкаНаОбъект";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ОбъектУчета);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область ОписаниеДанныхОбъектаУчета

Функция НовыеПараметрыФормированияДанныхОбъектаУчет() Экспорт
	Параметры = Новый Структура;
	Параметры.Вставить("Формат");
	Параметры.Вставить("ТипДокумента");
	Параметры.Вставить("Отправитель");
	Параметры.Вставить("ЗаполнениеКодаТовара");
	Параметры.Вставить("ВыгружатьДополнительныеСведения");
	Возврат Параметры;
КонецФункции

Функция ОписаниеДанныхОбъектаУчета(ОбъектУчета, Параметры, ДополнительныеДанные = Неопределено) Экспорт
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	
	ДанныеДО = ОбменСКонтрагентамиДО.ДанныеДокументаЭДОПоВерсииФайла(
		ОбъектУчета,
		Параметры,
		ДополнительныеДанные);
	
	Если ДанныеДО <> Неопределено Тогда
		Данные = Новый Структура;
		Данные.Вставить("ДеревоЭД", ДанныеДО.ДеревоЭД);
		Данные.Вставить("ДанныеДО", ДанныеДО);
		
		Результат.Данные = Данные;
		Результат.Основания.Добавить(ОбъектУчета);
		Результат.СвязанныеОбъектыУчета = ДанныеДО.СвязанныеОбъектыУчета;
		
		Возврат Результат;
	КонецЕсли;
	
	Формат = Параметры.Формат;
	Форматы = ЭлектронныеДокументыЭДО.ПоддерживаемыеФорматы();
	ТипыДокументов = ЭлектронныеДокументыЭДО.СтандартныеТипыДокументов();
	ТипДокумента = Параметры.ТипДокумента;
	
	Если Формат = Форматы.CML208 Тогда
		
		Если ТипДокумента = ТипыДокументов.КаталогТоваров Тогда
			
			Результат = КаталогТоваров_ДанныеУчета(ОбъектУчета, Параметры, ДополнительныеДанные);
			
		ИначеЕсли ТипДокумента = ТипыДокументов.ПрайсЛист Тогда
			
			Результат = ПрайсЛист_ДанныеУчета(ОбъектУчета, Параметры);
			
		ИначеЕсли ТипДокумента = ТипыДокументов.СчетНаОплату Тогда
			
			Результат = СчетНаОплату_ДанныеУчета(ОбъектУчета, Параметры);
			
		ИначеЕсли ТипДокумента = ТипыДокументов.ЗаказТовара Тогда
			
			Результат = ЗаказПоставщику_ДанныеУчета(ОбъектУчета, Параметры);
			
		ИначеЕсли ТипДокумента = ТипыДокументов.ОтветНаЗаказ Тогда
			
			Результат = ЗаказПокупателя_ДанныеУчета(ОбъектУчета, Параметры);
			
		ИначеЕсли ТипДокумента = ТипыДокументов.ОтчетОПродажахКомиссионногоТовара Тогда
			
			Результат = ОтчетОПродажах_ДанныеУчета(ОбъектУчета, Параметры);
			
		ИначеЕсли ТипДокумента = ТипыДокументов.ОтчетОСписанииКомиссионногоТовара Тогда
			
			Результат = ОтчетОСписании_ДанныеУчета(ОбъектУчета, Параметры);
			
		ИначеЕсли ТипДокумента = ТипыДокументов.РеквизитыОрганизации Тогда
			
			Результат = РеквизитыОрганизации_ДанныеУчета(ОбъектУчета, Параметры);
			
		Иначе
			
			СтрокаСообщенияИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Формат ""%1"" с типом докумета ""%2"" не поддерживается.'"), Формат, ТипДокумента);
			
			ВызватьИсключение СтрокаСообщенияИсключения;
		
		КонецЕсли;
		
	ИначеЕсли Формат = Форматы.CML402 Тогда
		
		Если ТипДокумента = ТипыДокументов.ПередачаТоваровМеждуОрганизациями Тогда
			
			Результат = ПередачаТовараМеждуОрганизациями_ДанныеУчета(ОбъектУчета, Параметры);
			
		ИначеЕсли ТипДокумента = ТипыДокументов.ВозвратТоваровМеждуОрганизациями Тогда
			
			Результат = ВозвратТовараМеждуОрганизациями_ДанныеУчета(ОбъектУчета, Параметры);
			
		Иначе
			
			СтрокаСообщенияИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Формат ""%1"" с типом докумета ""%2"" не поддерживается.'"), Формат, ТипДокумента);
			
			ВызватьИсключение СтрокаСообщенияИсключения;
			
		КонецЕсли;
		
	ИначеЕсли Формат = Форматы.ФНС.УПД.ИнформацияПродавца Или  Формат = Форматы.ФНС.УПД.ИнформацияПокупателя Тогда
		
		СтрокаСообщенияИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Формаирование документа в формате ""%1"" не поддерживается.'"), Формат);
			
		ВызватьИсключение СтрокаСообщенияИсключения;
		
	ИначеЕсли Формат = Форматы.ФНС.УПД2019.ИнформацияПродавца Тогда
		
		Результат = УПД2019_ИнформацияПродавца_ДанныеУчета(ОбъектУчета, Параметры);
		
	ИначеЕсли Формат = Форматы.ФНС.УПД2019.ИнформацияПокупателя Тогда
		
		Результат = УПД2019_ИнформацияПокупателя_ДанныеУчета(ОбъектУчета, Параметры);
		
	ИначеЕсли Формат = Форматы.ФНС.УКД.ИнформацияПродавца Тогда
		
		Результат = УКД_ИнформацияПродавца_ДанныеУчета(ОбъектУчета, Параметры);
		
	ИначеЕсли Формат = Форматы.ФНС.УКД.ИнформацияПокупателя Тогда
		
		Результат = УКД_ИнформацияПокупателя_ДанныеУчета(ОбъектУчета, Параметры);
		
	ИначеЕсли Формат = Форматы.ФНС.УКД2020.ИнформацияПродавца Тогда
		
		Результат = УКД2020_ИнформацияПродавца_ДанныеУчета(ОбъектУчета, Параметры);
		
	ИначеЕсли Формат = Форматы.ФНС.УКД2020.ИнформацияПокупателя Тогда
		
		Результат = УКД2020_ИнформацияПокупателя_ДанныеУчета(ОбъектУчета, Параметры);
		
	ИначеЕсли Формат = Форматы.ФНС.ПередачаТоваров.ИнформацияПродавца Тогда
		
		Результат = ПередачаТоваров_ИнформацияПродавца_ДанныеУчета(ОбъектУчета, Параметры);
		
	ИначеЕсли Формат = Форматы.ФНС.ПередачаТоваров.ИнформацияПокупателя Тогда
		
		Результат = ПередачаТоваров_ИнформацияПокупателя_ДанныеУчета(ОбъектУчета, Параметры);
		
	ИначеЕсли Формат = Форматы.ФНС.ПередачаРабот.ИнформацияПродавца Тогда
		
		Результат = ПередачаУслуг_ИнформацияПродавца_ДанныеУчета(ОбъектУчета, Параметры);
		
	ИначеЕсли Формат = Форматы.ФНС.ПередачаРабот.ИнформацияПокупателя Тогда
		
		Результат = ПередачаУслуг_ИнформацияПокупателя_ДанныеУчета(ОбъектУчета, Параметры);
		
	ИначеЕсли Формат = Форматы.ФНС.АктОРасхождениях.ИнформацияПокупателя Тогда
		
		Результат = АктОРасхождениях_ИнформацияПокупателя_ДанныеУчета(ОбъектУчета, Параметры);
	
	ИначеЕсли Формат = Форматы.БизнесСеть.КоммерческоеПредложение Тогда
		
		Результат = КоммерческоеПредложение_ДанныеУчета(ОбъектУчета, Параметры);
	
	ИначеЕсли Формат = Форматы.БизнесСеть.ЗапросКоммерческогоПредложения Тогда
		
		Результат = ЗапросКоммерческогоПредложения_ДанныеУчета(ОбъектУчета, Параметры);		
		
	Иначе
		
		СтрокаСообщенияИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Формат ""%1"" не поддерживается.'"), Формат);
			
		ВызватьИсключение СтрокаСообщенияИсключения;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат.СвязующийОбъектУчета) Тогда
		Результат.СвязующийОбъектУчета = ОбъектУчета;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ДанныеОбъектовУчета

// Возвращает значения реквизитов объекта с учетом изменения общепринятых названий.
// Для получения данных по реквизиту, он должен существовать у объекта или быть указано переименование в методе
// ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьСоответствиеНаименованийОбъектовМДИРеквизитов.
// В противном случае значение будет Неопределно.
//
// Параметры:
//  ОбъектУчета - см. ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//
Функция ЗначенияРеквизитовОбъектаУчета(Знач ОбъектУчета, Знач Реквизиты) Экспорт
	
	МетаданныеОбъектУчета = ОбъектУчета.Метаданные();
	ИмяОбъектУчета = МетаданныеОбъектУчета.Имя;
	
	ПрикладныеРеквизиты = Новый Структура;
	
	НаборРеквизитов = СтрРазделить(Реквизиты, ",");
	Для каждого Реквизит Из НаборРеквизитов Цикл
		
		РеквизитОбъектаУчета = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении(
			ИмяОбъектУчета + "." + Реквизит);
		
		Если ЗначениеЗаполнено(РеквизитОбъектаУчета) Тогда
			
			ПрикладныеРеквизиты.Вставить(Реквизит, РеквизитОбъектаУчета);
			
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта(Реквизит, МетаданныеОбъектУчета)
			ИЛИ ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеОбъектУчета.СтандартныеРеквизиты, Реквизит) Тогда
			
			ПрикладныеРеквизиты.Вставить(Реквизит);
			
		КонецЕсли;
	
	КонецЦикла;
	
	Значения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектУчета, ПрикладныеРеквизиты);
	
	Результат = Новый Структура(Реквизиты);
	ЗаполнитьЗначенияСвойств(Результат, Значения);
	
	Возврат Результат;
	
КонецФункции

// Возвращает признак того, является ли объект учета счетом-фактурой.
//
// Параметры:
//  ОбъектУчета - см. ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
//
// Возвращаемое значение:
//  Булево - признак того, является ли объект учета счетом-фактурой.
//
Функция ОбъектУчетаЯвляетсяСчетомФактурой(ОбъектУчета) Экспорт
	
	Результат = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ОпределитьДокументЯвляетсяСчетомФактурой(ОбъектУчета, Результат);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбъектыУчетаЭлектронныхДокументов

// Возвращает таблицу объектов учета электронных документов.
// 
// Параметры:
// ЭлектронныеДокументы - Массив Из ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//
// Возвращаемое значение:
//  ТаблицаЗначений - данные соответствия.
//   * ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - ссылка на объект учета.
//   * ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - актуальный ЭлектронныйДокумент.
//   * Актуальный - Булево - признак актуальности электронного документа.
//	 * СпособОбработки - Строка - способ обработки.
//
Функция ОбъектыУчетаЭлектронныхДокументов(Знач ЭлектронныеДокументы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаОбъектовУчетаЭлектронныхДокументов();
	Запрос.Параметры.Вставить("ЭлектронныйДокумент", ЭлектронныеДокументы);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает текст запроса для получения объектов учета, прикрепленных к электронным документам.
//
// Возвращаемое значение:
//  Строка - текст запроса с отбором по электронному документу.
//           Отбор выполняется по условию "В (&ЭлектронныйДокумент)".
//           Выбираемые поля: ЭлектронныйДокумент, ОбъектУчета, Актуальный, СпособОбработки.
//
Функция ТекстЗапросаОбъектовУчетаЭлектронныхДокументов(ПолучатьДокументыДО = Ложь) Экспорт
	
	Если ПолучатьДокументыДО Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент,
		|	ВЫБОР
		|		КОГДА ОбъектыУчетаДокументовЭДО.ОбъектУчета ССЫЛКА Справочник.ВерсииФайлов
		|			ТОГДА ВЫРАЗИТЬ(ОбъектыУчетаДокументовЭДО.ОбъектУчета КАК Справочник.ВерсииФайлов).Владелец.ВладелецФайла
		|		ИНАЧЕ ОбъектыУчетаДокументовЭДО.ОбъектУчета
		|	КОНЕЦ КАК ОбъектУчета,
		|	ОбъектыУчетаДокументовЭДО.СпособОбработки,
		|	ВЫБОР
		|		КОГДА АктуальныеДокументыЭДО.ЭлектронныйДокумент ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Актуальный
		|ИЗ
		|	РегистрСведений.ОбъектыУчетаДокументовЭДО КАК ОбъектыУчетаДокументовЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеДокументыЭДО КАК АктуальныеДокументыЭДО
		|		ПО ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент = АктуальныеДокументыЭДО.ЭлектронныйДокумент
		|		И ОбъектыУчетаДокументовЭДО.ОбъектУчета = АктуальныеДокументыЭДО.ОбъектУчета
		|ГДЕ
		|	ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент В (&ЭлектронныйДокумент)";
		
	Иначе
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент,
		|	ОбъектыУчетаДокументовЭДО.ОбъектУчета,
		|	ОбъектыУчетаДокументовЭДО.СпособОбработки,
		|	ВЫБОР
		|		КОГДА АктуальныеДокументыЭДО.ЭлектронныйДокумент ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Актуальный
		|ИЗ
		|	РегистрСведений.ОбъектыУчетаДокументовЭДО КАК ОбъектыУчетаДокументовЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеДокументыЭДО КАК АктуальныеДокументыЭДО
		|		ПО ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент = АктуальныеДокументыЭДО.ЭлектронныйДокумент
		|		И ОбъектыУчетаДокументовЭДО.ОбъектУчета = АктуальныеДокументыЭДО.ОбъектУчета
		|ГДЕ
		|	ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент В (&ЭлектронныйДокумент)";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает таблицу электронных документов по объектам учета.
// 
// Параметры:
//  ОбъектыУчета - Массив Из ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
//
// Возвращаемое значение:
//  ТаблицаЗначений - данные соответствия.
//   * ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - ссылка на объект учета.
//   * ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - актуальный ЭлектронныйДокумент.
//   * Актуальный - Булево - признак актуальности электронного документа.
//
Функция ЭлектронныеДокументыОбъектовУчета(Знач ОбъектыУчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаЭлектронныхДокументовОбъектовУчета();
	Запрос.Параметры.Вставить("ОбъектУчета", ОбъектыУчета);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает текст запроса для получения электронных документов, прикрепленных к объектам учета.
//
// Возвращаемое значение:
//  Строка - текст запроса с отбором по объекту учета.
//           Отбор выполняется по условию "В (&ОбъектУчета)".
//           Выбираемые поля: ЭлектронныйДокумент, ОбъектУчета, Актуальный.
//
Функция ТекстЗапросаЭлектронныхДокументовОбъектовУчета() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент,
	|	ОбъектыУчетаДокументовЭДО.ОбъектУчета,
	|	ВЫБОР
	|		КОГДА АктуальныеДокументыЭДО.ЭлектронныйДокумент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Актуальный
	|ИЗ
	|	РегистрСведений.ОбъектыУчетаДокументовЭДО КАК ОбъектыУчетаДокументовЭДО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеДокументыЭДО КАК АктуальныеДокументыЭДО
	|		ПО ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент = АктуальныеДокументыЭДО.ЭлектронныйДокумент
	|		И ОбъектыУчетаДокументовЭДО.ОбъектУчета = АктуальныеДокументыЭДО.ОбъектУчета
	|ГДЕ
	|	ОбъектыУчетаДокументовЭДО.ОбъектУчета В (&ОбъектУчета)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ОбъектыУчетаНаКонтролеПроведения(Знач ЭлектронныеДокументы) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КонтрольПроведения.УчетныйДокумент
		|ИЗ
		|	РегистрСведений.КонтрольПроведенияУчетныхДокументовЭДО КАК КонтрольПроведения
		|ГДЕ
		|	КонтрольПроведения.ЭлектронныйДокумент В (&НаборЭлектронныхДокументов)";
	Запрос.УстановитьПараметр("НаборЭлектронныхДокументов", ЭлектронныеДокументы);

	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("УчетныйДокумент");
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Результат;

КонецФункции

// Выполняется перед отражением в учете электронного документа,
// содержащего данные для сопоставления номенклатуры.
// Проверяет возможность отражения в учете документа с не сопоставленной номенклатурой,
// а также добавляет информацию о имеющемся сопоставлении.
// 
// Параметры:
//  ПараметрыОтражения - Структура - данные для подготовки к отражению в учете:
//   * ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - отражаемый в учете электронный документ.
//   * Контрагент - ОпределяемыйТип.КонтрагентБЭД - контрагент документа.
//   * СпособОбработки - Строка - выбранный способ отражения в учете.
//   * ДеревоДокумента - ДеревоЗначений - дерево документа, по данным которого будет выполняться отражение в учете (изменяемый параметр).
//  Отказ - Булево - признак наличия ошибок при подготовке к отражению в учете (выходной параметр).
//  ОписаниеОшибки - Строка - описание ошибки, возникшей при подготовке к отражению в учете (выходной параметр).
//
Процедура ПриОтраженииВУчетеЭлектронногоДокументаСНоменклатурой(ПараметрыОтражения, Отказ = Ложь, ОписаниеОшибки = "") Экспорт
	
	Документ = Новый Структура("СпособОбработки", ПараметрыОтражения.СпособОбработки);
	Настройки = Новый Структура("ОтражатьТолькоСопоставленные", Истина);
	СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриОтраженииВУчетеЭлектронногоДокументаСНоменклатурой(Документ, Настройки);
	Если Настройки.ОтражатьТолькоСопоставленные Тогда
		ОтборПоДокументу = Новый Структура("ЭлектронныйДокумент", ПараметрыОтражения.ЭлектронныйДокумент);
		НаКонтроле = НоменклатураКонтрагентовНаКонтроле(ОтборПоДокументу);
		Если ЗначениеЗаполнено(НаКонтроле) Тогда
			Отказ = Истина;
			ОписаниеОшибки = НСтр("ru = 'Для отражения в учете необходимо сопоставить номенклатуру.'");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Если ПараметрыОтражения.ДеревоДокумента.ЗначениеРеквизита = Неопределено Тогда
		ДеревоЭлектронногоДокументаБЭД.ЗаполнитьНоменклатуруИБВСтрокахДереваДокумента(
			ПараметрыОтражения, ПараметрыОтражения.ДеревоДокумента);
	Иначе
		ДеревоЭлектронногоДокументаБЭД.ЗаполнитьНоменклатуруИБВДеревеДокумента(
			ПараметрыОтражения.Контрагент, ПараметрыОтражения.ДеревоДокумента.ЗначениеРеквизита);
	КонецЕсли;
	
КонецПроцедуры

Функция НовыйОтборАктуальныхЭлектронныхДокументов() Экспорт
	
	Отбор = Новый Структура;	
	Отбор.Вставить("ОбъектыУчета", "");
	
	Возврат Отбор;
	
КонецФункции

Функция ЗапросАктуальныхЭлектронныхДокументов(ИмяВременнойТаблицы, Отбор = Неопределено) Экспорт
	
	Если Отбор = Неопределено Тогда
		Отбор = НовыйОтборАктуальныхЭлектронныхДокументов();
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	АктуальныеДокументыЭДО.ОбъектУчета КАК ОбъектУчета,
	|	АктуальныеДокументыЭДО.ВидЭлектронногоДокумента КАК ВидДокумента,
	|	АктуальныеДокументыЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент
	|ПОМЕСТИТЬ ИмяВременнойТаблицы
	|ИЗ
	|	РегистрСведений.АктуальныеДокументыЭДО КАК АктуальныеДокументыЭДО
	|ГДЕ
	|	&ПоляУсловия";
	
	ПоляУсловия = Новый Массив;
	Если ЗначениеЗаполнено(Отбор.ОбъектыУчета) Тогда
		ПоляУсловия.Добавить(СтрШаблон("АктуальныеДокументыЭДО.ОбъектУчета В (%1)", Отбор.ОбъектыУчета));
	КонецЕсли;
	
	ТекстЗапроса = ОбщегоНазначенияБЭД.ТекстЗапросаИзШаблона(ТекстЗапроса, ИмяВременнойТаблицы,
		"", ПоляУсловия);
	ОписаниеЗапроса = ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса();
	ОписаниеЗапроса.Текст = ТекстЗапроса;
	
	Возврат ОписаниеЗапроса;
	
КонецФункции

Функция НовыйОтборОбъектовУчетаЭлектронныхДокументов() Экспорт
	
	Отбор = Новый Структура;	
	Отбор.Вставить("ЭлектронныеДокументы", "");
	
	Возврат Отбор;
	
КонецФункции

Функция ЗапросОбъектовУчетаЭлектронныхДокументов(ИмяВременнойТаблицы, Отбор = Неопределено) Экспорт
	
	Если Отбор = Неопределено Тогда
		Отбор = НовыйОтборОбъектовУчетаЭлектронныхДокументов();
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОбъектыУчетаДокументовЭДО.ОбъектУчета КАК ОбъектУчета,
	|	ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
	|	ПРЕДСТАВЛЕНИЕ(ОбъектыУчетаДокументовЭДО.ОбъектУчета) КАК ПредставлениеОбъектаУчета
	|ПОМЕСТИТЬ ИмяВременнойТаблицы
	|ИЗ
	|	РегистрСведений.ОбъектыУчетаДокументовЭДО КАК ОбъектыУчетаДокументовЭДО
	|ГДЕ
	|	&ПоляУсловия";
	
	ПоляУсловия = Новый Массив;
	Если ЗначениеЗаполнено(Отбор.ЭлектронныеДокументы) Тогда
		ПоляУсловия.Добавить(СтрШаблон("ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент В (%1)", Отбор.ЭлектронныеДокументы));
	КонецЕсли;
	
	ТекстЗапроса = ОбщегоНазначенияБЭД.ТекстЗапросаИзШаблона(ТекстЗапроса, ИмяВременнойТаблицы,
		"", ПоляУсловия);
	ОписаниеЗапроса = ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса();
	ОписаниеЗапроса.Текст = ТекстЗапроса;
	
	Возврат ОписаниеЗапроса;
	
КонецФункции

Процедура ОтменитьФормированиеДокументовПоОбъектамУчета(ОбъектыУчета, Комментарий) Экспорт

	НачатьТранзакцию();
		Попытка
			Для Каждого СсылкаНаОбъект Из ОбъектыУчета Цикл
				ОтборПоСсылкеНаОбъект = Новый Структура("СсылкаНаОбъект", СсылкаНаОбъект);
				ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировку("РегистрСведений.СостоянияПоОбъектамУчетаЭДО", ОтборПоСсылкеНаОбъект);
			КонецЦикла;
						
			Для Каждого СсылкаНаОбъект Из ОбъектыУчета Цикл
				ЗаписьРегистра = РегистрыСведений.СостоянияПоОбъектамУчетаЭДО.СоздатьМенеджерЗаписи();
				ЗаписьРегистра.СсылкаНаОбъект = СсылкаНаОбъект;
				ЗаписьРегистра.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ЗакрытПринудительно;
				ЗаписьРегистра.Комментарий = Комментарий;
				ЗаписьРегистра.Записать();
			КонецЦикла;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСКонтрагентами

Функция КонтрагентПодключенКСервису1СЭДО(Контрагент) Экспорт
	
	Подключен = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостоянияКонтрагентовБЭД.Состояние
	|ИЗ
	|	РегистрСведений.СостоянияКонтрагентовБЭД КАК СостоянияКонтрагентовБЭД
	|ГДЕ
	|	СостоянияКонтрагентовБЭД.Контрагент = &Контрагент
	|	И СостоянияКонтрагентовБЭД.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияКонтрагентаБЭД.НеПодключен)";

	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	УстановитьПривилегированныйРежим(Истина);
	Подключен = Запрос.Выполнить().Пустой();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Подключен;
	
КонецФункции

// Возвращает пустую структуру отбора для передачи в ИнтеграцияЭДО.ЗапросКонтрагентов
//
// Возвращаемое значение:
// 	Структура:
//	 ИНН - Строка - имя параметра ИНН контрагента.
//	 БезПустыхИНН - Булево - признак исключения контрагентов с пустым ИНН.
//
Функция НовыйОтборКонтрагетов() Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИНН", "");
	Отбор.Вставить("БезПустыхИНН", Ложь);
	
	Возврат Отбор;
	
КонецФункции

// Возвращает значения реквизитов контрагентов.
// Содержит следующие поля:
// * Ссылка - ОпределяемыйТип.КонтрагентыБЭД - ссылка на контрагента.
// * ИНН - Строка - ИНН контрагента.
// * КПП - Строка - КПП контрагента.
// * Наименование - Строка - наименование контрагента а прикладном решении.
// * ВнешнийКод - Строка - внешний код контрагента в прикладном решении. 
// * НаименованиеДляСообщенияПользователю - Строка - наименование контрагента а прикладном решении используемое
// 	 для вывода сообщений пользователю. 
// 
// Параметры:
// 	ИмяВременнойТаблицы - Строка - имя временной таблицы, в которую помешается результат запроса.
// 	ИмяПараметраСсылка - Строка - имя параметра в который в дальшейшем передается массив ссылок на контрагентов
// 	Отбор - Структура - См. НовыйОтборКонтрагетов.
// 	
// Возвращаемое значение:
// 	См. ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса
//
Функция ЗапросКонтрагентов(ИмяВременнойТаблицы, ИмяПараметраСсылка, Отбор = Неопределено) Экспорт
	
	Если Отбор = Неопределено Тогда
		Отбор = НовыйОтборКонтрагетов();
	КонецЕсли;
		
	ИмяРеквизитаИННКонтрагента = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("ИННКонтрагента");
	ИмяРеквизитаКППКонтрагента = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("КППКонтрагента");
	ИмяРеквизитаНаименованиеКонтрагента = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("НаименованиеКонтрагента");
	ИмяРеквизитаВнешнийКодКонтрагента = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("ВнешнийКодКонтрагента");
	ИмяРеквизитаНаименованиеКонтрагентаДляСообщенияПользователю = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("НаименованиеКонтрагентаДляСообщенияПользователю");
	
	ПолеИНН = ИмяРеквизитаИННКонтрагента + " КАК ИНН";
	ПолеКПП = ИмяРеквизитаКППКонтрагента + " КАК КПП";
	ПолеНаименование = ИмяРеквизитаНаименованиеКонтрагента + " КАК Наименование";
	ПолеВнешнийКод = ИмяРеквизитаВнешнийКодКонтрагента + " КАК ВнешнийКод";
	ПолеНаименованиеДляСообщенияПользователю = ИмяРеквизитаНаименованиеКонтрагентаДляСообщенияПользователю
		+ " КАК НаименованиеДляСообщенияПользователю";
	
	Реквизиты = СтрШаблон("%1,%2,%3,%4,%5",
		ПолеИНН,
		ПолеКПП,
		ПолеНаименование,
		ПолеВнешнийКод,
		ПолеНаименованиеДляСообщенияПользователю);
	
	ОписаниеЗапроса = ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса();
	ТекстЗапросаКонтрагентов = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Ссылка КАК Ссылка,
		|	&Реквизиты
		|ПОМЕСТИТЬ ИмяВременнойТаблицы
		|ИЗ
		|	&ИмяСправочникаКонтрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка В (&МассивКонтрагентов)
		| И &ПоляУсловия";
	
	ПоляУсловия = Новый Массив;
	
	Если ЗначениеЗаполнено(Отбор.ИНН) Тогда
		ПоляУсловия.Добавить(СтрШаблон("Контрагенты.ИНН В (%1)", Отбор.ИНН));
	КонецЕсли;
	
	Если Отбор.БезПустыхИНН Тогда
		ПоляУсловия.Добавить("Контрагенты.ИНН <> """"");
	КонецЕсли;
	
	ТекстПоляУсловия = ОбщегоНазначенияБЭДСлужебный.ТекстПолейДляЗапроса(ПоляУсловия, "Контрагенты", Истина);
	Если ТекстПоляУсловия = "" Тогда
		ТекстПоляУсловия = "ИСТИНА";
	КонецЕсли;
	
	ИмяТаблицы = "Справочник." + ИмяПрикладногоСправочника("Контрагенты");
	ТекстЗапросаКонтрагентов = СтрЗаменить(ТекстЗапросаКонтрагентов, "&Реквизиты", Реквизиты);
	ТекстЗапросаКонтрагентов = СтрЗаменить(ТекстЗапросаКонтрагентов, "&ИмяСправочникаКонтрагенты", ИмяТаблицы);
	ТекстЗапросаКонтрагентов = СтрЗаменить(ТекстЗапросаКонтрагентов, "&МассивКонтрагентов", "&" + ИмяПараметраСсылка);
	ТекстЗапросаКонтрагентов = СтрЗаменить(ТекстЗапросаКонтрагентов, "&ПоляУсловия", ТекстПоляУсловия);
	
	ОписаниеЗапроса.Текст = СтрЗаменить(ТекстЗапросаКонтрагентов, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	
	Возврат ОписаниеЗапроса;
	
КонецФункции

// Получает адрес электронной почты контрагента.
//
// Параметры:
//  Контрагент - СправочникСсылка - ссылка на элемент справочника контрагенты, адрес которого надо получить.
//  АдресЭлектроннойПочты - Строка - адрес электронной почты.
//
Процедура АдресЭлектроннойПочтыКонтрагента(Контрагент, АдресЭлектроннойПочты) Экспорт
	
	ОбменСКонтрагентамиПереопределяемый.АдресЭлектроннойПочтыКонтрагента(Контрагент, АдресЭлектроннойПочты);
		
КонецПроцедуры

Функция ИспользуетсяДополнительнаяАналитикаКонтрагентовСправочникПартнеры() Экспорт
	
	Возврат ИнтеграцияЭДОПовтИсп.ИспользуетсяДополнительнаяАналитикаКонтрагентовСправочникПартнеры();
	
КонецФункции

// Создает нового контрагента по переданным реквизитам
//
// Параметры:
//   РеквизитыКонтрагента - Структура - реквизиты контрагента для создания
//     * ИНН          - Строка - ИНН контрагента
//     * КПП          - Строка - КПП контрагента
//     * Наименование - Строка - Наименование контрагента
//
//  Возвращаемое значение:
//     СправочникСсылка.Контрагенты, Неопределено - Созданный контрагент, неопределено в случае возникновения ошибки
//
Функция СоздатьКонтрагента(РеквизитыКонтрагента) Экспорт
	
	Отказ = Ложь;
	Контрагент = Неопределено;
	
	ОбменСКонтрагентамиПереопределяемый.СоздатьКонтрагентаПоРеквизитам(РеквизитыКонтрагента, Контрагент, Отказ);
	
	Если Отказ Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось создать контрагента'"));
	КонецЕсли;
	
	Возврат Контрагент;
	
КонецФункции

#КонецОбласти

#Область РаботаСТипамиДокументов

Процедура ДобавитьАктуальныйТипДокумента(АктуальныеТипыДокументов, ТипДокумента, ИспользоватьДляВходящих = Истина, ИспользоватьДляИсходящих = Истина) Экспорт
	
	Если Не ИспользоватьДляВходящих И Не ИспользоватьДляИсходящих Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваТипаДокумента = НовыеСвойстваАктуальногоТипаДокумента();
	СвойстваТипаДокумента.ИспользоватьДляВходящих = ИспользоватьДляВходящих;
	СвойстваТипаДокумента.ИспользоватьДляИсходящих = ИспользоватьДляИсходящих;
	
	АктуальныеТипыДокументов.Вставить(ТипДокумента, СвойстваТипаДокумента);
	
КонецПроцедуры

// Возвращает представление документа ИБ для вида электронного документа.
//
// Параметры:
//  ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - вид электронного документа.
//
// Возвращаемое значение:
//  ПредставлениеОснования - строковое имя документа информационной базы, на основании которого формируется исходящий ЭД.
//
Функция ПредставленияОснованийПоТипамДокументов() Экспорт
	
	ПредставленияОснованийПоТипам = Новый Соответствие;
	ОбменСКонтрагентамиПереопределяемый.СоответствиеИсходящихТиповЭлектронныхДокументовДокументамИБ(
		ПредставленияОснованийПоТипам);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.КоммерческиеПредложения") Тогда
		ПредставленияОснованийКоммерчискихПредложений = Новый Соответствие;
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("КоммерческиеПредложенияСлужебный");
		МодульПодсистемы.ПредставлениеИсходящихВидовЭлектронныхДокументов(ПредставленияОснованийКоммерчискихПредложений);
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(ПредставленияОснованийПоТипам,
			ПредставленияОснованийКоммерчискихПредложений, Ложь);
	КонецЕсли;
	
	ПредставленияОснованийПрикладныхТипов = Новый Соответствие;
	ОбменСКонтрагентамиПереопределяемый.ПриОпределенииСоответствияИсходящихПрикладныхТиповДокументамУчета(
		ПредставленияОснованийПрикладныхТипов);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(ПредставленияОснованийПоТипам,
		ПредставленияОснованийПрикладныхТипов, Ложь);
	
	ПредставленияОснованийТиповПроизвольныхФорматов = Новый Соответствие;
	Для Каждого ТипДокумента Из ЭлектронныеДокументыЭДО.ТипыДокументовПроизвольногоФормата() Цикл
		ПредставленияОснованийТиповПроизвольныхФорматов.Вставить(ТипДокумента,
			ПредставлениеОснованияБезОбъектаУчета(ТипДокумента));
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(ПредставленияОснованийПоТипам,
		ПредставленияОснованийТиповПроизвольныхФорматов, Ложь);
	
	Возврат ПредставленияОснованийПоТипам;
	
КонецФункции

Функция ИспользуемыеТипыДокументов() Экспорт
	
	АктуальныеТипыДокументов = Новый Соответствие; 
	ОбменСКонтрагентамиПереопределяемый.ПриОпределенииИспользуемыхТиповЭлектронныхДокументов(АктуальныеТипыДокументов);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.КоммерческиеПредложения") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("КоммерческиеПредложенияСлужебный");
		МодульПодсистемы.ИспользуемыеВидыЭлектронныхДокументов(АктуальныеТипыДокументов);
	КонецЕсли;
	
	Возврат АктуальныеТипыДокументов;
	
КонецФункции

// Формирует список способов отражения в учете входящего электронного документа определенного вида.
//
// Параметры:
//  ТипДокумента - ПеречислениеСсылка.ТипыДокументовЭДО - тип электронного документа
//               - ОпределяемыйТип.ПрикладныеТипыЭлектронныхДокументовЭДО - прикладной тип электронного документа
//  ДобавлятьПредопределенныеСпособы - Булево - признак добавления способов "Вручную" и "Автоматически"
// (последний - если в переопределяемом модуле не указаны способы отражения для вида ЭД)
//  Префикс	 - Строка - текст, который будет добавлен к представлению способа обработки.
// 
// Возвращаемое значение:
//  СписокЗначений - список способов обработки с указанием представления и отметки в списке используемого по-умолчанию способа.
//
Функция СписокОперацийТипаДокумента(ТипДокумента, ДобавлятьПредопределенныеСпособы = Ложь, Префикс = "") Экспорт 
	
	СписокОпераций = Новый СписокЗначений;
	
	Если ТипЗнч(ТипДокумента) = Тип("ПеречислениеСсылка.ТипыДокументовЭДО") Тогда
		
		Если ТипДокумента = Перечисления.ТипыДокументовЭДО.ЗапросКоммерческихПредложений Или ТипДокумента
			= Перечисления.ТипыДокументовЭДО.КоммерческоеПредложение И ОбщегоНазначения.ПодсистемаСуществует(
			"ЭлектронноеВзаимодействие.КоммерческиеПредложения") Тогда
			МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("КоммерческиеПредложенияСлужебный");
			МодульПодсистемы.ОпределитьСписокОперацийВходящихЭлектронныхДокументов(ТипДокумента, СписокОпераций);
		КонецЕсли;

		ОбменСКонтрагентамиПереопределяемый.СпособыОтраженияВУчетеТипаЭлектронногоДокумента(ТипДокумента, СписокОпераций);			
		
	Иначе // передан прикладной тип документа
		ОбменСКонтрагентамиПереопределяемый.ПриОпределенииСпособовОбработкиПрикладногоТипаЭлектронногоДокумента(
				ТипДокумента, СписокОпераций);
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из СписокОпераций Цикл
		ЭлементСписка.Представление = Префикс + " " + ЭлементСписка.Представление;
	КонецЦикла;
	
	Если ДобавлятьПредопределенныеСпособы Тогда
		Если СписокОпераций.Количество() = 0 Тогда
			СписокОпераций.Добавить("Автоматически", НСтр("ru = 'Автоматически'"),Истина);
		КонецЕсли;
		
		СписокОпераций.Добавить(СпособОбработки_Вручную(), НСтр("ru = 'Вручную в форме электронного документа'"));
		СписокОпераций.Добавить(СпособОбработки_НеОтражать(), НСтр("ru = 'Не отражать'"));
	
	КонецЕсли;
	
	Возврат СписокОпераций;
	
КонецФункции

Функция СписокОперацийВсехТиповДокумента() Экспорт 
	
	СписокОпераций = Новый СписокЗначений;
	
	Основания = Метаданные.ОпределяемыеТипы.ОснованияЭлектронныхДокументовЭДО.Тип.Типы();
	Для Каждого ТекущееОснование Из Основания Цикл
			
		МетаданныеОснования = Метаданные.НайтиПоТипу(ТекущееОснование);
		Если Не ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(МетаданныеОснования) Тогда
			Продолжить;
		КонецЕсли;
			
		СписокОпераций.Добавить(МетаданныеОснования.Имя, МетаданныеОснования.Синоним);
	КонецЦикла;
	
	Возврат СписокОпераций;
	
КонецФункции

Функция ТипДокументаИспользуетсяПоНаправлению(Тип, Направление) Экспорт
	
	ИмяСвойства = ?(Направление = Перечисления.НаправленияЭДО.Входящий, "ИспользоватьДляВходящих",
		"ИспользоватьДляИсходящих");
	
	АктуальныеВиды = ИспользуемыеТипыДокументов();
	
	СвойстваВида = АктуальныеВиды.Получить(Тип);
	Возврат СвойстваВида <> Неопределено И СвойстваВида[ИмяСвойства];
	
КонецФункции

// Получает данные об учетных документах, соответствующих переданному типу электронного документа.
// 
// Параметры:
// 	ТипЭлектронногоДокумента - Перечисления.ТипыДокументовЭДО - тип электронного документа
// 	                         - ОпределяемыйТип.ПрикладныеТипыЭлектронныхДокументовЭДО - прикладной тип электронного документа.
// Возвращаемое значение:
// 	СписокЗначений - список, в котором ключ - пустая ссылка на учетный документ, а представление - его представление.
Функция ТипыОбъектовУчетаПоТипуЭлектронногоДокумента(ТипЭлектронногоДокумента) Экспорт
	
	Результат = Новый СписокЗначений;
	
	Если ТипЗнч(ТипЭлектронногоДокумента) = Тип("ПеречислениеСсылка.ТипыДокументовЭДО") Тогда
		СписокТипов = Новый СписокЗначений;
		Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.КоммерческиеПредложения") Тогда
			МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("КоммерческиеПредложенияСлужебный");
			СписокТипов = МодульПодсистемы.СписокТиповДокументовПоТипуЭлектронногоДокумента(ТипЭлектронногоДокумента);
		КонецЕсли;	
		ОбщегоНазначенияБЭДКлиентСервер.ДополнитьСписокЗначений(Результат, СписокТипов);
		
		СписокТипов = Новый СписокЗначений;
		ОбменСКонтрагентамиПереопределяемый.СписокТиповДокументовПоТипуЭлектронногоДокумента(ТипЭлектронногоДокумента, СписокТипов);
		ОбщегоНазначенияБЭДКлиентСервер.ДополнитьСписокЗначений(Результат, СписокТипов);
	Иначе // передан прикладной тип электронного документа
		СписокТипов = Новый СписокЗначений;
		ОбменСКонтрагентамиПереопределяемый.ПриОпределенииТиповУчетныхДокументовПоПрикладномуТипуЭлектронногоДокумента(
			ТипЭлектронногоДокумента, СписокТипов);
		ОбщегоНазначенияБЭДКлиентСервер.ДополнитьСписокЗначений(Результат, СписокТипов);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПрикладныеТипыЭлектронныхДокументов() Экспорт
	
	ТипыЭлектронныхДокументов = Новый Массив;
	ОбменСКонтрагентамиПереопределяемый.ПриОпределенииПрикладныхТиповЭлектронныхДокументов(ТипыЭлектронныхДокументов);
	
	Возврат ТипыЭлектронныхДокументов;
	
КонецФункции

#КонецОбласти

#Область РаботаСОрганизациями

// Возвращает признак использования нескольких организаций.
//
// Возвращаемое значение:
//  Булево - Истина, если используется несколько организаций, иначе Ложь.
//
Функция ИспользуетсяНесколькоОрганизаций() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизацийБЭД");
	
КонецФункции

// Возвращает организацию по умолчанию.
// 
// Возвращаемое значение:
//  Неопределено - не удалось определить организацию.
//  ОпределяемыеТипы.Организация - организация для автоматической подстановки.
//
Функция ОрганизацияПоУмолчанию() Экспорт
	
	Возврат ОбщегоНазначенияБЭД.ОрганизацияПоУмолчанию();
	
КонецФункции

Функция НовыйОтборОрганизаций() Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИНН", "");
	Отбор.Вставить("КПП", "");
	
	Возврат Отбор;
	
КонецФункции

// Возвращает доступные для пользователя организации.
// Содержит следующие поля:
// * Ссылка - ОпределяемыйТип.Организация - ссылка на организацию.
// 
// Параметры:
// 	ИмяВременнойТаблицы - Строка - имя временнной таблицы.
// 	Отбор - См. НовыйОтборОрганизаций - параметры отбора.
// 	
// Возвращаемое значение:
// 	См. ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса
//
Функция ЗапросДоступныхОрганизаций(ИмяВременнойТаблицы, Отбор = Неопределено) Экспорт
	
	Если Отбор = Неопределено Тогда
		Отбор = НовыйОтборОрганизаций();
	КонецЕсли;
		
	ОписаниеЗапроса = ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ИмяВременнойТаблицы
	|ИЗ
	|	&СправочникОрганизации КАК Организации
	|ГДЕ
	|&ПоляУсловия";
	
	ПоляУсловия = Новый Массив;
	Если ЗначениеЗаполнено(Отбор.ИНН) Тогда
		ПоляУсловия.Добавить(СтрШаблон("Организации.ИНН = %1", Отбор.ИНН));
	КонецЕсли;
	Если ЗначениеЗаполнено(Отбор.КПП) Тогда
		ПоляУсловия.Добавить(СтрШаблон("Организации.КПП = %1", Отбор.КПП));
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СправочникОрганизации",
		"Справочник." + ИмяПрикладногоСправочника("Организации"));
	
	ОписаниеЗапроса.Текст = ОбщегоНазначенияБЭД.ТекстЗапросаИзШаблона(ТекстЗапроса, ИмяВременнойТаблицы, "", ПоляУсловия,
		"Организации");
		
	Возврат ОписаниеЗапроса;
	
КонецФункции
		
Функция РегистрационныеДанныеОрганизации(Организация) Экспорт
	
	ДанныеОрганизации = Новый Структура;
	ДанныеОрганизации.Вставить("Индекс", "");
	ДанныеОрганизации.Вставить("КодРегиона", "");
	ДанныеОрганизации.Вставить("Регион", "");
	ДанныеОрганизации.Вставить("Район", "");
	ДанныеОрганизации.Вставить("Город", "");
	ДанныеОрганизации.Вставить("НаселенныйПункт", "");
	ДанныеОрганизации.Вставить("Улица", "");
	ДанныеОрганизации.Вставить("Дом", "");
	ДанныеОрганизации.Вставить("Корпус", "");
	ДанныеОрганизации.Вставить("Квартира", "");
	ДанныеОрганизации.Вставить("Телефон", "");
	ДанныеОрганизации.Вставить("Наименование", "");
	ДанныеОрганизации.Вставить("ИНН", "");
	ДанныеОрганизации.Вставить("КПП", "");
	ДанныеОрганизации.Вставить("ОГРН", "");
	ДанныеОрганизации.Вставить("КодИМНС", "");
	ДанныеОрганизации.Вставить("ЮрФизЛицо", "");
	ДанныеОрганизации.Вставить("Фамилия", "");
	ДанныеОрганизации.Вставить("Имя", "");
	ДанныеОрганизации.Вставить("Отчество", "");
	ДанныеОрганизации.Вставить("Должность", "");	
	
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьРегистрационныеДанныеОрганизации(Организация, ДанныеОрганизации);
	
	Возврат ДанныеОрганизации;
	
КонецФункции

// См. ОбменСКонтрагентамиПереопределяемый.ПолучитьРеквизитыОрганизацииДляВыгрузкиВФайл
//
Процедура ПолучитьРеквизитыОрганизацииДляВыгрузкиВФайл(Организация, СтруктураДанных) Экспорт
	
	ОбменСКонтрагентамиПереопределяемый.ПолучитьРеквизитыОрганизацииДляВыгрузкиВФайл(Организация, СтруктураДанных);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПолучитьБанковскиеСчета
//
Процедура ПолучитьБанковскиеСчета(Организация, Таблица) Экспорт
	
	ОбменСКонтрагентамиПереопределяемый.ПолучитьБанковскиеСчета(Организация, Таблица);
	
КонецПроцедуры
		
#КонецОбласти

#Область РаботаСБанковскоИнформацией

// См. ОбменСКонтрагентамиПереопределяемый.ПолучитьБанковскиеРеквизиты
//
Процедура ПолучитьБанковскиеРеквизиты(МассивСчетов, Таблица) Экспорт
	
	ОбменСКонтрагентамиПереопределяемый.ПолучитьБанковскиеРеквизиты(МассивСчетов, Таблица);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФизЛицами

Функция СведенияФизЛицаПользователя(Пользователь, Организация) Экспорт
	
	СведенияФизЛица = НовыеСведенияФизЛицаПользователя();
	ОбменСКонтрагентамиПереопределяемый.СведенияФизЛицаПользователя(Пользователь, Организация, СведенияФизЛица);
	Возврат СведенияФизЛица;

КонецФункции

Функция ЭтоФизЛицо(ДанныеКонтрагента) Экспорт
	
	ЭтоФизЛицо = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ЭтоФизЛицо(ДанныеКонтрагента, ЭтоФизЛицо);
	
	Возврат ЭтоФизЛицо;
	
КонецФункции

Функция ПредставлениеЮрФизЛица(ЮрФизЛицо) Экспорт
	
	ДанныеЮрФизЛицо = ОбщегоНазначенияБЭД.ДанныеЮрФизЛица(ЮрФизЛицо); 
	ПредставлениеЮрФизЛицо = ""; 
	
	ЭлектронноеВзаимодействиеПереопределяемый.ОписаниеОрганизации(
		ДанныеЮрФизЛицо,
		ПредставлениеЮрФизЛицо,
		"ПолноеНаименование,ИНН,КПП");
	
	Возврат ПредставлениеЮрФизЛицо;
	
КонецФункции

Функция ДанныеЮрФизЛица(ЮрФизЛицо) Экспорт
	
	Возврат  ОбщегоНазначенияБЭД.ДанныеЮрФизЛица(ЮрФизЛицо);
		
КонецФункции

#КонецОбласти

#Область РаботаСНоменклатурой

// Возвращает номенклатуру контрагентов, которая числится на контроле сопоставления электронных документов.
//
// Параметры:
//  Отбор - Структура, Неопределено - критерии поиска номенклатуры на контроле:
//   * Ключ - поле отбора: Владелец, Идентификатор, ЭлектронныйДокумент.
//   * Значение - значение или коллекция значений для отбора.
//
// Возвращаемое значение:
//  Массив - номенклатура контрагента, находящаяся на контроле.
//           См. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагента.
//
Функция НоменклатураКонтрагентовНаКонтроле(Знач Отбор = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НоменклатураКонтрагентовБЭД.Владелец КАК Владелец,
	|	НоменклатураКонтрагентовБЭД.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ НоменклатураКонтрагентовНаКонтроле
	|ИЗ
	|	РегистрСведений.НоменклатураКонтрагентовБЭД КАК НоменклатураКонтрагентовБЭД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтрольСопоставленияНоменклатурыЭДО КАК Контроль
	|		ПО НоменклатураКонтрагентовБЭД.Владелец = Контроль.Владелец
	|			И НоменклатураКонтрагентовБЭД.Идентификатор = Контроль.Идентификатор
	|			И (&УсловиеОтбора)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураКонтрагентовБЭД.Наименование КАК Наименование,
	|	НоменклатураКонтрагентовБЭД.НаименованиеХарактеристики КАК Характеристика,
	|	НоменклатураКонтрагентовБЭД.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НоменклатураКонтрагентовБЭД.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	НоменклатураКонтрагентовБЭД.Артикул КАК Артикул,
	|	НоменклатураКонтрагентовБЭД.СтавкаНДС КАК СтавкаНДС,
	|	НоменклатураКонтрагентовБЭД.Штрихкод КАК Штрихкод,
	|	НоменклатураКонтрагентовБЭД.ИдентификаторНоменклатурыСервиса КАК ИдентификаторНоменклатурыСервиса,
	|	НоменклатураКонтрагентовБЭД.ИдентификаторХарактеристикиСервиса КАК ИдентификаторХарактеристикиСервиса,
	|	НоменклатураКонтрагентовБЭД.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
	|	НоменклатураКонтрагентовБЭД.ИдентификаторХарактеристики КАК ИдентификаторХарактеристики,
	|	НоменклатураКонтрагентовБЭД.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	|	НоменклатураКонтрагентовБЭД.ИспользоватьХарактеристики КАК ИспользоватьХарактеристики,
	|	НоменклатураКонтрагентовБЭД.ШтрихкодКомбинации КАК ШтрихкодКомбинации,
	|	НоменклатураКонтрагентовБЭД.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры,
	|	НоменклатураКонтрагентовНаКонтроле.Владелец КАК Владелец,
	|	НоменклатураКонтрагентовНаКонтроле.Идентификатор КАК Идентификатор,
	|	НоменклатураКонтрагентовБЭД.НаименованиеУпаковки КАК НаименованиеУпаковки
	|ИЗ
	|	НоменклатураКонтрагентовНаКонтроле КАК НоменклатураКонтрагентовНаКонтроле
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураКонтрагентовБЭД КАК НоменклатураКонтрагентовБЭД
	|		ПО НоменклатураКонтрагентовНаКонтроле.Владелец = НоменклатураКонтрагентовБЭД.Владелец
	|			И НоменклатураКонтрагентовНаКонтроле.Идентификатор = НоменклатураКонтрагентовБЭД.Идентификатор";
	
	УсловиеОтбора = "ИСТИНА";
	Если Отбор <> Неопределено Тогда
		Для Каждого Элемент Из Отбор Цикл
			УсловиеОтбора = УсловиеОтбора + " И Контроль." + Элемент.Ключ + " В (&" + Элемент.Ключ + ")";
			Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", УсловиеОтбора);
	
	НаборНоменклатурыКонтрагентов = Новый Массив;
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		
		НоменклатураКонтрагента = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагента();
		ЗаполнитьЗначенияСвойств(НоменклатураКонтрагента, Выборка);
		НаборНоменклатурыКонтрагентов.Добавить(НоменклатураКонтрагента);
		
	КонецЦикла;
	
	Возврат НаборНоменклатурыКонтрагентов;
	
КонецФункции


// Функция возвращает соответствующее переданному параметру значение ставки НДС.
// Если в функцию передан параметр ПредставлениеБЭД, то функция вернет ПрикладноеЗначение ставки НДС и наоборот.
//
// Параметры:
//   ПредставлениеБЭД - Строка - строковое представление ставки НДС.
//   ПрикладноеЗначение - ПеречислениеСсылка.СтавкиНДС, СправочникСсылка.СтавкиНДС - прикладное представление
//     соответствующего значения ставки НДС.
//
// Возвращаемое значение:
//   Строка, ПеречислениеСсылка.СтавкиНДС, СправочникСсылка.СтавкиНДС - соответствующее представление ставки НДС.
//
Функция СтавкаНДСИзСоответствия(ПредставлениеБЭД = "", ПрикладноеЗначение = Неопределено) Экспорт
	
	Возврат ИнтеграцияЭДОПовтИсп.СтавкаНДСИзСоответствия(ПредставлениеБЭД, ПрикладноеЗначение);
	
КонецФункции

Функция ЗначениеСтавкиНДСИзПеречисления(СтавкаНДС) Экспорт

	ПредставлениеСтавки = СтавкаНДСИзСоответствия(, СтавкаНДС);
	
	Если ПредставлениеСтавки = "18" ИЛИ ПредставлениеСтавки = "18/118" Тогда
		Значение = 0.18;
	ИначеЕсли ПредставлениеСтавки = "10" ИЛИ ПредставлениеСтавки = "10/110" Тогда
		Значение = 0.10;
	ИначеЕсли ПредставлениеСтавки = "20" ИЛИ ПредставлениеСтавки = "20/120" Тогда
		Значение = 0.20;
	Иначе
		Значение = 0;
	КонецЕсли;
	
	Возврат Значение;

КонецФункции

// Функция возвращает соответствующее переданному параметру значение ставки НДС.
//
// Параметры:
//   СтавкаНДС - ПеречислениеСсылка.СтавкиНДС, СправочникСсылка.СтавкиНДС - прикладное представление
//               соответствующего значения ставки НДС.
//
// Возвращаемое значение:
//   Строка, ПеречислениеСсылка.СтавкиНДС, СправочникСсылка.СтавкиНДС - соответствующее представление ставки НДС.
//
Функция СтавкаНДСПеречисление(СтавкаНДС) Экспорт	
	
	Возврат ИнтеграцияЭДОПовтИсп.СтавкаНДСПеречисление(СтавкаНДС);
	
КонецФункции

#КонецОбласти

#Область РаботаСКонтрагентами

Функция ЭтоКонтрагент(СсылкаНаОбъект) Экспорт
	
	Результат = Ложь;
	Результат = ТипЗнч(СсылкаНаОбъект) = Тип(ТипОбъектаСправочника("Контрагенты"));
	
	Возврат Результат;
	
КонецФункции

Функция СвязанныеКонтрагенты(МассивСсылокНаОбъекты) Экспорт
	
	СоответсвиеКонтрагентов = новый Соответствие;

	ОбменСКонтрагентамиПереопределяемый.СвязанныеКонтрагенты(МассивСсылокНаОбъекты, СоответсвиеКонтрагентов);
	
	Возврат СоответсвиеКонтрагентов;
	
КонецФункции

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьРеквизитыКонтрагента
//
Процедура ЗаполнитьРеквизитыКонтрагента(СтруктураРеквизитов, КонтрагентСсылка) Экспорт
	
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьРеквизитыКонтрагента(СтруктураРеквизитов, КонтрагентСсылка);
	
КонецПроцедуры

Функция ДанныеСвидетельстваОРегистрацииИП(Организация) Экспорт
	
	ДанныеСвидетельства = "";
	ОбменСКонтрагентамиПереопределяемый.ДанныеСвидетельстваОРегистрацииИП(Организация, ДанныеСвидетельства);
	Возврат ДанныеСвидетельства;
	
КонецФункции			

#КонецОбласти

#Область РаботаСПрикладнымиДокументами

// Функция возвращает соответствующее переданному параметру значение ставки НДС.
//
// Возвращаемое значение:
//   ВыводитьДопДанные - Булево -.
//   ВыводитьБанковскиеРеквизиты - Булево -.
//   ВыводитьПостраничныйРазделитель - Булево -.
//   ЭлектронныеПодписи - См. ЭлектроннаяПодпись.УстановленныеПодписи - .
//   ПрикладнойТипДокумента - 
//
Функция НовыеПараметрыПредставленияПроизвольногоДокумента() Экспорт
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ВыводитьДопДанные", Ложь);
	ПараметрыЗаполнения.Вставить("ВыводитьБанковскиеРеквизиты", Ложь);
	ПараметрыЗаполнения.Вставить("ВыводитьПостраничныйРазделитель", Ложь);
	ПараметрыЗаполнения.Вставить("ЭлектронныеПодписи", Новый Массив);
	ПараметрыЗаполнения.Вставить("ПрикладнойТипДокумента",
		Метаданные.ОпределяемыеТипы.ПрикладныеТипыЭлектронныхДокументовЭДО.Тип.ПривестиЗначение());
	
	Возврат ПараметрыЗаполнения;
		
КонецФункции

// Функция возвращает соответствующее переданному параметру значение ставки НДС.
// 
// Параметры:
// 	ДвоичныеДанные - ДвоичныеДанные - .
//  ПараметрыЗаполнения - См. ИнтеграцияЭДО.НовыеПараметрыПредставленияПроизвольногоДокумента -.
//  
// Возвращаемое значение:
//   ТабличныйДокумент -.
//
Функция ПредставлениеФайлаПрикладногоЭлектронногоДокумента(ДвоичныеДанные, ПараметрыЗаполнения) Экспорт
	
	Представление = Новый ТабличныйДокумент;
	
	//TODO: заглушка
	Для Каждого Подпись Из ПараметрыЗаполнения.ЭлектронныеПодписи Цикл
		Подпись.Вставить("ОтветнаяПодпись", Ложь);
	КонецЦикла;
	
	Параметры= Новый Структура;
	Параметры.Вставить("ВыводитьБанковскиеРеквизиты", ПараметрыЗаполнения.ВыводитьБанковскиеРеквизиты);
	Параметры.Вставить("ВыводитьПостраничныйРазделитель", ПараметрыЗаполнения.ВыводитьПостраничныйРазделитель);
	Параметры.Вставить("СкрыватьДопДанные", Не ПараметрыЗаполнения.ВыводитьДопДанные);
	Параметры.Вставить("ЭлектронныеПодписи", ПараметрыЗаполнения.ЭлектронныеПодписи);
	Параметры.Вставить("ВидЭлектронногоДокумента", ПараметрыЗаполнения.ПрикладнойТипДокумента);
	
	ОбменСКонтрагентамиПереопределяемый.ПриЗаполненииТабличногоДокументаИзФайлаПрикладногоЭлектронногоДокумента(
		Представление, ДвоичныеДанные, Параметры);

	РезультатФормирования = Новый Структура;
	РезультатФормирования.Вставить("ПредставлениеДокумента", Представление);
	РезультатФормирования.Вставить("Успех", Истина);
	
	Возврат РезультатФормирования;
	
КонецФункции
		
#КонецОбласти

#Область ПрикладныеОбъектыМетаданных

// Возвращает имя прикладного справочника по имени библиотечного справочника.
//
// Параметры:
//  ИмяСправочника - строка - название справочника из библиотеки.
//
// Возвращаемое значение:
//  Строка - имя прикладного справочника.
//
Функция ИмяПрикладногоСправочника(ИмяСправочника) Экспорт
	Возврат ОбщегоНазначенияБЭД.ИмяПрикладногоСправочника(ИмяСправочника);
КонецФункции

Функция ИмяНаличиеОбъектаРеквизитаВПрикладномРешении(ИмяПараметра) Экспорт	
	Возврат ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении(ИмяПараметра);
КонецФункции

// Возвращает пустую ссылку на справочник.
//
// Параметры:
//  ИмяСправочника - Строка - название справочника.
//
// Возвращаемое значение:
//  Ссылка - пустая ссылка на справочник.
//
Функция ПолучитьПустуюСсылку(ИмяСправочника) Экспорт
	
	Результат = Неопределено;
	
	ИмяПрикладногоСправочника = ОбщегоНазначенияБЭД.ИмяПрикладногоСправочника(ИмяСправочника);
	Если ЗначениеЗаполнено(ИмяПрикладногоСправочника) Тогда
		Результат = Справочники[ИмяПрикладногоСправочника].ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Поиска элемента справочника по реквизитам ИНН и КПП.
//
// Параметры:
//  ТипОбъекта - Строка - название справочника из библиотеки БЭД 
//              (см. ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьСоответствиеСправочников).
//  ИНН - Строка - ИНН.
//  КПП - Строка - КПП.
//  ДатаСведений - Дата - дата сведений о ИНН/КПП объекта.
//               - Неопределено - дата сведений неизвестна.
//  
// Возвращаемое значение:
//  СправочникСсылка - ссылка на объект.
// 
//
Функция СсылкаНаОбъектПоИННКПП(ТипОбъекта, ИНН, КПП, ДатаСведений = Неопределено) Экспорт
	
	СсылкаНаОбъект = Неопределено;
	ОбменСКонтрагентамиПереопределяемый.СсылкаНаОбъектПоИННКПП(
		ТипОбъекта, ИНН, КПП, СсылкаНаОбъект, ДатаСведений);
	
	Возврат СсылкаНаОбъект;
	
КонецФункции

Функция СписокТиповОбъектовУчетаПоТипуДокумента(ТипДокумента) Экспорт
	
	СписокТипов = Новый СписокЗначений;
	
	ИнтеграцияЭДОСобытия.ПриОпределенииСпискаТиповОбъектовУчетаПоТипуДокумента(ТипДокумента, СписокТипов);

	ОбменСКонтрагентамиПереопределяемый.СписокТиповДокументовПоТипуЭлектронногоДокумента(ТипДокумента, СписокТипов);
	Если СписокТипов.Количество() = 0 Тогда
		ОбменСКонтрагентамиПереопределяемый.ПриОпределенииТиповУчетныхДокументовПоПрикладномуТипуЭлектронногоДокумента(
			ТипДокумента, СписокТипов);
	КонецЕсли;
	
	Возврат СписокТипов;
	
КонецФункции

// Определяет тип объекта по текстовому представлению.
//
// Параметры:
//  ОписаниеТипаОбъекта - Строка - текстовое представление типа объекта.
//
// Возвращаемое значение:
//  Строка - тип справочника.
//
Функция ТипОбъектаСправочника(ОписаниеТипаОбъекта) Экспорт
	
	ТипОбъекта = Неопределено;
	
	ИмяПрикладногоСправочника = ИмяПрикладногоСправочника(ОписаниеТипаОбъекта);
	Если ЗначениеЗаполнено(ИмяПрикладногоСправочника) Тогда
		ТипОбъекта = "СправочникСсылка." + ИмяПрикладногоСправочника;
	КонецЕсли;
	
	Возврат ТипОбъекта;
	
КонецФункции

// Получает значение перечисления по имени объектов метаданных.
// 
// Параметры:
//  ИмяПеречисления - Строка - наименование перечисления.
//  ПредставлениеПеречисления - Строка - наименование значения перечисления.
//
// Возвращаемое значение:
//  ПеречислениеСсылка - значение искомого перечисления.
//
Функция НайтиПеречисление(Знач ИмяПеречисления, ПредставлениеПеречисления) Экспорт
	
	НайденноеЗначение = Неопределено;
	
	СоответствиеПеречислений = Новый Соответствие;
	ОбменСКонтрагентамиПереопределяемый.ПолучитьСоответствиеПеречислений(СоответствиеПеречислений);
	
	ИмяПрикладногоПеречисления = СоответствиеПеречислений.Получить(ИмяПеречисления);
	Если ИмяПрикладногоПеречисления = Неопределено Тогда // не задано соответствие
		ШаблонСообщения = НСтр("ru = 'В коде прикладного решения необходимо указать соответствие для перечисления %1.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ИмяПеречисления);
		
		ОбщегоНазначенияБЭД.ЗаписатьВЖурналРегистрации(ТекстСообщения, ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ОбменСКонтрагентами,
			УровеньЖурналаРегистрации.Предупреждение);
	ИначеЕсли ЗначениеЗаполнено(ИмяПрикладногоПеречисления) Тогда // задано какое-то значение
		ОбменСКонтрагентамиПереопределяемый.ПолучитьЗначениеПеречисления(
			ИмяПрикладногоПеречисления, ПредставлениеПеречисления, НайденноеЗначение);
		Если НайденноеЗначение = Неопределено Тогда
			Для Каждого ЭлПеречисления Из Метаданные.Перечисления[ИмяПрикладногоПеречисления].ЗначенияПеречисления Цикл
				Если ВРег(ЭлПеречисления.Синоним) = ВРег(ПредставлениеПеречисления)
					ИЛИ ВРег(ЭлПеречисления.Имя) = ВРег(ПредставлениеПеречисления) Тогда
					НайденноеЗначение = Перечисления[ИмяПрикладногоПеречисления][ЭлПеречисления.Имя];
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НайденноеЗначение;
	
КонецФункции

// Возвращает описание запроса для получения сведений по участникам ЭДО.
// Содержит следующие поля:
//	ОбъектУчета,
//	Направление,
//	ТипДокумента,
//	ПрикладнойТипДокумента,
//	Организация,
//	Контрагент,
//	ДоговорКонтрагента,
//  ОрганизацияИНН
//  ОрганизацияКПП,
//  КонтрагентИНН,
//  КонтрагентКПП
// 
// Параметры:
//  ОписанияОбъектовУчета - См. ИнтеграцияЭДО.ОписанияОбъектовУчета.
// 	ИмяВременнойТаблицы - Строка - имя временной таблицы, в которую помешается результат запроса.
// 	 	
// Возвращаемое значение:
// 	См. ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса
//
Функция ЗапросСведенийПоОбъектамУчетаИУчастникамЭДО(ОписанияОбъектовУчета, ИмяВременнойТаблицы = "") Экспорт
	
	ОписаниеЗапроса = ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса();
	
	МеткаВременнойТаблицы = "ПОМЕСТИТЬ ИмяВременнойТаблицы";
	ЗначениеВременнойТаблицы = "";
	Если ЗначениеЗаполнено(ИмяВременнойТаблицы) Тогда
		ЗначениеВременнойТаблицы = СтрЗаменить(МеткаВременнойТаблицы, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	КонецЕсли;
	
	ОписаниеЗапроса.СлужебныеПараметры.Вставить("ОписанияОбъектовУчета", ОписанияОбъектовУчета);
	
	ОписаниеЗапроса.Текст =
		"ВЫБРАТЬ
		|	ОписанияОбъектовУчета.ОбъектУчета КАК ОбъектУчета,
		|	ОписанияОбъектовУчета.Направление КАК Направление,
		|	ОписанияОбъектовУчета.ТипДокумента КАК ТипДокумента,
		|	ОписанияОбъектовУчета.ПрикладнойТипДокумента КАК ПрикладнойТипДокумента,
		|	ОписанияОбъектовУчета.Организация КАК Организация,
		|	ОписанияОбъектовУчета.Контрагент КАК Контрагент,
		|	ОписанияОбъектовУчета.ДоговорКонтрагента КАК ДоговорКонтрагента
		|ПОМЕСТИТЬ ОписанияОбъектовУчета
		|ИЗ
		|	&ОписанияОбъектовУчета КАК ОписанияОбъектовУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОписанияОбъектовУчета.ОбъектУчета КАК ОбъектУчета,
		|	ОписанияОбъектовУчета.Направление КАК Направление,
		|	ОписанияОбъектовУчета.ТипДокумента КАК ТипДокумента,
		|	ОписанияОбъектовУчета.ПрикладнойТипДокумента КАК ПрикладнойТипДокумента,
		|	ОписанияОбъектовУчета.Организация КАК Организация,
		|	ОписанияОбъектовУчета.Контрагент КАК Контрагент,
		|	ОписанияОбъектовУчета.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	&СведенияПоУчастникамЭДО
		|ПОМЕСТИТЬ ИмяВременнойТаблицы
		|ИЗ
		|	ОписанияОбъектовУчета КАК ОписанияОбъектовУчета";
	
	ИННОрганизации = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("ИННОрганизации");
	КППОрганизации = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("КППОрганизации");
	ИННКонтрагента = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("ИННКонтрагента");
	КППКонтрагента = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("КППКонтрагента");
	
	ШаблонСведенийПоУчастникамЭДО = "ЕСТЬNULL(%1, """") КАК ОрганизацияИНН,
		|ЕСТЬNULL(%2, """") КАК ОрганизацияКПП,
		|ЕСТЬNULL(%3, """") КАК КонтрагентИНН,
		|ЕСТЬNULL(%4, """") КАК КонтрагентКПП";
	
	СведенияПоУчастникамЭДО = СтрШаблон(ШаблонСведенийПоУчастникамЭДО,
		?(ЗначениеЗаполнено(ИННОрганизации), "ОписанияОбъектовУчета.Организация." + ИННОрганизации, """"),
		?(ЗначениеЗаполнено(КППОрганизации), "ОписанияОбъектовУчета.Организация." + КППОрганизации, """"),
		?(ЗначениеЗаполнено(ИННКонтрагента), "ОписанияОбъектовУчета.Контрагент." + ИННКонтрагента, """"),
		?(ЗначениеЗаполнено(КППКонтрагента), "ОписанияОбъектовУчета.Контрагент." + КППКонтрагента, """"));
	
	ОписаниеЗапроса.Текст = СтрЗаменить(ОписаниеЗапроса.Текст, МеткаВременнойТаблицы, ЗначениеВременнойТаблицы);
	ОписаниеЗапроса.Текст = СтрЗаменить(ОписаниеЗапроса.Текст, "&СведенияПоУчастникамЭДО", СведенияПоУчастникамЭДО);
	
	Возврат ОписаниеЗапроса;
	
КонецФункции

#КонецОбласти

#Область ИнтеграцияСУчетнымиДокументами

Функция НовыеПараметрыПолученияСостоянияНеНачатогоЭДООбъектаУчета() Экспорт

	ДанныеСостояния = Новый Структура;
	ДанныеСостояния.Вставить("ОбъектУчета");
	ДанныеСостояния.Вставить("Контрагент");
	ДанныеСостояния.Вставить("ТипДокумента");
	ДанныеСостояния.Вставить("ПрикладнойТипДокумента");
	ДанныеСостояния.Вставить("Направление");
	ДанныеСостояния.Вставить("Организация");
	ДанныеСостояния.Вставить("Договор");

	Возврат ДанныеСостояния;

КонецФункции

Процедура ЗаполнитьСостояниеНеНачатогоЭДООбъектаУчета(Параметры, ДанныеСостояния) Экспорт
	
	Если ДанныеСостояния = Неопределено Тогда
		ДанныеСостояния = НовыеДанныеСостоянияЭДООбъектаУчета();
	КонецЕсли;
	
	Если Параметры.Направление = Перечисления.НаправленияЭДО.Внутренний Тогда
		
		ИдентификаторОбъектаУчета = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Параметры.ОбъектУчета));
		
		ОтборВидовДокументовВнутреннегоЭДО = ЭлектронныеДокументыЭДО.НовыйОтборВидовДокументов();
		ОтборВидовДокументовВнутреннегоЭДО.ТипДокумента = "ЗНАЧЕНИЕ(Перечисление.ТипыДокументовЭДО.Внутренний)";
		ОтборВидовДокументовВнутреннегоЭДО.ИдентификаторОбъектаУчета = "ИдентификаторОбъектаУчета";
	
		ИмяТаблицыВидовДокументовВнутреннегоЭДО = "ВидыВнутреннегоЭДО";
		ТекстЗапросаВидовДокументовВнутреннегоЭДО = ЭлектронныеДокументыЭДО.ЗапросВидовДокументов(
			ИмяТаблицыВидовДокументовВнутреннегоЭДО, ОтборВидовДокументовВнутреннегоЭДО).Текст;
		
		ОтборНастроекОтправкиВнутреннегоЭДО = НастройкиЭДО.НовыйОтборНастроекВнутреннегоЭДО();
		ОтборНастроекОтправкиВнутреннегоЭДО.ВидДокумента = "&НастройкиВидДокумента";
		ОтборНастроекОтправкиВнутреннегоЭДО.Организация = "&НастройкиОрганизация";
		ИмяТаблицыНастроекВнутреннегоЭДО = "НастройкиВнутреннегоЭДО";
		ТекстЗапросаНастроекВнутреннегоЭДО = НастройкиЭДО.ЗапросНастроекВнутреннегоЭДО(
			ИмяТаблицыНастроекВнутреннегоЭДО, ОтборНастроекОтправкиВнутреннегоЭДО).Текст;
	
		ТекстЗапросаНастроекВнутреннегоЭДО = СтрЗаменить(ТекстЗапросаНастроекВнутреннегоЭДО, "&НастройкиВидДокумента",
			"ВЫБРАТЬ Ссылка ИЗ ВидыВнутреннегоЭДО");
		
		ТекстЗапросаИтоговыхДанных = 
		"ВЫБРАТЬ
		|	НастройкиВнутреннегоЭДО.ВидВнутреннегоДокумента,
		|	НастройкиВнутреннегоЭДО.Формировать
		|ИЗ
		|	НастройкиВнутреннегоЭДО КАК НастройкиВнутреннегоЭДО";
	
		Запросы = Новый Массив;
		Запросы.Добавить(ТекстЗапросаВидовДокументовВнутреннегоЭДО);
		Запросы.Добавить(ТекстЗапросаНастроекВнутреннегоЭДО);
		Запросы.Добавить(ТекстЗапросаИтоговыхДанных);
		
		ИтоговыйЗапрос = СтрСоединить(Запросы, ОбщегоНазначения.РазделительПакетаЗапросов());
		
		Запрос = Новый Запрос;	
		Запрос.Текст = ИтоговыйЗапрос;
	
		Запрос.Параметры.Вставить("ИдентификаторОбъектаУчета", ИдентификаторОбъектаУчета);
		Запрос.Параметры.Вставить("НастройкиОрганизация", Параметры.Организация);
			
		РезультатПоискаНастроек = Запрос.Выполнить().Выгрузить();
				
		Если Не ЗначениеЗаполнено(РезультатПоискаНастроек) Тогда	
			
			ДанныеСостояния.ПредставлениеСостояния = НСтр("ru = 'Не начат'");
			ДанныеСостояния.НеобходимаНастройка = Истина;	
			
		ИначеЕсли РезультатПоискаНастроек.Найти(Истина, "Формировать") = Неопределено Тогда
			
			ДанныеСостояния.ПредставлениеСостояния = НСтр("ru = 'Формирование документов запрещено'");
			ДанныеСостояния.НеобходимаНастройка = Истина;
		Иначе
			ДанныеСостояния.СуществуетАктуальныйДокумент = ЗначениеЗаполнено(
				ИнтеграцияЭДО.ОсновнойЭлектронныйДокументОбъектаУчета(Параметры.ОбъектУчета));
			ДанныеСостояния.ПредставлениеСостояния = НСтр("ru = 'Не начат'");
		КонецЕсли;
		
	Иначе					
			КлючНастроек = НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки();
			ТипДокументаДляВида = ?(Параметры.ТипДокумента = Перечисления.ТипыДокументовЭДО.Прикладной,
				Параметры.ПрикладнойТипДокумента, Параметры.ТипДокумента);
			КлючНастроек.ВидДокумента = ВидДокументаПоТипу(ТипДокументаДляВида);
			КлючНастроек.Отправитель = Параметры.Организация;
			КлючНастроек.Получатель = Параметры.Контрагент;
			КлючНастроек.Договор = Параметры.Договор;
	
			НастройкиОтправки = НастройкиЭДО.НастройкиОтправки(КлючНастроек);
			
			Если Не ЗначениеЗаполнено(НастройкиОтправки) Тогда
				
				ДанныеСостояния.ПредставлениеСостояния = НСтр("ru = 'Требуется настройка'");
				ДанныеСостояния.НеобходимаНастройка = Истина;
				
				Если Параметры.Направление = Перечисления.НаправленияЭДО.Исходящий
					Или Параметры.Направление = Перечисления.НаправленияЭДО.Интеркампани Тогда
					ДанныеСостояния.ПредставлениеСостояния = НСтр("ru = 'Не начат'");		
				ИначеЕсли Параметры.Направление = Перечисления.НаправленияЭДО.Входящий Тогда 
					ШаблонТекстаНавигационнойСсылки = НСтр("ru = 'Пригласить %1 к обмену электронными документами в 1С-ЭДО'");
					ДанныеСостояния.ПредставлениеСостояния = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						ШаблонТекстаНавигационнойСсылки, Параметры.Контрагент);
				КонецЕсли;
				
			ИначеЕсли Не НастройкиОтправки.Формировать Тогда
				
				ДанныеСостояния.ПредставлениеСостояния = НСтр("ru = 'Формирование документов запрещено'");
				ДанныеСостояния.НеобходимаНастройка = Истина;				
			Иначе
				ДанныеСостояния.СуществуетАктуальныйДокумент = ЗначениеЗаполнено(
					ИнтеграцияЭДО.ОсновнойЭлектронныйДокументОбъектаУчета(Параметры.ОбъектУчета));
				ДанныеСостояния.ПредставлениеСостояния = НСтр("ru = 'Не начат'");
			КонецЕсли;			

	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеСостоянияЭДОДляФормыОбъектаУчета(ОбъектУчета) Экспорт
	
	Результат = НовыеДанныеСостоянияЭДООбъектаУчета();
	
	Если Результат.ИспользуетсяОбменЭлектроннымиДокументами Тогда
		Если ЗначениеЗаполнено(ОбъектУчета) Тогда	
			ПредставлениеСостояния = СохраненноеПредставлениеСостоянияЭДООбъектаУчета(ОбъектУчета);
					
			Если ПустаяСтрока(ПредставлениеСостояния) Тогда
				Описание = ИнтеграцияЭДО.ОписаниеОбъектаУчета(ОбъектУчета);
				ПараметрыПолученияСостояния = НовыеПараметрыПолученияСостоянияНеНачатогоЭДООбъектаУчета();
				ЗаполнитьЗначенияСвойств(ПараметрыПолученияСостояния, Описание);
				 
				ЗаполнитьСостояниеНеНачатогоЭДООбъектаУчета(ПараметрыПолученияСостояния, Результат);
			Иначе
				Результат.ПредставлениеСостояния = ПредставлениеСостояния;
				Результат.СуществуетАктуальныйДокумент = ЗначениеЗаполнено(
					ОсновнойЭлектронныйДокументОбъектаУчета(ОбъектУчета));
				Результат.НеобходимаНастройка = Ложь;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИменаСвязейПараметровВыбораДоговорКонтрагента() Экспорт
	
	ИмяСвязиПоОрганизации = "";
	ИмяСвязиПоКонтрагенту = "";
	
	ОбменСКонтрагентамиПереопределяемый.УстановитьИменаСвязейПараметровВыбораДоговорКонтрагента(
		ИмяСвязиПоОрганизации, ИмяСвязиПоКонтрагенту);
	
	Возврат Новый Структура("ПоОрганизации, ПоКонтрагенту", ИмяСвязиПоОрганизации, ИмяСвязиПоКонтрагенту);
		
КонецФункции

#КонецОбласти

#Область ОтражениеВУчете

#Область СпособыОбработки

Функция СпособОбработки_НеОтражать() Экспорт
	Возврат "НеОтражать";
КонецФункции

Функция СпособОбработки_Вручную() Экспорт
	Возврат "Вручную";
КонецФункции

Функция ЭтоСпособОбработки_НеОтражать(СпособОбработки) Экспорт 
	 Возврат ВРег(СпособОбработки) = ВРег(СпособОбработки_НеОтражать());
КонецФункции

Функция ЭтоСпособОбработки_Вручную(СпособОбработки) Экспорт 
	 Возврат ВРег(СпособОбработки) = ВРег(СпособОбработки_Вручную());
КонецФункции


#КонецОбласти

// Выполняет отражение в учете документа.
// 
// Параметры:
// 	ДанныеДокументов - Массив Из См. ИнтеграцияЭДОКлиентСервер.НовыеДанныеЭлектронногоДокументаДляОтраженияВУчете.
// 	СпособОбработки - Строка - Способ обработки.
//
Процедура ОтразитьВУчетеЭлектронныеДокументы(ДанныеДокументов, СпособОбработки = Неопределено) Экспорт
	
	ИзмененияОтраженияВУчете = Новый ТаблицаЗначений;
	ИзмененияОтраженияВУчете.Колонки.Добавить("ЭлектронныйДокумент");
	ИзмененияОтраженияВУчете.Колонки.Добавить("ДобавленныеОбъектыУчета");
	
	Результат = НовыйРезультатОтраженияВУчете();
	
	УстановитьПривилегированныйРежим(Истина);	
	
	ИсключитьНеОтражаемыеВУчетеЭлектронныеДокументы(ДанныеДокументов, Результат);
	ВключитьКонтрольОтраженияВУчете(ДанныеДокументов);

	Для Каждого СтрокаПараметров Из ДанныеДокументов Цикл
		
		НачатьТранзакцию();
		
		Попытка				
			
			Если Не ЗначениеЗаполнено(СпособОбработки) Тогда			
				СпособОбработкиДокумента = СпособОтраженияВУчетеЭлектронногоДокумента(СтрокаПараметров);
			Иначе
				СпособОбработкиДокумента = СпособОбработки;
			КонецЕсли;
			
			АвтоматическоеОтражениеДоступно = Истина;	
				
			Если ТипЗнч(СпособОбработкиДокумента) = Тип("Структура") Тогда
				Если ЭтоСпособОбработки_Вручную(СпособОбработкиДокумента.ПервичныйДокумент)
					Или ЭтоСпособОбработки_Вручную(СпособОбработкиДокумента.СчетФактура)
					Или ЭтоСпособОбработки_НеОтражать(СпособОбработкиДокумента.ПервичныйДокумент)
					Или ЭтоСпособОбработки_НеОтражать(СпособОбработкиДокумента.СчетФактура)  Тогда 
						
					АвтоматическоеОтражениеДоступно = Ложь;
				КонецЕсли;	
			Иначе
				Если ЭтоСпособОбработки_Вручную(СпособОбработкиДокумента) 
					Или ЭтоСпособОбработки_НеОтражать(СпособОбработкиДокумента) Тогда
				
					АвтоматическоеОтражениеДоступно = Ложь;
					
				КонецЕсли;	
			КонецЕсли;	
				
			Если АвтоматическоеОтражениеДоступно Тогда				
				
				ОбъектыУчета = Неопределено;
				ДокументЗагружен = Ложь;
				ЗаполнитьДокументУчета(СтрокаПараметров, ОбъектыУчета, СпособОбработкиДокумента, ДокументЗагружен);
				
				Если ЗначениеЗаполнено(ОбъектыУчета) Тогда
					НоваяСтрока = ИзмененияОтраженияВУчете.Добавить();
					НоваяСтрока.ЭлектронныйДокумент     = СтрокаПараметров.ЭлектронныйДокумент;
					НоваяСтрока.ДобавленныеОбъектыУчета = ОбъектыУчета;
				КонецЕсли;
	
			КонецЕсли;					
				
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();

			ШаблонСообщения = НСтр("ru = 'При отражении в учете электронного документа: %1 возникла ошибка:
				|%2'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения,
				СтрокаПараметров.ЭлектронныйДокумент, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ЭлектронноеВзаимодействие.ОбработатьОшибку(
				НСтр("ru = 'Создание учетного документа'"), ТекстОшибки, ТекстСообщения,, СтрокаПараметров.ЭлектронныйДокумент);
			
		КонецПопытки;
		
	КонецЦикла;
		
	ВключитьКонтрольОтраженияВУчете(ДанныеДокументов);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Каждого СтрокаИзменения Из ИзмененияОтраженияВУчете Цикл
		ОбменСКонтрагентамиПереопределяемый.ПослеИзмененияОтраженияВУчете(СтрокаИзменения.ЭлектронныйДокумент, 
			СтрокаИзменения.ДобавленныеОбъектыУчета, Новый Массив);
	КонецЦикла;
	
КонецПроцедуры

Функция ПерезаполнитьДокумент(Знач ПараметрыЗаполнения, КонтекстОперации) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Отказ", Ложь);
	Результат.Вставить("НетПраваОбработкиЭД", Ложь);
	Результат.Вставить("МассивДокументов", Новый Массив);
	Результат.Вставить("СопоставитьНоменклатуру", Ложь);
	Результат.Вставить("ПараметрыСопоставления", Неопределено);
	
	Если НЕ ЭлектронныеДокументыЭДО.ЕстьПравоОбработкиДокументов() Тогда
		Результат.Отказ = Истина;
		Результат.НетПраваОбработкиЭД = Истина;
		Возврат Результат;
	КонецЕсли;
	
	МассивПроведенныхДокументов = МассивПроведенныхДокументов(
		ПараметрыЗаполнения.МассивСсылок);
		
	Шаблон = НСтр("ru = 'Перезаполнение документа %1.
						|Операция возможна только для непроведенных документов.'");
	Для Каждого Документ Из МассивПроведенныхДокументов Цикл
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, Документ);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	КонецЦикла;
	
	МассивСсылок = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		ПараметрыЗаполнения.МассивСсылок, МассивПроведенныхДокументов);
	
	Если МассивСсылок.Количество() = 0 Тогда
		Результат.Отказ = Истина;
		Возврат Результат;
	КонецЕсли;
	
	АктуальныеДокументыЭДО = АктуальныеЭлектронныеДокументы(МассивСсылок);
	
	Если ЗначениеЗаполнено(ПараметрыЗаполнения.ЭлектронныйДокумент) Тогда
		Для Каждого ТекущийДокумент Из МассивСсылок Цикл
			СтрокаСоответствия = АктуальныеДокументыЭДО.Добавить();
			СтрокаСоответствия.ОбъектУчета = ТекущийДокумент;
			СтрокаСоответствия.ЭлектронныйДокумент = ПараметрыЗаполнения.ЭлектронныйДокумент;
		КонецЦикла;
	КонецЕсли;
	
	Если АктуальныеДокументыЭДО.Количество() = 0 Тогда
		Для Каждого ТекущийДокумент Из МассивСсылок Цикл
			Шаблон = НСтр("ru = 'Электронный документ для %1 не найден'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ТекущийДокумент);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецЦикла;
		
		Результат.Отказ = Истина;
		Возврат Результат;
	КонецЕсли;
	
	Для каждого ЭлементСоответствия Из АктуальныеДокументыЭДО Цикл
		
		ОбъектУчета = ЭлементСоответствия.ОбъектУчета;
		ЭлектронныйДокумент = ЭлементСоответствия.ЭлектронныйДокумент;
		
		Если Не ЗначениеЗаполнено(ОбъектУчета) ИЛИ Не ЗначениеЗаполнено(ЭлектронныйДокумент) Тогда
			Результат.Отказ = Истина;
			Возврат Результат;
		КонецЕсли;
		
		ПараметрыПерезаполнения = ДополнительныеПараметрыПерезаполненияДокументаИБ();
		
		ПерезаполнитьОбъектУчетаПоЭлектронномуДокументу(ОбъектУчета, ЭлектронныйДокумент,
			ПараметрыЗаполнения.СпособОбработки, КонтекстОперации, ПараметрыПерезаполнения);
		
		Если ПараметрыПерезаполнения.ДокументЗагружен Тогда
			
			Результат.МассивДокументов.Добавить(ОбъектУчета);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ПерезаполнитьОбъектУчетаПоЭлектронномуДокументу(ОбъектУчета, Знач ЭлектронныйДокумент, СпособОбработки = "", КонтекстОперации = Неопределено,
	ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = ДополнительныеПараметрыПерезаполненияДокументаИБ();
	КонецЕсли;		

	Если Не ЗначениеЗаполнено(СпособОбработки) Тогда
		СпособОбработки = СпособОбработкиЭлектронногоДокументаПоОснованию(ЭлектронныйДокумент, ОбъектУчета);
	КонецЕсли;

	ЭлектронныеДокументы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЭлектронныйДокумент);
	ДанныеДокумента = ЭлектронныеДокументыЭДО.ДанныеДокументовДляОтраженияВУчете(ЭлектронныеДокументы)[0];
	
	Если Не ЗначениеЗаполнено(СпособОбработки) Тогда
		
		СпособОбработки = СпособОбработки = СпособОтраженияВУчетеЭлектронногоДокумента(ДанныеДокумента);
		
	КонецЕсли;
	
	ДокументЗагружен = Ложь;
	
	ОбъектыУчета = Новый Массив;
	Если ДанныеДокумента.ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(Перечисления.ТипыДокументовЭДО.УПД)
		Или ДанныеДокумента.ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(Перечисления.ТипыДокументовЭДО.УКД) Тогда
		
		ОбъектыУчета = ИнтеграцияЭДО.ОбъектыУчетаЭлектронныхДокументов(ЭлектронныйДокумент).ВыгрузитьКолонку("ОбъектУчета");
	
	Иначе
		ОбъектыУчета.Добавить(ОбъектУчета);
	КонецЕсли;
		
	ЗаполнитьДокументУчета(ДанныеДокумента, ОбъектыУчета, СпособОбработки, ДокументЗагружен);
	ДополнительныеПараметры.ДокументЗагружен = ДокументЗагружен;
	ДополнительныеПараметры.ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ОбъектУчета)).ПолноеИмя();
	
КонецПроцедуры

Процедура ЗаполнитьДокументУчета(ДанныеЭлектронногоДокумента, ДокументыУчета, СпособОбработки = "", ДокументЗагружен)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(ДанныеЭлектронногоДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		СохранитьДанныеОбъекта(ДанныеЭлектронногоДокумента, ДокументыУчета, СпособОбработки);
		
		Если ЗначениеЗаполнено(ДокументыУчета) Тогда
			Для каждого ОбъектУчета Из ДокументыУчета Цикл
				ЗаписатьАктуальныйЭлектронныйДокумент(ОбъектУчета, ДанныеЭлектронногоДокумента.ЭлектронныйДокумент, ДанныеЭлектронногоДокумента.ВидДокумента);	
				
				СпособОбработкиТекущегоДокумента = "";
				Если ТипЗнч(СпособОбработки) = Тип("Структура") Тогда

					Если ОбъектУчетаЯвляетсяСчетомФактурой(ОбъектУчета) Тогда
						СпособОбработкиТекущегоДокумента = СпособОбработки.СчетФактура;
					Иначе
						СпособОбработкиТекущегоДокумента = СпособОбработки.ПервичныйДокумент;
					КонецЕсли;

				Иначе
					СпособОбработкиТекущегоДокумента = СпособОбработки;
				КонецЕсли;

				УстановитьСвязьЭлектронногоДокументаСОбъектомУчета(ДанныеЭлектронногоДокумента.ЭлектронныйДокумент,
					ДанныеЭлектронногоДокумента.ВидДокумента, ОбъектУчета, СпособОбработкиТекущегоДокумента);

			КонецЦикла;			
			
		КонецЕсли;
		
		ДокументЗагружен = Истина;		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Заполняет документ учета.
//
// Параметры:
//  ДанныеЭлектронногоДокумента - См. ИнтеграцияЭДОКлиентСервер.НовыеДанныеДокументооборота - данные электронного документа.
//
Процедура СохранитьДанныеОбъекта(ДанныеЭлектронногоДокумента, ДокументыУчета, СпособОбработки = "") Экспорт
	
	ПоддерживаемыеФорматы = ЭлектронныеДокументыЭДО.ПоддерживаемыеФорматы();	

	ПараметрыПолучения = ЭлектронныеДокументыЭДО.НовыеПараметрыПолученияДанныхДокумента();
	ПараметрыПолучения.ОсновнойФайл = ДанныеЭлектронногоДокумента.ДанныеОсновногоФайла;
	ПараметрыПолучения.ДополнительныйФайл = ДанныеЭлектронногоДокумента.ДанныеДополнительногоФайла;
	
	Результат = ЭлектронныеДокументыЭДО.ДанныеДокументаДляЗагрузкиПросмотра(ПараметрыПолучения);
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;	
	КонецЕсли;
	
	Если ЭлектронныеДокументыЭДО.ЭтоПрикладнойВидДокумента(ДанныеЭлектронногоДокумента.ВидДокумента) Тогда
		Если ДокументыУчета = Неопределено Тогда
			ДокументыУчета = Новый Массив;
		КонецЕсли;
		
		ДокументыУчета = СохранитьДанныеОбъектаПрикладногоФормата(ДанныеЭлектронногоДокумента, ДокументыУчета, СпособОбработки);
		Возврат;
	КонецЕсли;
	
	НовыйЭД = Результат.НовыйЭД;
	ДеревоРазбора = Результат.ДеревоРазбора;
	ДеревоЭД = НовыйЭД.ЗначениеРеквизита;
	
	Если ЗначениеЗаполнено(НовыйЭД) Тогда
		
			ЗаполнитьДокументыУчета = Истина;
			ОписаниеОшибки = "";
			
			ДокументУчета = Неопределено;
			Если ЗначениеЗаполнено(ДокументыУчета) Тогда
				ДокументУчета = ДокументыУчета[0];
			КонецЕсли;			
			
			ПараметрыОтражения = Новый Структура;
			ПараметрыОтражения.Вставить("ЭлектронныйДокумент", ДанныеЭлектронногоДокумента.ЭлектронныйДокумент);
			ПараметрыОтражения.Вставить("Контрагент", ДанныеЭлектронногоДокумента.Отправитель);
			ПараметрыОтражения.Вставить("СпособОбработки", СпособОбработки);
			ПараметрыОтражения.Вставить("ДеревоДокумента", НовыйЭД);
			
			ДополнитьДеревоСсылкамиНаДокументыОснования(ДеревоРазбора, НовыйЭД, ДанныеЭлектронногоДокумента);
			
			Отказ = Ложь;
			ОписаниеОшибки = "";
			ПриОтраженииВУчетеЭлектронногоДокументаСНоменклатурой(
				ПараметрыОтражения, Отказ, ОписаниеОшибки);
			Если Отказ Тогда
				Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
					ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
				КонецЕсли;
				Возврат;
			КонецЕсли;
			
			НачатьТранзакцию();
			
			Попытка
				
				Если НовыйЭД.ВерсияФормата = ПоддерживаемыеФорматы.ФНС.ПередачаТоваров.ИнформацияПродавца Тогда				
					ОбменСКонтрагентамиПереопределяемый.НайтиСоздатьДокументПередачаТоваров(ДеревоЭД, ДокументУчета, СпособОбработки, ОписаниеОшибки);					
				ИначеЕсли  НовыйЭД.ВерсияФормата = ПоддерживаемыеФорматы.ФНС.ПередачаРабот.ИнформацияПродавца Тогда					
					ОбменСКонтрагентамиПереопределяемый.НайтиСоздатьДокументПередачаРезультатовРабот(ДеревоЭД, ДокументУчета, СпособОбработки, ОписаниеОшибки);					
				ИначеЕсли  НовыйЭД.ВерсияФормата = ПоддерживаемыеФорматы.ФНС.УПД.ИнформацияПродавца Тогда
					ОбменСКонтрагентамиПереопределяемый.НайтиСоздатьУниверсальныйПередаточныйДокумент(ДеревоЭД, ДокументыУчета, СпособОбработки, ОписаниеОшибки);				
				ИначеЕсли НовыйЭД.ВерсияФормата = ПоддерживаемыеФорматы.ФНС.УПД2019.ИнформацияПродавца Тогда						
					ОбменСКонтрагентамиПереопределяемый.НайтиСоздатьУниверсальныйПередаточныйДокумент_2019(ДеревоЭД, ДокументыУчета, СпособОбработки, ОписаниеОшибки);				
				ИначеЕсли НовыйЭД.ВерсияФормата = ПоддерживаемыеФорматы.ФНС.УКД2020.ИнформацияПродавца Тогда
					ОбменСКонтрагентамиПереопределяемый.НайтиСоздатьУКД_2020(ДеревоЭД, ДокументыУчета, СпособОбработки, ОписаниеОшибки);
				ИначеЕсли НовыйЭД.ВерсияФормата = ПоддерживаемыеФорматы.ФНС.УКД.ИнформацияПродавца Тогда
					ОбменСКонтрагентамиПереопределяемый.НайтиСоздатьУниверсальныйКорректировочныйДокумент(ДеревоЭД, ДокументыУчета, СпособОбработки, ОписаниеОшибки);
				ИначеЕсли НовыйЭД.ВерсияФормата = ПоддерживаемыеФорматы.ФНС.АктОРасхождениях.ИнформацияПокупателя Тогда					
					ОбменСКонтрагентамиПереопределяемый.НайтиСоздатьАктОРасхождениях_ФНС_2019(ДеревоЭД, ДокументУчета, СпособОбработки, ОписаниеОшибки);
				ИначеЕсли НовыйЭД.ВидЭД = Перечисления.ТипыДокументовЭДО.КаталогТоваров И 
					ЗначениеЗаполнено(ДанныеЭлектронногоДокумента.ЭлектронныйДокумент) Тогда
					
					Если ДокументУчета = Неопределено Тогда 
						СвойстваДокумента = ЭлектронныеДокументыЭДО.СвойстваДокумента(ДанныеЭлектронногоДокумента.ЭлектронныйДокумент, "ВидДокумента, Организация, Контрагент, ДоговорКонтрагента");
						ДокументУчета = НастройкиЭДО.СсылкаНаОбъектНастройкиЭДО(СвойстваДокумента.Организация, СвойстваДокумента.Контрагент, СвойстваДокумента.ДоговорКонтрагента);
					КонецЕсли;	
						
					УстановитьСвязьЭлектронногоДокументаСОбъектомУчета(ДанныеЭлектронногоДокумента.ЭлектронныйДокумент, ДанныеЭлектронногоДОкумента.ВидДокумента, ДокументУчета, СпособОбработки);
				
				ИначеЕсли ДанныеЭлектронногоДокумента.ТипДокумента = Перечисления.ТипыДокументовЭДО.ЗапросКоммерческихПредложений Тогда
					
					ЗапросКоммерческогоПредложенияОтКлиента =
						"ЭлектронноеВзаимодействие.КоммерческиеПредложения.КоммерческиеПредложенияДокументы.ЗапросКоммерческогоПредложенияОтКлиента";
					Если ОбщегоНазначения.ПодсистемаСуществует(ЗапросКоммерческогоПредложенияОтКлиента) Тогда
						МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("Документы.ЗапросКоммерческогоПредложенияОтКлиента");
						МодульПодсистемы.НайтиСоздатьЗапросКоммерческихПредложений(ДеревоЭД, ДокументУчета);
					Иначе
						ОбменСКонтрагентамиПереопределяемый.НайтиСоздатьЗапросКоммерческихПредложений(ДеревоЭД,
							ДокументУчета, СпособОбработки, ОписаниеОшибки);
					КонецЕсли;
					
				ИначеЕсли ДанныеЭлектронногоДокумента.ТипДокумента = Перечисления.ТипыДокументовЭДО.КоммерческоеПредложение Тогда
					
					КоммерческоеПредложениеПоставщика =
						"ЭлектронноеВзаимодействие.КоммерческиеПредложения.КоммерческиеПредложенияДокументы.КоммерческоеПредложениеПоставщика";
					Если ОбщегоНазначения.ПодсистемаСуществует(КоммерческоеПредложениеПоставщика) Тогда
						МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("Документы.КоммерческоеПредложениеПоставщика");
						МодульПодсистемы.НайтиСоздатьКоммерческоеПредложение(ДеревоЭД, ДокументУчета);
					Иначе
						ОбменСКонтрагентамиПереопределяемый.НайтиСоздатьКоммерческоеПредложение(ДеревоЭД,
							ДокументУчета, СпособОбработки, ОписаниеОшибки);
					КонецЕсли;
						
				Иначе
					ОшибкаЗаписи = Ложь;
					ЗаполнитьСсылкиНаОбъектыВДереве(ДеревоРазбора, ОшибкаЗаписи);
				
					ПараметрыОбработки = НовыеПараметрыОбработкиСохранитьДанныеОбъектаВБД(ДокументУчета,,
						СпособОбработки);
					ОбменСКонтрагентамиПереопределяемый.СохранитьДанныеОбъектаВБД(НовыйЭД, ДеревоРазбора, ПараметрыОбработки,
						ДанныеЭлектронногоДокумента.ДополнительныеДанные, ДокументУчета, ОписаниеОшибки);
					
					Если НЕ ЗначениеЗаполнено(ДокументУчета) Тогда
						ЗаполнитьДокументыУчета = Ложь;
					КонецЕсли;
				КонецЕсли;
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				ТекстСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				ЭлектронноеВзаимодействие.ОбработатьОшибку(НСтр("ru = 'Заполнение документа на основе ЭД.'"),
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
					ТекстСообщения);
				ЗаполнитьДокументыУчета = Ложь;
				
				ВызватьИсключение;
				
			КонецПопытки;
			
			Если НЕ ЗначениеЗаполнено(ДокументУчета) Тогда
				ЗаполнитьДокументыУчета = Ложь;
			КонецЕсли;
					
			Если ЗаполнитьДокументыУчета Тогда
				ДокументыУчета = Новый Массив;
				ДокументыУчета.Добавить(ДокументУчета);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ДокументыУчета) Тогда
				ТекстСообщения = НСтр("ru = 'Не удалось создать документ базы данных.'");
				АктуальныеВидыЭД = ЭлектронныеДокументыЭДО.ИспользуемыеВидыДокументовВходящие();
				ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(НовыйЭД.ВидЭД);
				Если АктуальныеВидыЭД.Найти(ВидДокумента) = Неопределено Тогда
					ШаблонСообщения = НСтр("ru = 'Электронный документ вида ""%1"" в текущей конфигурации не поддерживается'");
					ТекстЖурналаРегистрации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ВидДокумента);
				ИначеЕсли ЗначениеЗаполнено(ОписаниеОшибки) Тогда
					ТекстЖурналаРегистрации = ОписаниеОшибки;
					ТекстСообщения = ТекстСообщения + Символы.ПС + ОписаниеОшибки;
				Иначе
					ТекстЖурналаРегистрации = НСтр("ru = 'Необходимо проверить работу процедуры
						|ОбменСКонтрагентамиПереопределяемый.СохранитьДанныеОбъектаВБД'");
				КонецЕсли;
				ВидОперации = НСтр("ru = 'Заполнение документа на основе ЭД.'");
				ЭлектронноеВзаимодействие.ОбработатьОшибку(
					ВидОперации, ТекстЖурналаРегистрации, ТекстСообщения);
					ОшибкаЗаписи = Истина;
			КонецЕсли;
			
		КонецЕсли;
	
		
КонецПроцедуры

Функция СохранитьДанныеОбъектаПрикладногоФормата(ДанныеЭлектронногоДокумента, ДокументыУчета, СпособОбработки = "") Экспорт
	
	Если Не ЗначениеЗаполнено(СпособОбработки) Тогда
		СписокОпераций = ЭлектронныеДокументыЭДО.СписокОперацийВидаДокумента(ДанныеЭлектронногоДокумента.ВидДокумента, Истина);		
		Для Каждого ЭлементСписка Из СписокОпераций Цикл
			Если ЭлементСписка.Пометка Тогда
				СпособОбработки = ЭлементСписка.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыОтражения = Новый Структура;
	ПараметрыОтражения.Вставить("ЭлектронныйДокумент", ДанныеЭлектронногоДокумента.ЭлектронныйДокумент);
	ПараметрыОтражения.Вставить("ТипДокумента", ДанныеЭлектронногоДокумента.ТипДокумента);
	ПараметрыОтражения.Вставить("СпособОбработки", СпособОбработки);
	ГотовКОтражениюВУчете = ПрикладнойЭлектронныйДокументГотовКОтражениюВУчете(
			ПараметрыОтражения);
	Если НЕ ГотовКОтражениюВУчете Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	ПараметрыФайлаЭлектронногоДокумента = Новый Структура;
	ПараметрыФайлаЭлектронногоДокумента.Вставить("ДанныеФайла", ДанныеЭлектронногоДокумента.ДанныеОсновногоФайла.ДвоичныеДанные);
	ПараметрыФайлаЭлектронногоДокумента.Вставить("СпособОбработки", СпособОбработки);
	ПараметрыФайлаЭлектронногоДокумента.Вставить("Входящий", ДанныеЭлектронногоДокумента.Направление = Перечисления.НаправленияЭДО.Входящий);
	
	ОбменСКонтрагентамиПереопределяемый.ПриСозданииОбъектовУчетаИзФайлаПрикладногоЭлектронногоДокумента(
		ПараметрыФайлаЭлектронногоДокумента, ДокументыУчета);
	
	Возврат ДокументыУчета;
	
КонецФункции

Функция ИспользоватьСопоставлениеНоменклатуры(ТипДокумента) Экспорт
	
	Если ТипЗнч(ТипДокумента) = Тип("ПеречислениеСсылка.ТипыДокументовЭДО") Тогда
		Использовать = Истина;
	Иначе
		Использовать = Ложь;
		ОбменСКонтрагентамиПереопределяемый.ПриОпределенииИспользованияСопоставленияНоменклатурыКонтрагентов(
			ТипДокумента, Использовать);
	КонецЕсли;
	
	Возврат Использовать;
	
КонецФункции

Процедура ЗаполнитьСсылкиНаОбъектыВДереве(ДеревоРазбора, Ошибка) Экспорт
	
	ОтборБезСсылокНаОбъекты = Новый Структура;
	ОтборБезСсылокНаОбъекты.Вставить("СсылкаНаОбъект", Неопределено);
	ПорядокСозданияТиповОбъектов = Новый ТаблицаЗначений;
	ПорядокСозданияТиповОбъектов.Колонки.Добавить("ТипОбъекта");
	ПорядокСозданияТиповОбъектов.Колонки.Добавить("Порядок");
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьТаблицуПорядкаСозданияТиповОбъектов(ПорядокСозданияТиповОбъектов);
	Для Каждого СтрокаТипОбъекта Из ПорядокСозданияТиповОбъектов Цикл
		НайденнаяСтрокаТипа = ДеревоРазбора.Строки.Найти(СтрокаТипОбъекта.ТипОбъекта, "ТипОбъекта");
		Если НайденнаяСтрокаТипа = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		// Всегда будет перезаполнять Номенклатуру поставщика
		Если СтрокаТипОбъекта.ТипОбъекта = "НоменклатураПоставщиков" Тогда
			Для Каждого СтрокаОбъекта Из НайденнаяСтрокаТипа.Строки Цикл
				СсылкаНаОбъект = Неопределено;
				ОбменСКонтрагентамиПереопределяемый.СоздатьОбъектВБД(СтрокаОбъекта, ДеревоРазбора, СсылкаНаОбъект);
				Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
					СтрокаОбъекта.СсылкаНаОбъект = СсылкаНаОбъект;
				Иначе
					Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Ошибка создания элемента справочника ""%1""'"), СтрокаТипОбъекта.ТипОбъекта);
					ОбщегоНазначения.СообщитьПользователю(Текст);
					Ошибка = Истина;
					Возврат;
				КонецЕсли;
			КонецЦикла;
		Иначе
			СтрокиБезСсылокНаОбъекты = НайденнаяСтрокаТипа.Строки.НайтиСтроки(ОтборБезСсылокНаОбъекты);
			Для Каждого СтрокаОбъекта Из СтрокиБезСсылокНаОбъекты Цикл
				СсылкаНаОбъект = Неопределено;
				ОбменСКонтрагентамиПереопределяемый.СоздатьОбъектВБД(СтрокаОбъекта, ДеревоРазбора, СсылкаНаОбъект);
				Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
					СтрокаОбъекта.СсылкаНаОбъект = СсылкаНаОбъект;
				Иначе
					Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Ошибка создания элемента справочника ""%1""'"), СтрокаТипОбъекта.ТипОбъекта);
					ОбщегоНазначения.СообщитьПользователю(Текст);
					Ошибка = Истина;
					Возврат;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Требуется для получения имени документа для открытия форм по способу обработки входящего документа.
//
// Параметры:
//  СпособОбработки	 - Строка - один из способов обработки входящего электронного документа.
// 
// Возвращаемое значение:
//  Строка - имя объекта метаданных (документа), соответствующего способу обработки.
//
Функция ИмяДокументаПоСпособуОбработки(СпособОбработки) Экспорт 
		
	ИмяДокумента = СпособОбработки; 
	
	ОбменСКонтрагентамиПереопределяемый.ИмяОбъектаМетаданныхПоСпособуОтраженияВУчете(СпособОбработки,ИмяДокумента);
		
	Возврат ИмяДокумента;
	
КонецФункции

// Требуется для получения описания типа объекта по способу обработки.
//
// Параметры:
//  СпособОбработки	 - Строка - один из способов обработки входящего электронного документа.
// 
// Возвращаемое значение:
//  ОписаниеТипа - описание типа объекта, соответствующего способу обработки.
//
Функция ОписаниеТипаОбъектаПоСпособуОбработки(СпособОбработки) Экспорт 
		
	ИмяТипа = ИнтеграцияЭДО.ИмяДокументаПоСпособуОбработки(СпособОбработки);
	
	Тип = Неопределено;
	Если Метаданные.Справочники.Найти(ИмяТипа) <> Неопределено Тогда
	
		Тип = "СправочникСсылка." + ИмяТипа;
	ИначеЕсли Метаданные.Документы.Найти(ИмяТипа) <> Неопределено Тогда
	
		Тип = "ДокументСсылка." + ИмяТипа;
	КонецЕсли;
		
	Возврат Новый ОписаниеТипов(Тип);
	
КонецФункции

#КонецОбласти

#Область ПрикладныеФорматы

Функция ПрикладныеФорматыЭлектронныхДокументов() Экспорт
	
	ТаблицаФорматов = Новый ТаблицаЗначений;
	
	ТаблицаФорматов.Колонки.Добавить("ПрикладнойТипДокумента",
		Метаданные.ОпределяемыеТипы.ПрикладныеТипыЭлектронныхДокументовЭДО.Тип);
	
	ТаблицаФорматов.Колонки.Добавить("ИдентификаторФормата"                    , Новый ОписаниеТипов("Строка"));
	ТаблицаФорматов.Колонки.Добавить("ПредставлениеФормата"                    , Новый ОписаниеТипов("Строка"));
	ТаблицаФорматов.Колонки.Добавить("Отключен"                                , Новый ОписаниеТипов("Булево"));
	ТаблицаФорматов.Колонки.Добавить("ДатаНачалаДействия"                      , Новый ОписаниеТипов("Дата"));
	ТаблицаФорматов.Колонки.Добавить("ДатаОкончанияДействия"                   , Новый ОписаниеТипов("Дата"));
	ТаблицаФорматов.Колонки.Добавить("УсловиеВыводаПредупреждения"             , Новый ОписаниеТипов("Строка"));
	ТаблицаФорматов.Колонки.Добавить("ТекстПредупрежденияДляВходящегоДокумента", Новый ОписаниеТипов("Строка"));
	
	ОбменСКонтрагентамиПереопределяемый.ПриОпределенииСведенийОПрикладныхФорматах(ТаблицаФорматов);
	
	Возврат ТаблицаФорматов;
	
КонецФункции

// Определяет настройки регламента для прикладных типов электронных документов.
//
// Параметры:
//  ПрикладнойТипДокумента - ОпределяемыйТип.ПрикладныеТипыЭлектронныхДокументовЭДО - Ссылка на прикладной тип электронного документа.
//  Формат            - Строка - Текстовый идентификатор формата соответствующего прикладного вида электронного документа.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//     * ТребуетсяИзвещениеОПолучении - Булево - По данному признаку, на стороне получателя определяется необходимость отправки извещения о получении.
//     * ТребуетсяОтветнаяПодпись     - Булево - По данному признаку, на стороне получателя определяется, требуется ответное подписание документа.
//     * РедактироватьПодпись         - Булево - Признак редактирования параметра "Подписывать документ" в форме настроек регламента ЭДО.
//     * РедактироватьИзвещение       - Булево - Признак редактирования параметра "Ожидать извещение о получении" в форме настроек регламента ЭДО.
//     * РедактироватьОтветнуюПодпись - Булево - Признак редактирования параметра "Ожидать ответную подпись" в форме настроек регламента ЭДО.
//
Функция НастройкиРегламентаПрикладногоФормата(ПрикладнойТипДокумента, Формат) Экспорт
		
	Настройки = Новый Структура;
	Настройки.Вставить("ТребуетсяИзвещениеОПолучении");
	Настройки.Вставить("ТребуетсяОтветнаяПодпись");
	Настройки.Вставить("РедактироватьПодпись");
	Настройки.Вставить("РедактироватьИзвещение");
	Настройки.Вставить("РедактироватьОтветнуюПодпись");
	
	СтандартнаяОбработка = Истина;
	ОбменСКонтрагентамиПереопределяемый.ПриОпределенииНастроекРегламентаЭДО(Настройки,
		ПрикладнойТипДокумента, Формат, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		Настройки.Вставить("ТребуетсяИзвещениеОПолучении", Истина);
		Настройки.Вставить("ТребуетсяОтветнаяПодпись",     Истина);
		Настройки.Вставить("РедактироватьПодпись",         Ложь);
		Настройки.Вставить("РедактироватьИзвещение",       Истина);
		Настройки.Вставить("РедактироватьОтветнуюПодпись", Истина);
	КонецЕсли;
	
	Возврат Настройки;
	
КонецФункции

#КонецОбласти

#Область ОбработкаСобытий

// См. ЭлектронныеДокументыЭДОСобытия.ПослеЗагрузкиПодтвержденияПоСчетуФактуре
//
Процедура ПослеЗагрузкиПодтвержденияПоСчетуФактуре(ЭлектронныйДокумент, ДокументыПодтверждения, КонтекстДиагностики) Экспорт
	
	ОбъектыУчета = ОбъектыУчетаЭлектронныхДокументов(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЭлектронныйДокумент)).ВыгрузитьКолонку("ОбъектУчета");
	
	СостояниеОбработки = Новый Структура;
	СостояниеОбработки.Вставить("ПДППолучен", Ложь);
	СостояниеОбработки.Вставить("ДатаПоступленияСФОператоруОтПродавца", Дата(1,1,1));
	СостояниеОбработки.Вставить("ПДОПолучен", Ложь);
	СостояниеОбработки.Вставить("ДатаОтправкиСФПокупателюОператором", Дата(1,1,1));
	СостояниеОбработки.Вставить("ИОППолучен", Ложь);
	СостояниеОбработки.Вставить("ИОППДОПолучен", Ложь);
	
	Событие = "";
	
	Для Каждого СвойстваДокумента Из ДокументыПодтверждения Цикл
		
		Если СвойстваДокумента.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПДП Тогда
			СостояниеОбработки.ПДППолучен = Истина;
			СостояниеОбработки.ДатаПоступленияСФОператоруОтПродавца = СвойстваДокумента.Дата;
			Если СвойстваДокумента.Текущий Тогда
				Событие = "ПолученПДП"
			КонецЕсли;
		ИначеЕсли СвойстваДокумента.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПДО Тогда
			СостояниеОбработки.ПДОПолучен = Истина;
			СостояниеОбработки.ДатаОтправкиСФПокупателюОператором = СвойстваДокумента.Дата;
			Если СвойстваДокумента.Текущий Тогда
				Событие = "ПолученПДО"
			КонецЕсли;
		ИначеЕсли СвойстваДокумента.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИОП Тогда
			СостояниеОбработки.ИОППолучен = Истина;
			Если СвойстваДокумента.Текущий Тогда
				Событие = "ПолученИоП"
			КонецЕсли;
		ИначеЕсли СвойстваДокумента.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИОП_ПДО Тогда
			СостояниеОбработки.ИОППДОПолучен = Истина;
			Если СвойстваДокумента.Текущий Тогда
				Событие = "ПолученИоППДО"
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбменСКонтрагентамиПереопределяемый.ПослеВозникновенииСобытияПоЭлектронномуСчетуФактуре(
		ОбъектыУчета, Событие, СостояниеОбработки);
	
КонецПроцедуры

// См. ЭлектронныеДокументыЭДОСобытия.ПослеФормированияЭлектронногоДокумента
//
Процедура ПослеФормированияЭлектронногоДокумента(ЭлектронныйДокумент, КонтекстДиагностики) Экспорт
	ОбменСКонтрагентамиПереопределяемый.ПослеФормированияЭлектронногоДокумента(ЭлектронныйДокумент);
КонецПроцедуры

// См. ЭлектронныеДокументыЭДОСобытия.ПослеУтвержденияЭлектронногоДокумента
//
Процедура ПослеУтвержденияЭлектронногоДокумента(ЭлектронныйДокумент, КонтекстДиагностики) Экспорт
	ОбменСКонтрагентамиПереопределяемый.ПослеУтвержденияЭлектронногоДокумента(ЭлектронныйДокумент);
КонецПроцедуры

// См. ЭлектронныеДокументыЭДОСобытия.ПослеПодписанияЭлектронногоДокумента
//
Процедура ПослеПодписанияЭлектронногоДокумента(ЭлектронныйДокумент, КонтекстДиагностики) Экспорт
	ОбменСКонтрагентамиПереопределяемый.ПослеПодписанияЭлектронногоДокумента(ЭлектронныйДокумент);
КонецПроцедуры

// См. ЭлектронныеДокументыЭДОСобытия.ПослеЗавершенияОбменаЭлектроннымДокументом
//
Процедура ПослеЗавершенияОбменаЭлектроннымДокументом(ЭлектронныйДокумент, КонтекстДиагностики) Экспорт
	ОбменСКонтрагентамиПереопределяемый.ПослеЗавершенияОбменаЭлектроннымДокументом(ЭлектронныйДокумент);
КонецПроцедуры

// См. ЭлектронныеДокументыЭДОСобытия.ПослеАннулированияЭлектронногоДокумента
//
Процедура ПослеАннулированияЭлектронногоДокумента(ЭлектронныйДокумент, КонтекстДиагностики) Экспорт	
	ОбменСКонтрагентамиПереопределяемый.ПослеАннулированияЭлектронногоДокумента(ЭлектронныйДокумент);	
КонецПроцедуры

#КонецОбласти

#Область НастройкиРаботыБиблиотеки

// Определяет, включать ли прием информационной базой уведомлений от сервиса ЭДО.
// В случае, если использование включено, необходимо обеспечить доступность HTTP-сервиса /hs/events/newdocs.
// В частности, при публикации прикладного решения в модели сервиса необходимо опубликовать HTTP-сервис "ЭДО" с basic-авторизацией.
// Логин и пароль пользователя указаны в методе ОбменСКонтрагентами.СоздатьСлужебногоПользователяОповещенийЭДО.
// 
// Возвращаемое значение:
//  Булево - если истина, то оповещения используются.
//
Функция ИспользоватьОповещенияОтСервисаЭДО() Экспорт
	
	Использовать = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ПриПроверкеИспользованияУведомлений(Использовать);
	
	Возврат Использовать;
	
КонецФункции

Функция ИспользоватьОбменЭлектроннымиДокументамиМеждуОрганизациями() Экспорт
	
	Отказ = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ИспользоватьОбменЭДМеждуОрганизациями(Отказ);
	
	Возврат Не Отказ;
	
КонецФункции

Функция РазрешеноИспользоватьВнутреннийЭДО() Экспорт
	
	Использовать = Истина;
	ОбменСКонтрагентамиПереопределяемый.РазрешеноИспользоватьВнутреннийЭДО(Использовать);
	Возврат Использовать;
	
КонецФункции

Функция ДоступноИспользованиеВнутреннегоЭДО() Экспорт
	
	Результат = Ложь;
	
	Для каждого Тип Из Метаданные.ОпределяемыеТипы.ОснованияЭлектронныхДокументовЭДО.Тип.Типы() Цикл
		СтроковоеПредставлениеТипа = ОбщегоНазначения.СтроковоеПредставлениеТипа(Тип);
		ОписаниеТипов = Новый ОписаниеТипов(СтроковоеПредставлениеТипа);
		ПустаяСсылка = ОписаниеТипов.ПривестиЗначение();
		Попытка
			ОписаниеОбъекта = ИнтеграцияЭДО.ОписаниеОбъектаУчета(ПустаяСсылка);
			Если ОписаниеОбъекта.Направление = Перечисления.НаправленияЭДО.Внутренний Тогда
				Результат = Истина;
				Прервать;
			КонецЕсли;
		Исключение
			ИмяСобытия = НСтр("ru = 'Получение идентификаторов объектов учета внутреннего электронного документа'",
				ОбщегоНазначения.КодОсновногоЯзыка());
			ТекстОшибки = СтроковоеПредставлениеТипа + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		КонецПопытки;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область КонтрольДоступа

// См. ЭлектронноеВзаимодействие.ПриЗаполненииСписковСОграничениемДоступа
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт

	Списки.Вставить(Метаданные.РегистрыСведений.СостоянияПоОбъектамУчетаЭДО, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.АктуальныеДокументыЭДО, Истина);
	
КонецПроцедуры

// См. ЭлектронноеВзаимодействие.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|РегистрСведений.СостоянияПоОбъектамУчетаЭДО.Чтение.Организации
	|РегистрСведений.АктуальныеДокументыЭДО.Чтение.Организации
	|";
	
КонецПроцедуры

#КонецОбласти

#Область Обновление

// См. ЭлектронноеВзаимодействие.ПриДобавленииОбработчиковОбновления.
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
#Область Версия_1_9_1

#Область РегистрыСведений_КонтрольОтраженияВУчетеЭДО_ОбработатьДанныеДляПереходаНаНовуюВерсию

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.4.1.23";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "РегистрыСведений.КонтрольОтраженияВУчетеЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("09e42776-c28d-4877-bd17-47346f568300");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.КонтрольОтраженияВУчетеЭДО.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "";
	Обработчик.ЧитаемыеОбъекты = "Документ.ЭлектронныйДокументВходящийЭДО,"
		+ "РегистрСведений.КонтрольОтраженияВУчетеЭДО";
	Обработчик.ИзменяемыеОбъекты = "РегистрСведений.КонтрольОтраженияВУчетеЭДО";
	Обработчик.БлокируемыеОбъекты = "";
	Обработчик.Комментарий = НСтр("ru = '1С:Обмен с контрагентами: обновление контроля отражения в учете электронных документов.
	|Раздел """"Отразить в учете"""" в текущих делах ЭДО может быть заполнен не полностью.'");
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ЭлектронныйДокументВходящийЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "Любой";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РаботаСФайлами.ПеренестиЭлектронныеПодписиИСертификатыШифрованияВРегистрыСведений";
	НоваяСтрока.Порядок = "Любой";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Справочники.СообщениеЭДОПрисоединенныеФайлы.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

#КонецОбласти

#Область РегистрыСведений_СостоянияПоОбъектамУчетаЭДО_ОбработатьДанныеДляПереходаНаНовуюВерсию

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.9.1.1";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "РегистрыСведений.СостоянияПоОбъектамУчетаЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d0203f00-4071-4c8a-b9a0-f9193b1ccd7e");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.СостоянияПоОбъектамУчетаЭДО.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.ЧитаемыеОбъекты = "РегистрСведений.АктуальныеДокументыЭДО," +
		"РегистрСведений.СостоянияПоОбъектамУчетаЭДО," +
		"Документ.ЭлектронныйДокументВходящийЭДО," + 
		"Документ.ЭлектронныйДокументИсходящийЭДО";
	Обработчик.ИзменяемыеОбъекты = "РегистрСведений.АктуальныеДокументыЭДО";
	Обработчик.БлокируемыеОбъекты = "РегистрСведений.АктуальныеДокументыЭДО," +
		"РегистрыСведений.СостоянияПоОбъектамУчетаЭДО";
	Обработчик.Комментарий = НСтр("ru = '1С:Обмен с контрагентами: преобразование данных об актуальных ЭД.
		|Настройка и обмен электронными документами с контрагентами временно невозможен.'");
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();	
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ЭлектронныйДокументВходящийЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ЭлектронныйДокументИсходящийЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";	
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Справочники.СообщениеЭДОПрисоединенныеФайлы.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы._ДемоОперация.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

#КонецОбласти

#КонецОбласти
	
КонецПроцедуры

#КонецОбласти

Функция ОписаниеТиповОснованийЭлектронныхДокументов() Экспорт
	Возврат Метаданные.ОпределяемыеТипы.ОснованияЭлектронныхДокументовЭДО.Тип;
КонецФункции

Функция ОписаниеТиповПрикладныхЭлектронныхДокументов() Экспорт
	Возврат Метаданные.ОпределяемыеТипы.ПрикладныеТипыЭлектронныхДокументовЭДО.Тип;
КонецФункции

Функция ОписаниеОбъектовУчетаВнутреннихЭлектронныхДокументов() Экспорт
	
	Возврат ИнтеграцияЭДОПовтИсп.ОписаниеОбъектовУчетаВнутреннихЭлектронныхДокументов();
	
КонецФункции

// Возвращает признак использования прямого обмена в прикладном решении.
//
// Возвращаемое значение:
//  Булево - Истина, если используется, иначе Ложь.
//
Функция ИспользоватьПрямойОбмен() Экспорт
	
	ИспользоватьПрямойОбмен = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ИспользоватьПрямойОбмен(ИспользоватьПрямойОбмен);
	
	Возврат ИспользоватьПрямойОбмен;
	
КонецФункции

// Возвращает признак использования договоров контрагентов в прикладном решении.
Функция ИспользуютсяДоговорыКонтрагентов() Экспорт
	Возврат ИнтеграцияЭДОПовтИсп.ИспользуютсяДоговорыКонтрагентов();
КонецФункции

Функция ЕстьПравоОткрытияЖурналаРегистрации() Экспорт
	
	ЕстьПравоОткрытияЖурналаРегистрации = Ложь;
	ЭлектронноеВзаимодействиеПереопределяемый.ЕстьПравоОткрытияЖурналаРегистрации(ЕстьПравоОткрытияЖурналаРегистрации);
	Возврат ЕстьПравоОткрытияЖурналаРегистрации;
	
КонецФункции

// Возвращает доступные профили настроек отражения входящих документов.
//
// Возвращаемое значение:
//  Структура - Доступные профили.
//
Функция ПрофилиНастроекОтраженияВходящихДокументов() Экспорт
	
	ПрофилиНастроек = Новый Структура;	
	ПрофилиНастроек.Вставить("Автоматически", "Автоматически");
	ПрофилиНастроек.Вставить("Вручную", "Вручную");
	ПрофилиНастроек.Вставить("НеОтражать", "НеОтражать");
	ПрофилиНастроек.Вставить("Поставщик", "Поставщик");
	ПрофилиНастроек.Вставить("Покупатель", "Покупатель");
	ПрофилиНастроек.Вставить("ПервоначальноеЗаполнение", "ПервоначальноеЗаполнение");
	
	Возврат ПрофилиНастроек;
	
КонецФункции

Функция ТаблицаПредопределенногоПрофиля(Профиль) Экспорт 
	
	ДоступныеПрофили = ПрофилиНастроекОтраженияВходящихДокументов();
	
	ТаблицаПрофиля = Новый ТаблицаЗначений;
	ТаблицаПрофиля.Колонки.Добавить("ТипДокумента", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыДокументовЭДО"));
	ТаблицаПрофиля.Колонки.Добавить("ПрикладнойТипДокумента", ОписаниеТиповПрикладныхЭлектронныхДокументов());
	ТаблицаПрофиля.Колонки.Добавить("СпособОбработки", Новый ОписаниеТипов("Строка"));
	
	ИсключаемыеТипы = Новый Массив;
	ИсключаемыеТипы.Добавить(Перечисления.ТипыДокументовЭДО.УПД);
	ИсключаемыеТипы.Добавить(Перечисления.ТипыДокументовЭДО.УКД);
	
	ИспользуемыеТипыДокументов = ИспользуемыеТипыДокументов();
	
	ТипыДокументов = Новый Массив;
	Для Каждого КлючИЗначение Из ИспользуемыеТипыДокументов Цикл
		ТипДокумента = КлючИЗначение.Ключ;
		
		Если ИсключаемыеТипы.Найти(ТипДокумента) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЭлектронныеДокументыЭДО.ЭтоТипДокументаИнтеркампани(ТипДокумента)
			И КлючИЗначение.Значение.ИспользоватьДляВходящих Тогда
			
			ТипыДокументов.Добавить(ТипДокумента);
		КонецЕсли;
	КонецЦикла; 
	
	Для Каждого ТипДокумента Из ТипыДокументов Цикл
		СписокОпераций = СписокОперацийТипаДокумента(ТипДокумента, Истина);
		
		Для Каждого ЭлементСписка Из СписокОпераций Цикл
			Если ЭлементСписка.Пометка Тогда
				СпособОбработки = ЭлементСписка.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Профиль = ДоступныеПрофили.Вручную Тогда
			СпособОбработки = СпособОбработки_Вручную();
		ИначеЕсли Профиль = ДоступныеПрофили.НеОтражать Тогда
			СпособОбработки = СпособОбработки_НеОтражать();
			
		ИначеЕсли Профиль = ДоступныеПрофили.ПервоначальноеЗаполнение И СписокОпераций.Количество() > 3 Тогда
			СпособОбработки = СпособОбработки_Вручную();
		ИначеЕсли Профиль = ДоступныеПрофили.Поставщик Тогда
			Если ТипДокумента = Перечисления.ТипыДокументовЭДО.ЗаказТовара 
				ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.ВозвратТоваровМеждуОрганизациями 
				ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.ПередачаТоваровМеждуОрганизациями 
				ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.ОтчетОПродажахКомиссионногоТовара 
				ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.ОтчетОСписанииКомиссионногоТовара Тогда
				
				СпособОбработки = СпособОбработки_Вручную();
			КонецЕсли;
		ИначеЕсли Профиль = ДоступныеПрофили.Покупатель Тогда
			Если ТипДокумента = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная
				ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетФактура 
				ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.УПД 
				ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.УКД 
				ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетНаОплату 
				ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости 
				ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот 
				ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.АктНаПередачуПрав 
				ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.ВозвратТоваровМеждуОрганизациями
				ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.КаталогТоваров
				ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура
				ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.ОтветНаЗаказ Тогда
				
				СпособОбработки = СпособОбработки_Вручную();
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаПрофиля.Добавить();
		НоваяСтрока.ТипДокумента       = ТипДокумента;
		НоваяСтрока.СпособОбработки    = СпособОбработки;
	КонецЦикла;
	
	ПрикладныеТипыДокументов = ПрикладныеТипыЭлектронныхДокументов();
	Если ЗначениеЗаполнено(ПрикладныеТипыДокументов) Тогда
		Для Каждого ПрикладнойТипДокумента Из ПрикладныеТипыДокументов Цикл
			СписокОпераций = СписокОперацийТипаДокумента(ПрикладнойТипДокумента, Истина);
			
			Для Каждого ЭлементСписка Из СписокОпераций Цикл
				Если ЭлементСписка.Пометка Тогда
					СпособОбработки = ЭлементСписка.Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если Профиль = ДоступныеПрофили.Вручную Тогда
				СпособОбработки = СпособОбработки_Вручную();
			ИначеЕсли Профиль = ДоступныеПрофили.НеОтражать Тогда
				СпособОбработки = СпособОбработки_НеОтражать();			
			ИначеЕсли Профиль = ДоступныеПрофили.ПервоначальноеЗаполнение И СписокОпераций.Количество() > 3 Тогда
				Если Не ЗначениеЗаполнено(СпособОбработки) Тогда
					СпособОбработки = СпособОбработки_Вручную();
				КонецЕсли;				
			КонецЕсли;
			
			НоваяСтрока = ТаблицаПрофиля.Добавить();
			НоваяСтрока.ТипДокумента = Перечисления.ТипыДокументовЭДО.Прикладной;
			НоваяСтрока.ПрикладнойТипДокумента = ПрикладнойТипДокумента;
			НоваяСтрока.СпособОбработки = СпособОбработки;
			
		КонецЦикла;
	КонецЕсли;
		
	ОбменСКонтрагентамиПереопределяемый.ТаблицаПредопределенногоПрофиля(ТаблицаПрофиля, Профиль);
	
	Возврат ТаблицаПрофиля;	
	
КонецФункции

Функция СуществуетДокументСоСтатусомОтраженияВУчете(Статус) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЭлектронныеДокументы.Ссылка КАК ЭлектронныйДокумент
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтрольОтраженияВУчетеЭДО КАК КонтрольОтраженияВУчетеЭДО
		|		ПО ЭлектронныеДокументы.Ссылка = КонтрольОтраженияВУчетеЭДО.ЭлектронныйДокумент
		|ГДЕ
		|	НЕ ЭлектронныеДокументы.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА КонтрольОтраженияВУчетеЭДО.СопоставитьНоменклатуру
		|				ТОГДА ""СопоставитьНоменклатуру""
		|			КОГДА КонтрольОтраженияВУчетеЭДО.СоздатьУчетныйДокумент
		|				ТОГДА ""СоздатьУчетныйДокумент""
		|			КОГДА КонтрольОтраженияВУчетеЭДО.ПровестиУчетныйДокумент
		|				ТОГДА ""ПровестиУчетныйДокумент""
		|			ИНАЧЕ """"
		|		КОНЕЦ = &Статус";
	
	Запрос.УстановитьПараметр("Статус", Статус);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Функция СостоянияКонтроляОтраженияВУчете() Экспорт
	
	СостоянияКонтроля = Новый Структура;
	
	СостоянияКонтроля.Вставить("СопоставитьНоменклатуру", "СопоставитьНоменклатуру");
	СостоянияКонтроля.Вставить("СоздатьУчетныйДокумент",  "СоздатьУчетныйДокумент");
	СостоянияКонтроля.Вставить("ПровестиУчетныйДокумент", "ПровестиУчетныйДокумент");
	
	Возврат СостоянияКонтроля;
	
КонецФункции

Функция СтатусКонтроляОтраженияВУЧете(ЭлектронныйДокумент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА КонтрольОтраженияВУчетеЭДО.СопоставитьНоменклатуру
		|			ТОГДА ""СопоставитьНоменклатуру""
		|		КОГДА КонтрольОтраженияВУчетеЭДО.СоздатьУчетныйДокумент
		|			ТОГДА ""СоздатьУчетныйДокумент""
		|		КОГДА КонтрольОтраженияВУчетеЭДО.ПровестиУчетныйДокумент
		|			ТОГДА ""ПровестиУчетныйДокумент""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Статус
		|ИЗ
		|	РегистрСведений.КонтрольОтраженияВУчетеЭДО КАК КонтрольОтраженияВУчетеЭДО
		|ГДЕ
		|	КонтрольОтраженияВУчетеЭДО.ЭлектронныйДокумент = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЭлектронныйДокумент);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Статус;
	КонецЦикла;

	Возврат "";
	
КонецФункции

Функция ПриВыводеНавигационнойСсылкиВФормеОбъектаИБ(ДополнительнаяИнформация, МассивСсылок) Экспорт
	
	Если Не ЗначениеЗаполнено(МассивСсылок) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не НастройкиЭДО.ЕстьПравоНастройкиОбмена() Тогда
		Возврат "";
	КонецЕсли;

	ОписаниеОбъектаУчета = ОписаниеОбъектаУчета(МассивСсылок[0]);
	КлючНастроек = ЭлектронныеДокументыЭДО.КлючНастроекОтправкиОбъектаУчета(ОписаниеОбъектаУчета);
	Настройки = НастройкиЭДО.НастройкиОтправки(КлючНастроек);

	Если Настройки = Неопределено Или СтатусПриглашения(Настройки) = Перечисления.СтатусыПриглашений.Отклонено Тогда
		
		ТекстНавигационнойСсылки = "";
		ЗаполнитьТекстПриглашенияКЭДО(ТекстНавигационнойСсылки, ОписаниеОбъектаУчета, Ложь);
		Если ЗначениеЗаполнено(ТекстНавигационнойСсылки) Тогда
			ШаблонНавигационнойСсылки = НСтр("ru = '<a href = ""Реклама1СЭДО"">%1</a>'");
			ДополнительнаяИнформация.Текст    = СтрШаблон(ШаблонНавигационнойСсылки, ТекстНавигационнойСсылки);
			ДополнительнаяИнформация.Картинка = БиблиотекаКартинок.ЭмблемаСервиса1СЭДО;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// Заполняет текст приглашения контрагента к ЭДО.
//
// Параметры:
//  ТекстПриглашения - Строка- заполняемый текст надписи формы.
//  ОписаниеОбъектаУчета - См. ОписаниеОбъектаУчета.
//  Гиперссылка - Булево - определяет отображать ли надпись на форме как гиперссылку.
//
Процедура ЗаполнитьТекстПриглашенияКЭДО(ТекстПриглашения, ОписаниеОбъектаУчета, Гиперссылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОписаниеОбъектаУчета.ТипДокумента = Перечисления.ТипыДокументовЭДО.ПередачаТоваровМеждуОрганизациями
		Или ОписаниеОбъектаУчета.ТипДокумента = Перечисления.ТипыДокументовЭДО.ВозвратТоваровМеждуОрганизациями Тогда
		
		ТекстПриглашения = НСтр("ru = 'Нет действующей настройки ЭДО с организацией-получателем'");
	ИначеЕсли ЗначениеЗаполнено(ОписаниеОбъектаУчета.Контрагент) Тогда
		
		Гиперссылка = Истина;
		
		Если ОписаниеОбъектаУчета.Направление = Перечисления.НаправленияЭДО.Входящий Тогда
			ШаблонТекстаНавигационнойСсылки = НСтр("ru = 'Пригласить %1 к обмену электронными документами в 1С-ЭДО'");
		Иначе
		    ШаблонТекстаНавигационнойСсылки = НСтр("ru = 'Начать обмен электронными документами с %1'");
		КонецЕсли;
		
		ТекстПриглашения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаНавигационнойСсылки, ОписаниеОбъектаУчета.Контрагент);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОтвественныйПоДокументуЭДО(Организация, Контрагент, Договор) Экспорт
	
	Ответственный = Неопределено;
	ОбменСКонтрагентамиПереопределяемый.ПолучитьОтветственногоПоЭД(Контрагент, Организация, Договор, Ответственный);
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	Возврат Ответственный;
	
КонецФункции

Функция ПустойПрикладнойТипЭлектронногоДокумента() Экспорт
	Возврат Метаданные.ОпределяемыеТипы.ПрикладныеТипыЭлектронныхДокументовЭДО.Тип.ПривестиЗначение();
КонецФункции

Функция КомандыПечатиДляВнутреннегоЭДО(ОбъектМетаданных) Экспорт
	
	ДоступныеКоманды = УправлениеПечатью.СоздатьКоллекциюКомандПечати();
	
	КомандыПечати = ИнтеграцияБСПБЭД.КомандыПечатиСМенеджерамиПечати(ОбъектМетаданных);
	ЗапрещенныеКоманды = Новый Массив;
	ОбменСКонтрагентамиПереопределяемый.ПриОпределенииПечатныхФормЗапрещенныхДляВнутреннегоДокументооборота(ЗапрещенныеКоманды);
	
	Для Каждого КомандаПечати Из КомандыПечати Цикл
		Если ЗапрещенныеКоманды.Найти(КомандаПечати.Идентификатор) = Неопределено Тогда
			СтрокаКоманды = ДоступныеКоманды.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКоманды, КомандаПечати);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДоступныеКоманды;
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСТипамиДокументовСлужебная

Функция ВидДокументаПоТипу(Тип)
	
	Если ТипЗнч(Тип) = Тип("ПеречислениеСсылка.ТипыДокументовЭДО") Тогда
		Результат = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(Тип);
	Иначе // это прикладной тип документа
		Результат = ЭлектронныеДокументыЭДО.ВидДокументаПоПрикладномуТипу(Тип); 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТипСкорректированныйПоПрикладнымНастройкам(ПараметрыИсточника, ВариантФормированияУниверсальныхДокументов)
	
	ТипДокумента = ПараметрыИсточника.Тип;
	
	КорректируемыеТипыДокументовУПД = Новый Массив;
	КорректируемыеТипыДокументовУПД.Добавить(Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная);
	КорректируемыеТипыДокументовУПД.Добавить(Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот);
	КорректируемыеТипыДокументовУПД.Добавить(Перечисления.ТипыДокументовЭДО.АктНаПередачуПрав);	
	КорректируемыеТипыДокументовУПД.Добавить(Перечисления.ТипыДокументовЭДО.СчетФактура);
	
	КорректируемыеТипыДокументовУКД = Новый Массив;
	КорректируемыеТипыДокументовУКД.Добавить(Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости);
	КорректируемыеТипыДокументовУКД.Добавить(Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура);
	
	ВариантыФормированияУниверсальныхДокументов = ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов();
	
	Если Не ЗначениеЗаполнено(ВариантФормированияУниверсальныхДокументов) Тогда
		ВариантФормированияУниверсальныхДокументов = ВариантыФормированияУниверсальныхДокументов.Разрешено;	
	КонецЕсли;
		
	Если ВариантФормированияУниверсальныхДокументов = ВариантыФормированияУниверсальныхДокументов.Обязательно Тогда
		
		Если КорректируемыеТипыДокументовУПД.Найти(ТипДокумента) <> Неопределено Тогда
			ТипДокумента = Перечисления.ТипыДокументовЭДО.УПД;
		ИначеЕсли КорректируемыеТипыДокументовУКД.Найти(ТипДокумента) <> Неопределено Тогда
			ТипДокумента = Перечисления.ТипыДокументовЭДО.УКД;
		КонецЕсли;
		
	ИначеЕсли ВариантФормированияУниверсальныхДокументов = ВариантыФормированияУниверсальныхДокументов.Разрешено Тогда
		
		ИспользованиеУПД_УКД = НастройкиЭДО.ИспользуетсяУПД_УКД(ПараметрыИсточника.Организация,
			ПараметрыИсточника.Контрагент, ПараметрыИсточника.ДоговорКонтрагента);
		
		Если КорректируемыеТипыДокументовУПД.Найти(ТипДокумента) <> Неопределено 
			И ИспользованиеУПД_УКД.ИспользуетсяУПД Тогда
				
			ТипДокумента = Перечисления.ТипыДокументовЭДО.УПД;
			
		ИначеЕсли КорректируемыеТипыДокументовУКД.Найти(ТипДокумента) <> Неопределено
			И ИспользованиеУПД_УКД.ИспользуетсяУКД Тогда
				
			ТипДокумента = Перечисления.ТипыДокументовЭДО.УКД;
			
		КонецЕсли;	
			
	КонецЕсли;
	
	Возврат ТипДокумента;
		
КонецФункции

#КонецОбласти

#Область ПодпискиНаСобытия

// Обработчик события "ПередЗаписью" документов, которые могут являтся основанием для исходящего электронного документа.
//
// Параметры:
//  Источник - Произвольный - источники подписки на событие ПередЗаписьюОбъектаДокументаЭДО.
//  Отказ - Булево - отказ от записи.
//  РежимЗаписи -  РежимЗаписиДокумента - режим записи.
//  РежимПроведения - РежимПроведенияДокумента - режим проведения.
//
Процедура ПередЗаписьюОбъектаДокументаЭДО(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбщегоНазначенияБЭД.ОбъектВРежимеОбменаДанными(Источник)
		ИЛИ ОбщегоНазначенияБЭД.ОбъектВРежимеГрупповогоПерепроведения(Источник) 
		ИЛИ Не НастройкиЭДО.ИспользуетсяОбменЭлектроннымиДокументами() Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОбъектаУчета = ОписаниеОбъектаУчета(Источник); 
	
	Если ОписаниеОбъектаУчета.Направление = Перечисления.НаправленияЭДО.Входящий Тогда
		Возврат;	
	КонецЕсли;
	
	Если Не ДокументооборотНастроен(Источник) Тогда
		Возврат;	
	КонецЕсли;	
		
	ОписаниеИзменений = ОписаниеИзмененийОснованияЭлектронногоДокумента(Источник);
	Если ОписаниеИзменений.Отказ Тогда
		Отказ = Истина;
	КонецЕсли;	
		
	Если ОписаниеОбъектаУчета.Направление = Перечисления.НаправленияЭДО.Внутренний И 
		НастройкиЭДО.ИспользуютсяВнутренниеДокументы() И ОписаниеИзменений.ТребуетсяКонтрольАктуальности Тогда
		
		ЗапуститьПроверкуАктуальностиВнутреннегоЭД(Источник.Ссылка, Отказ);
		
	КонецЕсли;
	
	ДополнительныеСвойстваЭДО = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Источник.ДополнительныеСвойства, "ОбменСКонтрагентами", Новый Структура);
		
	ОписаниеИзменений.Вставить("ЭтоНовый", Источник.ЭтоНовый());
	ДополнительныеСвойстваЭДО.Вставить("ОписаниеИзменений", ОписаниеИзменений);
	Источник.ДополнительныеСвойства.Вставить("ОбменСКонтрагентами", ДополнительныеСвойстваЭДО);
	
КонецПроцедуры

// Обработчик события "ПриЗаписи" объектов, которые могут являтся основанием для исходящего электронного документа.
//
// Параметры:
//  Источник - Произвольный - источники подписки на событие ПриЗаписиОбъектаУчетаДокументаЭДО.
//  Отказ - Булево - отказ от записи.
//
Процедура ПриЗаписиОбъектаУчетаДокументаЭДО(Источник, Отказ) Экспорт
	
	ДополнительныеСвойстваЭДО = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Источник.ДополнительныеСвойства, "ОбменСКонтрагентами", Новый Структура);
	ОписаниеИзменений = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДополнительныеСвойстваЭДО, "ОписаниеИзменений", Неопределено);
	Если ОписаниеИзменений = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПриИзмененииОснованияЭлектронногоДокумента(Источник, ОписаниеИзменений);
	
КонецПроцедуры

// Обработчик события "При записи" учетного документ.
// Для электронных документов, связанных с данным учетным документом,
// выполняется контроль проведения учетных документов.
//
Процедура ВыполнитьКонтрольОтраженияВУчетеПриЗаписиУчетногоДокумента(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	УчетныйДокумент = Источник.Ссылка;
	
	НаборЭлектронныхДокументов = ЭлектронныеДокументыОбъектовУчета(УчетныйДокумент).ВыгрузитьКолонку("ЭлектронныйДокумент");
		
	ВходящиеДокументы = Новый Массив;	
		
	Для Каждого ЭлектронныйДокумент Из НаборЭлектронныхДокументов Цикл
		Если ТипЗнч(ЭлектронныйДокумент) = Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО") Тогда
			ВходящиеДокументы.Добавить(ЭлектронныйДокумент);
		КонецЕсли;
	КонецЦикла;
		
	Для Каждого Документ Из ВходящиеДокументы Цикл	
		ВыполнитьКонтрольПроведенияУчетныхДокументов(Документ);	
	КонецЦикла;
	
	Проверки = Новый Массив;
	Проверки.Добавить("ПровестиУчетныйДокумент");
	
	ВыполнитьКонтрольОтраженияВУчете(ВходящиеДокументы, Проверки);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Обработчик подписки на событие "При записи" регистра сведений НоменклатураКонтрагентовБЭД.
// Отключает контроль сопоставления по той номенклатуре контрагента, которой установлено соответствие с номенклатурой ИБ.
// Те электронные документы, которые содержали сопоставленные строки, проверяются повторно на наличие еще несопоставленных строк.
//
Процедура ВыполнитьКонтрольОтраженияВУчетеПриЗаписиНоменклатурыКонтрагентов(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураКонтрагентов.Владелец КАК Владелец,
	|	НоменклатураКонтрагентов.Идентификатор КАК Идентификатор,
	|	НоменклатураКонтрагентов.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втНоменклатураКонтрагентов
	|ИЗ
	|	&НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контроль.Владелец КАК Владелец,
	|	Контроль.Идентификатор КАК Идентификатор,
	|	втНоменклатураКонтрагентов.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.КонтрольСопоставленияНоменклатурыЭДО КАК Контроль
	|		ЛЕВОЕ СОЕДИНЕНИЕ втНоменклатураКонтрагентов КАК втНоменклатураКонтрагентов
	|		ПО Контроль.Владелец = втНоменклатураКонтрагентов.Владелец
	|			И Контроль.Идентификатор = втНоменклатураКонтрагентов.Идентификатор
	|ГДЕ
	|	&УсловиеПоВладельцу
	|	И &УсловиеПоИдентификатору";
	Запрос.УстановитьПараметр("НоменклатураКонтрагентов", Источник.Выгрузить());
	
	УсловиеПоВладельцу = "ИСТИНА";
	Если Источник.Отбор.Владелец.Использование Тогда
		УсловиеПоВладельцу = "Контроль.Владелец = &Владелец";
		Запрос.УстановитьПараметр("Владелец", Источник.Отбор.Владелец.Значение);
	КонецЕсли;
	УсловиеПоИдентификатору = "ИСТИНА";
	Если Источник.Отбор.Идентификатор.Использование Тогда
		УсловиеПоИдентификатору = "Контроль.Идентификатор = &Идентификатор";
		Запрос.УстановитьПараметр("Идентификатор", Источник.Отбор.Идентификатор.Значение);
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоВладельцу", УсловиеПоВладельцу);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоИдентификатору", УсловиеПоИдентификатору);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаОтключение = Новый Массив; 
	
	НеУдалятьЗапись = Ложь;
	Если Источник.ДополнительныеСвойства.Свойство("НеУдалятьЗапись") Тогда
		НеУдалятьЗапись = Источник.ДополнительныеСвойства.НеУдалятьЗапись;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		СопоставлениеВыполнено = ЗначениеЗаполнено(Выборка.Номенклатура) ИЛИ (Выборка.Номенклатура = NULL И НЕ НеУдалятьЗапись);
		Если СопоставлениеВыполнено Тогда
			НоменклатураКонтрагента = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагента();
			ЗаполнитьЗначенияСвойств(НоменклатураКонтрагента, Выборка);
			НаОтключение.Добавить(НоменклатураКонтрагента);
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЭлектронныхДокументов = ОтключитьКонтрольСопоставленияНоменклатурыКонтрагентов(НаОтключение);
	
	Проверки = Новый Массив;
	Проверки.Добавить("СопоставитьНоменклатуру");
	
	ВыполнитьКонтрольОтраженияВУчете(НаборЭлектронныхДокументов, Проверки);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#Область Контрагенты

// Подписка на событие. Добавление в регистр набора ИНН и КПП для последующей проверки регламентным заданием.
//
// Параметры:
//  КонтрагентОбъект - СправочникОбъект.<Контрагенты> - записываемый контрагент.
//  Отказ			 - Булево - Параметр обработчика подписки на событие.
Процедура КонтрагентПриЗаписи(Объект, Отказ) Экспорт 
	
	Если ОбщегоНазначенияБЭД.ОбъектВРежимеОбменаДанными(Объект) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПрикладногоСправочника = ИмяПрикладногоСправочника("Контрагенты");
	
	Если ОбщегоНазначенияБЭД.СправочникИспользуетГруппы(Метаданные.Справочники[ИмяПрикладногоСправочника])
		И Объект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
		
	ИнтеграцияЭДОСобытия.ПриЗаписиКонтрагента(Объект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СобытияУчета

// Инициализирует описание изменений основания электронного документа.
//
// Возвращаемое значение:
//  Структура - описание изменений основания электронного документа:
//   * ИзмененыКлючевыеДанные - Булево - признак изменения ключевых данных, влияющих на электронный документ.
//   * УчаствуетВОбмене - Булево - признак участия основания в документообороте.
//   * ТребуетсяКонтрольАктуальности - Булево - признак необходимости контроля актуальности библиотекой.
//   * Отказ - Булево - признак запрета изменений.
//
Функция НовоеОписаниеИзмененийОснованияЭлектронногоДокумента()
	
	ОписаниеИзменений = Новый Структура;
	ОписаниеИзменений.Вставить("ИзмененыКлючевыеДанные", Ложь);
	ОписаниеИзменений.Вставить("УчаствуетВОбмене", Ложь);
	ОписаниеИзменений.Вставить("ТребуетсяКонтрольАктуальности", Истина);
	ОписаниеИзменений.Вставить("Отказ", Ложь);
	
	Возврат ОписаниеИзменений;
	
КонецФункции

// Возвращает описание изменений основания электронного документа по ссылке и текущим данным объекта учета.
//
// Параметры:
//  ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
//
// Возвращаемое значение:
//  см. НовоеОписаниеИзмененийОснованияЭлектронногоДокумента
//
Функция ОписаниеИзмененийОснованияЭлектронногоДокумента(Знач ОбъектУчета)
	
	ИзмененыКлючевыеДанные = Не ЗначениеЗаполнено(ОбъектУчета.Ссылка);
	ТребуетсяКонтрольАктуальности = Истина;
	УчаствуетВОбмене = Истина;
	Отказ = Ложь;
	
	Состояние = ЭлектронныеДокументыЭДО.НачальноеСостояниеДокумента();
	ЭлектронныйДокумент = ОсновнойЭлектронныйДокументОбъектаУчета(ОбъектУчета.Ссылка);
	Если ЗначениеЗаполнено(ЭлектронныйДокумент) Тогда
		Состояние = ЭлектронныеДокументыЭДО.СостояниеДокумента(ЭлектронныйДокумент);
	КонецЕсли;
	
	ЭлектронноеВзаимодействиеПереопределяемый.ПередЗаписьюВладельцаЭлектронногоДокумента(
		ОбъектУчета, ИзмененыКлючевыеДанные, Состояние, УчаствуетВОбмене, ТребуетсяКонтрольАктуальности, Отказ);
	
	ОписаниеИзменений = НовоеОписаниеИзмененийОснованияЭлектронногоДокумента();
	ОписаниеИзменений.ИзмененыКлючевыеДанные = ИзмененыКлючевыеДанные;
	ОписаниеИзменений.УчаствуетВОбмене = УчаствуетВОбмене;
	ОписаниеИзменений.ТребуетсяКонтрольАктуальности = ТребуетсяКонтрольАктуальности;
	ОписаниеИзменений.Отказ = Отказ;
	
	Возврат ОписаниеИзменений;
	
КонецФункции

// Выполняется при изменении объекта учета, который может являться основанием для исходящего электронного документа.
// Вызывается внутри транзакции записи изменений.
//
// Параметры:
//  ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовОбъектЭДО
//  ОписаниеИзменений - см. НовоеОписаниеИзмененийОснованияЭлектронногоДокумента
//
Процедура ПриИзмененииОснованияЭлектронногоДокумента(Знач ОбъектУчета, Знач ОписаниеИзменений)
	
	Если ОписаниеИзменений.УчаствуетВОбмене Тогда
		
		Если ОписаниеИзменений.ИзмененыКлючевыеДанные Тогда
			
			Если ОписаниеИзменений.ЭтоНовый Тогда
				ОчиститьАктуальныйЭлектронныйДокумент(ОбъектУчета.Ссылка);	
				СброситьСостояниеЭлектронногоДокументаОбъектаУчета(ОбъектУчета.Ссылка);
				УстановитьОснованиеНовогоЭлектронногоДокумента(ОбъектУчета.Ссылка);
			Иначе
				ЗакрытьПринудительноЭлектронныйДокумент(ОбъектУчета);
			КонецЕсли;
			
		Иначе
			Если Не СостояниеОбъектаУчетаУстановлено(ОбъектУчета.Ссылка) Тогда
				ОчиститьАктуальныйЭлектронныйДокумент(ОбъектУчета.Ссылка);	
				СброситьСостояниеЭлектронногоДокументаОбъектаУчета(ОбъектУчета.Ссылка);
				УстановитьОснованиеНовогоЭлектронногоДокумента(ОбъектУчета.Ссылка);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		ОчиститьАктуальныйЭлектронныйДокумент(ОбъектУчета.Ссылка);
		ОчиститьОснованиеНовогоЭлектронногоДокумента(ОбъектУчета.Ссылка);
		ОчиститьСостояниеЭлектронногоДокументаОбъектаУчета(ОбъектУчета.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область СобытияЭлектронныхДокументов

// Выполняется при формировании электронного документа.
// Вызывается внутри транзакции записи электронного документа.
//
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - новый ЭлектронныйДокумент.
//  ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - вид документа.
//  Состояние - Перечисление.СостоянияДокументовЭДО - состояние электронного документа.
//  НаборОбъектовУчета - Массив из ОпределяемыйТип.ОснованияЭлектронныхДокументова - основания электронного документа.
//
Процедура ПриФормированииЭлектронногоДокумента(ЭлектронныйДокумент, ВидДокумента, Состояние, НаборОбъектовУчета) Экспорт
	
	Если НаборОбъектовУчета = Неопределено Тогда
		Возврат;	
	КонецЕсли;
		
	ОбновитьОбъектыУчетаЭлектронногоДокумента(ЭлектронныйДокумент, НаборОбъектовУчета);
	УстановитьАктуальныйЭлектронныйДокумент(НаборОбъектовУчета, ЭлектронныйДокумент, ВидДокумента);
	УстановитьСостояниеЭлектронногоДокументаОбъектовУчета(НаборОбъектовУчета, ЭлектронныйДокумент, Состояние);
	
КонецПроцедуры

// Выполняется при изменении состояния электронного документа.
// Вызывается внутри транзакции изменения электронного документа.
//
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - ЭлектронныйДокумент.
//  Состояние - ПеречмслениеСсылка.СостоянияДокументовЭДО - состояние электронного документа.
// 	КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики.
//
Процедура ПриИзмененииСостоянияЭлектронногоДокумента(ЭлектронныйДокумент, Состояние, КонтекстДиагностики) Экспорт
	
	ОбновитьСостояниеЭлектронногоДокументОбъектовУчета(ЭлектронныйДокумент, Состояние);
	
КонецПроцедуры

// Событие возникает после загрузки всех сообщений для новых документов.
// 
// Параметры:
// 	ЗагруженныеДокументы - См. ЭлектронныеДокументыЭДО.НовыеСведенияЗагруженныхДокументов.
// 	КонтекстСобытия - Структура - контекст для обработке на кленте (см. ЭлектронныеДокументыЭДОКлиент.ПослеЗагрузкиНовыхЭлектронныхДокументов).
// 	КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики.
Процедура ПослеЗагрузкиНовыхЭлектронныхДокументов(ЗагруженныеДокументы, КонтекстСобытия, КонтекстДиагностики) Экспорт
	
	ДанныеДляОтраженияДокументовВУчете = Новый Массив;
	
	Для Каждого ЗагруженныйДокумент Из ЗагруженныеДокументы Цикл
		
		ДанныеДокумента = ИнтеграцияЭДОКлиентСервер.НовыеДанныеЭлектронногоДокументаДляОтраженияВУчете();
		ДанныеДокумента.ЭлектронныйДокумент = ЗагруженныйДокумент.ЭлектронныйДокумент;
		ДанныеДокумента.ВидДокумента = ЗагруженныйДокумент.ВидДокумента;
		ДанныеДокумента.ТипДокумента = ЗагруженныйДокумент.ТипДокумента;		
		ДанныеДокумента.Отправитель = ЗагруженныйДокумент.Контрагент;
		ДанныеДокумента.Получатель = ЗагруженныйДокумент.Организация;
		ДанныеДокумента.ИдентификаторОтправителя = ЗагруженныйДокумент.ИдентификаторОтправителя;
		ДанныеДокумента.ИдентификаторПолучателя = ЗагруженныйДокумент.ИдентификаторПолучателя;
		ДанныеДокумента.ДанныеОсновногоФайла = ЗагруженныйДокумент.ОписаниеДанных;
		ДанныеДокумента.ДанныеДополнительногоФайла = ЗагруженныйДокумент.ОписаниеДополнительныхДанных;
		
		ДанныеДляОтраженияДокументовВУчете.Добавить(ДанныеДокумента);
		
	КонецЦикла;	
	
	ОтразитьВУчетеЭлектронныеДокументы(ДанныеДляОтраженияДокументовВУчете);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаДокументооборота

Функция ДокументооборотНастроен(ОбъектУчета)
	
	ОписаниеОбъектаУчета = ОписаниеОбъектаУчета(ОбъектУчета);
	
	Если ОписаниеОбъектаУчета.Направление = Перечисления.НаправленияЭДО.Интеркампани Тогда 
		КлючНастроек = НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки();
		КлючНастроек.Отправитель = ОписаниеОбъектаУчета.Организация;
		КлючНастроек.Получатель = ОписаниеОбъектаУчета.Контрагент;
		КлючНастроек.Договор = ОписаниеОбъектаУчета.Договор;
		КлючНастроек.ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(ОписаниеОбъектаУчета.ТипДокумента);
		Настройки = НастройкиЭДО.НастройкиОтправки(КлючНастроек);		
	ИначеЕсли ОписаниеОбъектаУчета.Направление = Перечисления.НаправленияЭДО.Внутренний Тогда
		Запросы = Новый Массив;
		
		ИдентификаторОбъектаУчета = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектУчета.Метаданные().ПолноеИмя());
		
		ОтборНастроекВнутреннегоЭДО = НастройкиЭДО.НовыйОтборНастроекВнутреннегоЭДО();
		ОтборНастроекВнутреннегоЭДО.Организация = "&Организация";
		ОтборНастроекВнутреннегоЭДО.ПроизвольноеУсловие = "ВидВнутреннегоДокумента.ИдентификаторОбъектаУчета = &ИдентификаторОбъектаУчета";		
		
		ЗапросНастроек = НастройкиЭДО.ЗапросНастроекВнутреннегоЭДО("НастройкиВнутреннегоЭДО", ОтборНастроекВнутреннегоЭДО);
		
		Запросы.Добавить(ЗапросНастроек);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	НастройкиВнутреннегоЭДО.Организация КАК Организация,
		|	НастройкиВнутреннегоЭДО.ВидВнутреннегоДокумента КАК ВидДокумента,
		|	НастройкиВнутреннегоЭДО.Формировать КАК Формировать,
		|	НастройкиВнутреннегоЭДО.ВидПодписи КАК ВидПодписи,
		|	НастройкиВнутреннегоЭДО.МаршрутПодписания КАК МаршрутПодписания,
		|	НастройкиВнутреннегоЭДО.ЭтоОсновнойВидДокумента КАК ЭтоОсновнойВидДокумента
		|ИЗ
		|	НастройкиВнутреннегоЭДО";
		
		ИтоговыйЗапрос = ОбщегоНазначенияБЭД.СоединитьЗапросы(Запрос, Запросы);
		ИтоговыйЗапрос.УстановитьПараметр("Организация", ОписаниеОбъектаУчета.Организация);
		ИтоговыйЗапрос.УстановитьПараметр("ИдентификаторОбъектаУчета", ИдентификаторОбъектаУчета);
		
		УстановитьПривилегированныйРежим(Истина);
		Настройки = ИтоговыйЗапрос.Выполнить().Выгрузить();
		Если Не ЗначениеЗаполнено(Настройки) Тогда
			Настройки = Неопределено;
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);

	Иначе
		КлючНастроек = ЭлектронныеДокументыЭДО.КлючНастроекОтправкиОбъектаУчета(ОписаниеОбъектаУчета);
		Настройки = НастройкиЭДО.НастройкиОтправки(КлючНастроек);
	КонецЕсли;

	
	Если Настройки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ОписаниеОбъектаУчета.Направление = Перечисления.НаправленияЭДО.Интеркампани
		Или ОписаниеОбъектаУчета.Направление = Перечисления.НаправленияЭДО.Внутренний Тогда 
	 	Возврат Истина;
	Иначе
		Возврат Настройки.ГотовностьКОбмену;
	КонецЕсли;

КонецФункции

// Определяет, поддержана ли в документе диагностика ошибок.
//
// Параметры:
//  ОбъектУчета - ДокументСсылка, ДокументОбъект - учетный документ.
// 
// Возвращаемое значение:
//  Булево - если Истина - диагностика ошибок поддержана.
//
Функция ДиагностикаПоддержана(ОбъектУчета)
	
	ДокументыСПоддержкойДиагностики = Новый Массив;
	ОбменСКонтрагентамиПереопределяемый.ПриОпределенииДокументовСПоддержкойДиагностикиОшибок(ДокументыСПоддержкойДиагностики);
	
	Возврат ДокументыСПоддержкойДиагностики.Найти(ОбъектУчета.Метаданные()) <> Неопределено;
	
КонецФункции 

#КонецОбласти

#Область ГотовностьКДокументообороту

// Инициализиурет описание проверки готовности объектов к документообороту.
//
// Параметры:
//  Готовые - Массив из ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - готовые объекты.
//  Неготовые - Массив из см. ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - неготовые объекты.
//
// Возвращаемое значение:
//  ФиксированнаяСтруктура - описание проверки готовности:
//   * Готовые - ФиксированныйМассив - готовые объекты.
//   * Неготовые - ФиксированныйМассив - неготовые объекты.
//
Функция НоваяПроверкаГотовностиКДокументообороту(Знач Готовые, Знач Неготовые)
	
	Проверка = Новый Структура;
	Проверка.Вставить("Готовые", Новый ФиксированныйМассив(Готовые));
	Проверка.Вставить("Неготовые", Новый ФиксированныйМассив(Неготовые));
	
	Возврат Новый ФиксированнаяСтруктура(Проверка);

КонецФункции

#КонецОбласти

#Область ОбъектыУчетаЭлектронныхДокументов

// Обновляет набор объектов учета, прикрепленных к электронному документу.
// Замещает ранее прикрепленные объекты.
//
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - ЭлектронныйДокумент.
//  НаборОбъектовУчета - Массив из ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - объекты, прикрепляемые к электронному документу.
//
Процедура ОбновитьОбъектыУчетаЭлектронногоДокумента(Знач ЭлектронныйДокумент, Знач НаборОбъектовУчета)
	
	Набор = РегистрыСведений.ОбъектыУчетаДокументовЭДО.СоздатьНаборЗаписей();
	Набор.Отбор.ЭлектронныйДокумент.Установить(ЭлектронныйДокумент);
	
	Для каждого ОбъектУчетаСсылка Из НаборОбъектовУчета Цикл
		
		Запись = Набор.Добавить();
		Запись.ЭлектронныйДокумент = ЭлектронныйДокумент;
		Запись.ОбъектУчета = ОбъектУчетаСсылка;
		
	КонецЦикла;
	
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область АктуальныйЭлектронныйДокумент

// Возвращает объекты учета, для которых переданный электронный документ является актуальным.
//
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - ЭлектронныйДокумент.
//
// Возвращаемое значение:
//  Массив из ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - найденные объекты учета.
//
Функция ОбъектыУчетаАктуальногоЭлектронногоДокумента(Знач ЭлектронныйДокумент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АктуальныеДокументыЭДО.ОбъектУчета КАК ОбъектУчета
	|ИЗ
	|	РегистрСведений.АктуальныеДокументыЭДО КАК АктуальныеДокументыЭДО
	|ГДЕ
	|	АктуальныеДокументыЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент";
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОбъектУчета");	

КонецФункции

// Назначает объектам учета актуальный электронный документ.
//
// Параметры:
//  НаборОбъектовУчета - Массив из ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - объекты учета для назначения.
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - назначаемый электронный документ.
//  ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - вид документа.
//
Процедура УстановитьАктуальныйЭлектронныйДокумент(НаборОбъектовУчета, ЭлектронныйДокумент, ВидДокумента) Экспорт
	
	Если Не ЗначениеЗаполнено(НаборОбъектовУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ОбъектУчета Из НаборОбъектовУчета Цикл
		
		Если ТипЗнч(ОбъектУчета) = Тип("СправочникСсылка.НастройкиЭДО") Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписатьАктуальныйЭлектронныйДокумент(ОбъектУчета, ЭлектронныйДокумент, ВидДокумента);
	КонецЦикла;
	
КонецПроцедуры

// Сохраняет информацию о состоянии актуального электронного документа.
//
// Параметры:
//  ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - ЭлектронныйДокумент.
//  ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - вид докумнета.
//
Процедура ЗаписатьАктуальныйЭлектронныйДокумент(Знач ОбъектУчета, Знач ЭлектронныйДокумент, Знач ВидДокумента)
	
	НачатьТранзакцию();
	Попытка
		
		Набор = РегистрыСведений.АктуальныеДокументыЭДО.СоздатьНаборЗаписей();
		Набор.Отбор.ОбъектУчета.Установить(ОбъектУчета);
		Набор.Отбор.ВидЭлектронногоДокумента.Установить(ВидДокумента);
		
		ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(Набор);
		
		Набор.Прочитать();
		
		Если ЭлектронныйДокумент = Неопределено Тогда
			Набор.Очистить();
		Иначе
			Если Не ЗначениеЗаполнено(Набор) Тогда
				Запись = Набор.Добавить();
				Запись.ОбъектУчета = ОбъектУчета;
			КонецЕсли;
			
			Для каждого Запись Из Набор Цикл

				Запись.ВидЭлектронногоДокумента = ВидДокумента;
				Запись.ЭлектронныйДокумент = ЭлектронныйДокумент;
				
			КонецЦикла;
		КонецЕсли;
		
		Набор.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ИмяСобытия = НСтр("ru = 'Запись информации о состоянии актуального электронного документа'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
	КонецПопытки;
	
КонецПроцедуры

// Возвращает данные актуальных электронных документов объекта учета.
//
// Параметры:
//  ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - объект учета.
//
// Возвращаемое значение:
// ТаблицаЗначений - данные актуальных электронных документов:
//   * ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - вид документа.
//   * ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО,  ДокументСсылка.ЭлектронныйДокументВходящийЭДО - ссылка на электронный документ. 
//
Функция АктуальныеЭлектронныеДокументыОбъектаУчета(ОбъектУчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АктуальныеДокументыЭДО.ВидЭлектронногоДокумента,
		|	АктуальныеДокументыЭДО.ЭлектронныйДокумент
		|ИЗ
		|	РегистрСведений.АктуальныеДокументыЭДО КАК АктуальныеДокументыЭДО
		|ГДЕ
		|	АктуальныеДокументыЭДО.ОбъектУчета = &ОбъектУчета";
	
	Запрос.УстановитьПараметр("ОбъектУчета", ОбъектУчета);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Удаляет информацию о состоянии актуального электронного документа.
//
// Параметры:
//  ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
//
Процедура ОчиститьАктуальныйЭлектронныйДокумент(Знач ОбъектУчета)	
	
	НачатьТранзакцию();
	Попытка
		
		Набор = РегистрыСведений.АктуальныеДокументыЭДО.СоздатьНаборЗаписей();
		Набор.Отбор.ОбъектУчета.Установить(ОбъектУчета);
		ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(Набор);
		Набор.Прочитать();
		
		Если ЗначениеЗаполнено(Набор) Тогда
			Набор.Очистить();
			Набор.Записать();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ИмяСобытия = НСтр("ru = 'Очистка информации о состоянии актуального электронного документа'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ОснованиеНовогоЭлектронногоДокумента

// Инициализирует описание основания электронного документа.
//
// Возвращаемое значение:
//  Структура - описание основания электронного документа:
//   * Вид - Строка - название основания.
//   * Дата - Дата - дата основания.
//   * Номер - Строка - номер основания.
//   * Организация - ОпределяемыйТип.Организация - организация основания.
//   * Контрагент - ОпределяемыйТип.КонтрагентБЭД - контрагент основания.
//   * СуммаДокумента - Число - сумма основания.
//
Функция НовоеОписаниеОснованияЭлектронногоДокумента()
	
	Описание = Новый Структура;
	Описание.Вставить("Вид", "");
	Описание.Вставить("Дата", Дата(1, 1, 1));
	Описание.Вставить("Номер", "");
	Описание.Вставить("Организация", Неопределено);
	Описание.Вставить("Контрагент", Неопределено);
	Описание.Вставить("СуммаДокумента", 0);
	
	Возврат Описание;
	
КонецФункции

// Возвращает описание основания электронного документа по объекту учета.
//
// Параметры:
//  ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
//
// Возвращаемое значение:
//  см. НовоеОписаниеОснованияЭлектронногоДокумента
//
Функция ОписаниеОснованияЭлектронногоДокумента(Знач ОбъектУчета) Экспорт

	Описание = НовоеОписаниеОснованияЭлектронногоДокумента();
	СтандартнаяОбработка = Истина;
	
	ОбменСКонтрагентамиПереопределяемый.ПриПолученииОписанияОснованияЭлектронногоДокумента(
		ОбъектУчета, Описание, СтандартнаяОбработка);
	
	Если Не ЗначениеЗаполнено(Описание.Вид) Тогда
		МетаданныеОснования = ОбъектУчета.Метаданные();
		Описание.Вид = МетаданныеОснования.Синоним;
	КонецЕсли;
	
	Если Не СтандартнаяОбработка Тогда
		Возврат Новый ФиксированнаяСтруктура(Описание);
	КонецЕсли;
	
	Реквизиты = ЗначенияРеквизитовОбъектаУчета(ОбъектУчета, "Дата,Номер,Организация,Контрагент,СуммаДокумента");
	
	ЗаполнитьЗначенияСвойств(Описание, Реквизиты);
	
	Возврат Описание;
	
КонецФункции

// Назначает объект учета основанием нового электронного документа.
//
// Параметры:
//  ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
//
Процедура УстановитьОснованиеНовогоЭлектронногоДокумента(ОбъектУчета)
	
	Описание = ОписаниеОснованияЭлектронногоДокумента(ОбъектУчета);
	
	ЗаписатьОснованиеНовогоЭлектронногоДокумента(ОбъектУчета, Описание);
	
КонецПроцедуры

// Сохраняет описание основания нового электронного документа.
//
// Параметры:
//  ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
//  Описание - см. НовоеОписаниеОснованияЭлектронногоДокумента
//
Процедура ЗаписатьОснованиеНовогоЭлектронногоДокумента(ОбъектУчета, Знач Описание)
	
	УстановитьПривилегированныйРежим(Истина);	
	
	НачатьТранзакцию();
	Попытка
		
		Набор = РегистрыСведений.СостоянияПоОбъектамУчетаЭДО.СоздатьНаборЗаписей();
		Набор.Отбор.СсылкаНаОбъект.Установить(ОбъектУчета);
		ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(Набор);
		Набор.Прочитать();
		
		Если Не ЗначениеЗаполнено(Набор) Тогда
			Запись = Набор.Добавить();
			Запись.СсылкаНаОбъект = ОбъектУчета;
		КонецЕсли;
		
		Для каждого Запись Из Набор Цикл
			
			Запись.Вид = Описание.Вид;
			Запись.Дата = Описание.Дата;
			Запись.Номер = Описание.Номер;
			Запись.Организация = Описание.Организация;
			Запись.Контрагент = Описание.Контрагент;
			Запись.СуммаДокумента = Описание.СуммаДокумента;
			
		КонецЦикла;
		
		Набор.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ИмяСобытия = НСтр("ru = 'Запись описания основания нового электронного документа'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

	КонецПопытки;
	
КонецПроцедуры

// Удаляет описание основания нового электронного документа.
//
// Параметры:
//  ОбъектУчета - ОпределяемыеТипы.ОснованияЭлектронныхДокументовЭДО
//
Процедура ОчиститьОснованиеНовогоЭлектронногоДокумента(Знач ОбъектУчета)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(АктуальныеЭлектронныеДокументыОбъектаУчета(ОбъектУчета)) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		Набор = РегистрыСведений.СостоянияПоОбъектамУчетаЭДО.СоздатьНаборЗаписей();
		Набор.Отбор.СсылкаНаОбъект.Установить(ОбъектУчета);
		ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(Набор);
		Набор.Прочитать();
		
		Если ЗначениеЗаполнено(Набор) Тогда
			Набор.Очистить();
			Набор.Записать();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ИмяСобытия = НСтр("ru = 'Очистка сведений об основании нового электронного документа'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

// Удаляет описание основания нового электронного документа.
//
// Параметры:
//  ОбъектУчета - ОпределяемыеТипы.ОснованияЭлектронныхДокументовЭДО
//
Процедура ЗакрытьПринудительноЭлектронныйДокумент(Источник)

	СостоянияМожноЗакрывать = Новый Массив;
	СостоянияМожноЗакрывать.Добавить(Перечисления.СостоянияДокументовЭДО.ТребуетсяУтверждение);
	СостоянияМожноЗакрывать.Добавить(Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание);
	СостоянияМожноЗакрывать.Добавить(Перечисления.СостоянияДокументовЭДО.ОбменЗавершенСИсправлением);

	СостоянияНетЭДО = Новый Массив;
	СостоянияНетЭДО.Добавить(Перечисления.СостоянияДокументовЭДО.ЗакрытПринудительно);
	СостоянияНетЭДО.Добавить(Перечисления.СостоянияДокументовЭДО.Аннулирован);
	СостоянияНетЭДО.Добавить(Перечисления.СостоянияДокументовЭДО.ЗакрытСОтклонением);
	СостоянияНетЭДО.Добавить(Перечисления.СостоянияДокументовЭДО.НеСформирован);

	СостоянияМожноСформироватьИсправление = Новый Массив;
	СостоянияМожноСформироватьИсправление.Добавить(Перечисления.СостоянияДокументовЭДО.ТребуетсяУточнение);

	ШаблонСообщенияУспех = НСтр("ru='Электронный документ ""%1"" закрыт принудительно.
								|Создайте новый электронный документ, чтобы выполнить документооборот.'");

	ШаблонСообщенияСформированоИсправление = НСтр("ru='Сформировано исправление электронного документа ""%1""'");

	ШаблонСообщенияЭДОНеЗавешен = НСтр("ru='Электронный документ ""%1"" стал неактуальным. Так как он уже отправлен контрагенту, необходимо:
									   | - Аннулировать электронный документ (перейти к документу можно командой ""ЭДО -> Открыть электронные документы"")
									   | - Создать новый электронный документ (команда ""ЭДО -> Создать электронный документ"")'");

	ШаблонСообщенияЭДОЗавешен = НСтр("ru='Электронный документ ""%1"" стал неактуальным. Так как он уже подписан контрагентом, необходимо:
									 | - Аннулировать электронный документ (перейти к документу можно командой ""ЭДО -> Открыть электронные документы"")
									 | - Создать новую версию электронного документа (команда ""ЭДО -> Создать электронный документ"")'");
			
	// Проверяем состояние документа.

	СписокВладельцевЭД = Новый Массив;
	СписокВладельцевЭД.Добавить(Источник.Ссылка);
	АктуальныеЭлектронныеДокументы = АктуальныеЭлектронныеДокументы(Источник.Ссылка);
	ЭлектронныйДокументСтрока = АктуальныеЭлектронныеДокументы.Найти(Источник.Ссылка, "ОбъектУчета");
	
	Если ЭлектронныйДокументСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныйДокумент = ЭлектронныйДокументСтрока.ЭлектронныйДокумент;
	
	ТекущееСостояние = ЭлектронныеДокументыЭДО.СостояниеДокумента(ЭлектронныйДокумент);
	Если СостоянияМожноСформироватьИсправление.Найти(ТекущееСостояние) <> Неопределено Тогда

		НаборДействий = Новый Соответствие;
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий,
			Перечисления.ДействияПоЭДО.СформироватьИсправление);

		ПараметрыВыполненияДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
		ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;

		ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ЭлектронныеДокументы.Добавить(ЭлектронныйДокумент);
		
		ОчиститьАктуальныйЭлектронныйДокумент(Источник.Ссылка);
		
		ТекстСообщения = СтрШаблон(ШаблонСообщенияСформированоИсправление, ЭлектронныйДокумент);
	
		Если ДиагностикаПоддержана(Источник) Тогда

			КонтекстОперации = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
			ДополнительныеПараметрыОшибки = Новый Структура("СсылкаНаОбъект, ДополнительныеДанные", Источник.Ссылка, ПараметрыВыполненияДействийПоЭДО);
			Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(НСтр("ru = 'Запись документа'"),
				ИнтеграцияЭДОКлиентСервер.ВидОшибкиОбновлениеВерсииЭДСформированоИсправление(), ТекстСообщения,
				ТекстСообщения, ДополнительныеПараметрыОшибки);
			ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстОперации, Ошибка, Ложь);
	
			Источник.ДополнительныеСвойства.Вставить("КонтекстОперации", КонтекстОперации);
			
		Иначе 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭлектронныйДокумент);
		КонецЕсли;
	ИначеЕсли СостоянияМожноЗакрывать.Найти(ТекущееСостояние) <> Неопределено Тогда
					
		// Закрываем принудительно ЭД.
		ПричинаЗакрытия = НСтр("ru='Закрыт автоматически при изменении учетного документа.'");

		НаборДействий = Новый Соответствие;
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий,
			Перечисления.ДействияПоЭДО.ЗакрытьПринудительно);

		ПараметрыВыполненияДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
		ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;

		ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ЭлектронныеДокументы.Добавить(ЭлектронныйДокумент);
		ПараметрыДействия = ЭлектронныеДокументыЭДОКлиентСервер.НовыеДополнительныеПараметрыДействия();
		ПараметрыДействия.Комментарий = ПричинаЗакрытия;
		ПараметрыВыполненияДействийПоЭДО.ДополнительныеПараметрыДействий.Вставить(
			Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, ПараметрыДействия);
				
		НачатьТранзакцию();
		Попытка
			ОчиститьАктуальныйЭлектронныйДокумент(Источник.Ссылка);
			ЭлектронныеДокументыЭДО.ВыполнитьДействияПоЭДО(ПараметрыВыполненияДействийПоЭДО);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
		ТекстСообщения = СтрШаблон(ШаблонСообщенияУспех, ЭлектронныйДокумент);
	
		Если ДиагностикаПоддержана(Источник) Тогда

			КонтекстОперации = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
			ДополнительныеПараметрыОшибки = Новый Структура("СсылкаНаОбъект", Источник.Ссылка);
			Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(НСтр("ru = 'Запись документа'"),
				ИнтеграцияЭДОКлиентСервер.ВидОшибкиОбновлениеВерсииЭДЗакрытПринудительно(), ТекстСообщения,
				ТекстСообщения, ДополнительныеПараметрыОшибки);
			ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстОперации, Ошибка, Ложь);
	
			Источник.ДополнительныеСвойства.Вставить("КонтекстОперации", КонтекстОперации);
			
		Иначе 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭлектронныйДокумент);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ТекущееСостояние) И СостоянияНетЭДО.Найти(ТекущееСостояние) = Неопределено Тогда
				
		// ЭДО начат, нужно его аннулировать, прежде чем создавать новую версию ЭД.
		Если ТекущееСостояние = Перечисления.СостоянияДокументовЭДО.ОбменЗавершен Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщенияЭДОЗавешен, ЭлектронныйДокумент);
		Иначе
			ТекстСообщения = СтрШаблон(ШаблонСообщенияЭДОНеЗавешен, ЭлектронныйДокумент);
		КонецЕсли;
		
		Если ДиагностикаПоддержана(Источник) Тогда
			КонтекстОперации = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
			ДополнительныеПараметрыОшибки = Новый Структура;
			ДополнительныеПараметрыОшибки.Вставить("СсылкаНаОбъект", Источник.Ссылка);
	
			ДополнительныеДанные = Новый Структура;
			ДополнительныеДанные.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
	
			ДополнительныеПараметрыОшибки.Вставить("ДополнительныеДанные", ДополнительныеДанные);
	
			Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(НСтр("ru = 'Запись документа'"),
				ИнтеграцияЭДОКлиентСервер.ВидОшибкиОбновлениеВерсииЭДТребуетсяАннулирование(), ТекстСообщения,
				ТекстСообщения, ДополнительныеПараметрыОшибки);
			ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстОперации, Ошибка, Ложь);
			Источник.ДополнительныеСвойства.Вставить("КонтекстОперации", КонтекстОперации);
		Иначе 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭлектронныйДокумент);
		КонецЕсли;

		ОчиститьАктуальныйЭлектронныйДокумент(Источник.Ссылка);	
		СброситьСостояниеЭлектронногоДокументаОбъектаУчета(Источник.Ссылка);
		УстановитьОснованиеНовогоЭлектронногоДокумента(Источник.Ссылка);

	Иначе
		ОчиститьАктуальныйЭлектронныйДокумент(Источник.Ссылка);	
		СброситьСостояниеЭлектронногоДокументаОбъектаУчета(Источник.Ссылка);
		УстановитьОснованиеНовогоЭлектронногоДокумента(Источник.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СостояниеЭДООбъектаУчета

// Назначает объектам учета актуальное состояние электронного документа.
//
// Параметры:
//  НаборОбъектовУчета - Массив из ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - объекты учета для назначения.
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - назначаемый ЭлектронныйДокумент.
//  Сотояние - Перечисление.СостоянияДокументовЭДО - состояние электронного документа.
//
Процедура УстановитьСостояниеЭлектронногоДокументаОбъектовУчета(Знач НаборОбъектовУчета, Знач ЭлектронныйДокумент, Знач Состояние)
	
	Если Не ЗначениеЗаполнено(НаборОбъектовУчета) Тогда
		Возврат;
	КонецЕсли;
		
	Для каждого ОбъектУчета Из НаборОбъектовУчета Цикл
		УстановитьСостояниеЭлектронногоДокументаОбъектаУчета(ОбъектУчета, Состояние);
	КонецЦикла;
	
КонецПроцедуры

// Обновляет информацию о состоянии актуального электронного документа.
//
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - ссылка на электронный документ.
//
Процедура ОбновитьСостояниеЭлектронногоДокументОбъектовУчета(ЭлектронныйДокумент, Состояние)
	
	НаборОбъектовУчета = ОбъектыУчетаАктуальногоЭлектронногоДокумента(ЭлектронныйДокумент);
	Если Не ЗначениеЗаполнено(НаборОбъектовУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ОбъектУчета Из НаборОбъектовУчета Цикл
		УстановитьСостояниеЭлектронногоДокументаОбъектаУчета(ОбъектУчета, Состояние);
	КонецЦикла;
	
КонецПроцедуры

// Удаляет информацию о состоянии актуального электронного документа.
//
// Параметры:
//  ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
//
Процедура ОчиститьСостояниеЭлектронногоДокументаОбъектаУчета(Знач ОбъектУчета)
	
	НачатьТранзакцию();
	Попытка
		
		Набор = РегистрыСведений.СостоянияПоОбъектамУчетаЭДО.СоздатьНаборЗаписей();
		Набор.Отбор.СсылкаНаОбъект.Установить(ОбъектУчета);
		ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(Набор);
		Набор.Прочитать();
		
		Если ЗначениеЗаполнено(Набор) Тогда
			Набор.Очистить();
			Набор.Записать();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ИмяСобытия = НСтр("ru = 'Очистка информации о состоянии актуального электронного документа'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

	КонецПопытки;
	
КонецПроцедуры

// Сбрасывает информацию о состоянии актуального электронного документа (исходящего) в начальное значение.
//
// Параметры:
//  ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
//
Процедура СброситьСостояниеЭлектронногоДокументаОбъектаУчета(Знач ОбъектУчета)
	
	Состояние = ЭлектронныеДокументыЭДО.НачальноеСостояниеДокумента();
	
	УстановитьСостояниеЭлектронногоДокументаОбъектаУчета(ОбъектУчета, Состояние);
	
КонецПроцедуры

// Сохраняет информацию о состоянии актуального электронного документа.
//
// Параметры:
//  ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - ссылка на электронный документ.
//  Состояние - ПеречислениеСсылка.СостоянияДокументовЭДО - состояние электронного документа.
//
Процедура УстановитьСостояниеЭлектронногоДокументаОбъектаУчета(Знач ОбъектУчета, Знач Состояние)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		
		Набор = РегистрыСведений.СостоянияПоОбъектамУчетаЭДО.СоздатьНаборЗаписей();
		Набор.Отбор.СсылкаНаОбъект.Установить(ОбъектУчета);
		
		ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(Набор);
		
		Набор.Прочитать();
		
		Если Не ЗначениеЗаполнено(Набор) Тогда
			Запись = Набор.Добавить();
			Запись.СсылкаНаОбъект = ОбъектУчета;
		КонецЕсли;
		
		Для каждого Запись Из Набор Цикл
			
			Запись.СостояниеЭДО = Состояние;
			Запись.ПредставлениеСостояния = ПредставлениеСостоянияЭДООбъектаУчета(ОбъектУчета, Состояние);
			
		КонецЦикла;
		
		Набор.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ИмяСобытия = НСтр("ru = 'Запись информации о состоянии актуального электронного документа'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
	КонецПопытки;
	
КонецПроцедуры

Функция НовыеДанныеСостоянияЭДООбъектаУчета(ВыполнитьНачальноеЗаполнение = Истина)
	
	ДанныеСостояния = Новый Структура;
	ДанныеСостояния.Вставить("ИспользуетсяОбменЭлектроннымиДокументами", Ложь);
	ДанныеСостояния.Вставить("ЕстьПравоНастройки", Ложь);
	ДанныеСостояния.Вставить("ПредставлениеСостояния", "");
	ДанныеСостояния.Вставить("СуществуетАктуальныйДокумент", Ложь);
	ДанныеСостояния.Вставить("НеобходимаНастройка", Ложь);
	
	Если ВыполнитьНачальноеЗаполнение Тогда
		ДанныеСостояния.ИспользуетсяОбменЭлектроннымиДокументами = НастройкиЭДО.ИспользуетсяОбменЭлектроннымиДокументами();;
		ДанныеСостояния.ЕстьПравоНастройки = НастройкиЭДО.ЕстьПравоНастройкиОбмена()
	КонецЕсли;

	Возврат ДанныеСостояния;

КонецФункции

Функция СохраненноеПредставлениеСостоянияЭДООбъектаУчета(ОбъектУчета)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СостоянияЭД.ПредставлениеСостояния КАК ПредставлениеСостояния
		|ИЗ
		|	РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияЭД
		|ГДЕ
		|	СостоянияЭД.СсылкаНаОбъект = &СсылкаНаОбъект";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ОбъектУчета);
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.ПредставлениеСостояния;
		
	КонецЕсли;

	Возврат "";

КонецФункции

#КонецОбласти

#Область КонтрольОтраженияВУчете

Процедура Обновление_ВыполнитьКонтрольОтраженияВУчете(ЭлектронныйДокумент) Экспорт

	ДанныеДокументаДляОтраженияВУчете = ЭлектронныеДокументыЭДО.ДанныеДокументовДляОтраженияВУчете(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЭлектронныйДокумент));
	ВключитьКонтрольОтраженияВУчете(ДанныеДокументаДляОтраженияВУчете);
	
КонецПроцедуры

#КонецОбласти

#Область ДанныеОбъектаУчета

#Область Общее

// Пустой результат формирования данных по объекту учета.
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * СвязанныеОбъектыУчета - Массив из ОпределяемыйТип.ОснованияЭлектронныхДокументов - Связанные объекты учета.
// * Основания - Массив из ОпределяемыйТип.ОснованияЭлектронныхДокументов - Объекты учета по которым сформированы данные.
// * Данные - См. ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента
Функция НовыйРезультатФормированияДанныхОбъектаУчета()
	Результат = Новый Структура;
	Результат.Вставить("СвязующийОбъектУчета", Неопределено);
	Результат.Вставить("СвязанныеОбъектыУчета", Новый Массив);
	Результат.Вставить("Основания", Новый Массив);
	Результат.Вставить("Данные", Новый ДеревоЗначений);
	Возврат Результат;
КонецФункции

Функция ИдентификаторОбъектаУчета(Знач ОбъектУчета)
	
	Идентификатор = Строка(Новый УникальныйИдентификатор);
	
	Если ЗначениеЗаполнено(ОбъектУчета) Тогда
		
		Идентификатор = Строка(ОбъектУчета.УникальныйИдентификатор());
		
	КонецЕсли;
	
	Возврат Идентификатор;
	
КонецФункции

Процедура ПоместитьСопоставлениеНоменклатурыВДополнительныеДанныеCML(Данные, Знач ПутьКТоварам)
	
	Товары = ДеревоЭлектронногоДокументаБЭД.ДанныеЭлементаДереваЭлектронногоДокумента(Данные, ПутьКТоварам);
	Сопоставления = ИзвлечьСопоставлениеНоменклатурыИзТаблицыТоваров(Товары);
	СопоставленияДляВыгрузки = ПодготовитьСопоставлениеНоменклатурыДляЭлектронногоДокументаПоТаблице(Сопоставления);
	
	СтрокаТаблицыТовары = Данные.Строки.Найти(ПутьКТоварам,"ПолныйПуть", Истина);
	
	Индекс = 0;
	ПутьКДополнительныДанным = ПутьКТоварам + ".НомерСтроки.ДополнительныеДанные";
	Префикс = ЭлектронныеДокументыЭДО.ПрефиксСлужебныхДополнительныхДанных();
	
	Для каждого СтрокаТовара Из СтрокаТаблицыТовары.Строки Цикл
		
		ДополнительныеДанные = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			СтрокаТовара, ПутьКДополнительныДанным, Ложь);
		Если Не ЗначениеЗаполнено(ДополнительныеДанные) Тогда
			ДополнительныеДанные = Новый Соответствие;
		КонецЕсли;
		
		ДополнительныеДанныеСовместимость = Новый Структура;
		
		СопоставлениеПоСтроке = СопоставленияДляВыгрузки[Индекс];
		Для каждого Элемент Из СопоставлениеПоСтроке Цикл
			Ключ = Элемент.Ключ;
			Значение = Элемент.Значение;
			ДополнительныеДанные.Вставить(Ключ, Значение);
			Если Ключ = Префикс + "Идентификатор" Тогда
				ДополнительныеДанныеСовместимость.Вставить("Ид", Значение);
			КонецЕсли;
		КонецЦикла;
		
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗначениеВДерево(
			СтрокаТовара, ПутьКДополнительныДанным, ДополнительныеДанные);
		
		СтрокаДопДанныхПодписанных = Данные.Строки.Найти(ПутьКТоварам + ".НомерСтроки.ДопДанныеПодписанные","ПолныйПуть", Истина);
		ЭлектронноеВзаимодействие.ДобавитьДопДанныеВДерево(
			СтрокаДопДанныхПодписанных, ДополнительныеДанныеСовместимость, Истина);
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИзвлечьСопоставлениеНоменклатурыИзТаблицыТоваров(Знач ТаблицаТоваров)
	
	Если ТаблицаТоваров.Колонки.Найти("Сопоставление") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаСопоставления = Новый ТаблицаЗначений;
	ТаблицаСопоставления.Колонки.Добавить("Идентификатор");
	ТаблицаСопоставления.Колонки.Добавить("Наименование");
	ТаблицаСопоставления.Колонки.Добавить("Характеристика");
	ТаблицаСопоставления.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаСопоставления.Колонки.Добавить("ЕдиницаИзмеренияКод");
	ТаблицаСопоставления.Колонки.Добавить("Артикул");
	ТаблицаСопоставления.Колонки.Добавить("СтавкаНДС");
	ТаблицаСопоставления.Колонки.Добавить("Штрихкод");
	ТаблицаСопоставления.Колонки.Добавить("ШтрихкодКомбинации");
	ТаблицаСопоставления.Колонки.Добавить("ШтрихкодыНоменклатуры");
	ТаблицаСопоставления.Колонки.Добавить("НоменклатураИБ");
	ТаблицаСопоставления.Колонки.Добавить("ХарактеристикаИБ");
	ТаблицаСопоставления.Колонки.Добавить("УпаковкаИБ");
	
	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		НовоеСопоставление = ТаблицаСопоставления.Добавить();
		ЗаполнитьЗначенияСвойств(НовоеСопоставление, СтрокаТовара.Сопоставление);
		
	КонецЦикла;
	
	Возврат ТаблицаСопоставления;
	
КонецФункции

Функция ПодготовитьСопоставлениеНоменклатурыДляЭлектронногоДокументаПоТаблице(Знач ТаблицаСопоставления, Знач ТипФорматаФайлаФНС = Ложь)
	
	НаборСопоставлений = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаСопоставления);
	НаборСопоставленийДляВыгрузки = Новый Массив;
	
	Префикс = ЭлектронныеДокументыЭДО.ПрефиксСлужебныхДополнительныхДанных();
	
	// Получим идентификаторы сервиса 1С:Номенклатура.
	ТаблицаСервиса = Неопределено;
	ЕстьРаботаСНоменклатурой = ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.РаботаСНоменклатурой");
	Если ЕстьРаботаСНоменклатурой Тогда
		НаборПоиска = Новый Массив;
		Для Каждого Сопоставление Из НаборСопоставлений Цикл
			ЭлементПоиска = Новый Структура;
			ЭлементПоиска.Вставить("Номенклатура", Сопоставление.НоменклатураИБ);
			ЭлементПоиска.Вставить("Характеристика", Сопоставление.ХарактеристикаИБ);
			НаборПоиска.Добавить(ЭлементПоиска);
		КонецЦикла;
		МодульРаботаСНоменклатурой = ОбщегоНазначения.ОбщийМодуль("РаботаСНоменклатурой");
		ТаблицаСервиса = МодульРаботаСНоменклатурой.ИдентификаторыНоменклатурыИХарактеристикПоСсылкам(НаборПоиска);
	КонецЕсли;
	
	Если ТипФорматаФайлаФНС Тогда
		МаксимальнаяДлина = 2000;
	Иначе
		МаксимальнаяДлина = 1000;
	КонецЕсли;
	
	Для Каждого Сопоставление Из НаборСопоставлений Цикл
		
		НоменклатураИБ = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураИнформационнойБазы();
		Сопоставление.Свойство("НоменклатураИБ"  , НоменклатураИБ.Номенклатура);
		Сопоставление.Свойство("ХарактеристикаИБ", НоменклатураИБ.Характеристика);
		Сопоставление.Свойство("УпаковкаИБ"      , НоменклатураИБ.Упаковка);
		// Если идентификатор не задан, то формируем его по номенклатуре ИБ.
		ЗначениеСвойства = "";
		Сопоставление.Свойство("Идентификатор", ЗначениеСвойства);
		Если Не ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			Сопоставление.Вставить("Идентификатор", СформироватьИдентификаторНоменклатурыИБ(НоменклатураИБ));
		КонецЕсли;
		// Если передан массив штрихкодов, то преобразуем их в строку.
		Если ЗначениеЗаполнено(Сопоставление.ШтрихкодКомбинации) Тогда
			Сопоставление.Вставить("ШтрихкодКомбинации", Сопоставление.ШтрихкодКомбинации);
		КонецЕсли;
		Если Сопоставление.Свойство("ШтрихкодыНоменклатуры") Тогда
			Если ТипЗнч(Сопоставление.ШтрихкодыНоменклатуры) = Тип("Массив") Тогда
				Сопоставление.ШтрихкодыНоменклатуры = СоединитьШтрихкодыВСтроку(Сопоставление.ШтрихкодыНоменклатуры, МаксимальнаяДлина);
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТаблицаСервиса) Тогда
			ОтборВСервисе = Новый Структура;
			ОтборВСервисе.Вставить("Номенклатура", Сопоставление.НоменклатураИБ);
			Если ЗначениеЗаполнено(Сопоставление.ХарактеристикаИБ) Тогда
				ОтборВСервисе.Вставить("Характеристика", Сопоставление.ХарактеристикаИБ);
			КонецЕсли;
			НайденныеСтроки = ТаблицаСервиса.НайтиСтроки(ОтборВСервисе);
			Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
				Сопоставление.Вставить("ИдентификаторНоменклатурыСервиса"  , НайденныеСтроки[0].ИдентификаторНоменклатуры);
				Сопоставление.Вставить("ИдентификаторХарактеристикиСервиса", НайденныеСтроки[0].ИдентификаторХарактеристики);
			КонецЕсли;
		КонецЕсли;
		
		// Сформируем результирующую структуру для помещения в электронный документ.
		
		Результат = Новый Структура;
		
		Для Каждого Элемент Из Сопоставление Цикл
			
			Если Элемент.Ключ = "НоменклатураИБ" Тогда
				// Не выгружаем.
			ИначеЕсли Элемент.Ключ = "ХарактеристикаИБ" Тогда
				// Не выгружаем.
			ИначеЕсли Элемент.Ключ = "УпаковкаИБ" Тогда
				// Не выгружаем.
			ИначеЕсли Элемент.Ключ = "СтавкаНДС" Тогда
				СтавкаНДСКод = ИнтеграцияЭДО.СтавкаНДСИзСоответствия(, Элемент.Значение);
				Если ЗначениеЗаполнено(СтавкаНДСКод) Тогда
					Результат.Вставить(Префикс + Элемент.Ключ, СокрЛП(СтавкаНДСКод));
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(Элемент.Значение) Тогда
				Результат.Вставить(Префикс + Элемент.Ключ, СокрЛП(Элемент.Значение));
			КонецЕсли;
			
		КонецЦикла;
		
		НаборСопоставленийДляВыгрузки.Добавить(Результат);
		
	КонецЦикла;
	
	Возврат НаборСопоставленийДляВыгрузки;
	
КонецФункции

Функция СформироватьИдентификаторНоменклатурыИБ(Знач НоменклатураИБ) Экспорт
	
	ИдНоменклатуры = ?(ЗначениеЗаполнено(НоменклатураИБ.Номенклатура), НоменклатураИБ.Номенклатура.УникальныйИдентификатор(), "");
	ИдХарактеристики = ?(ЗначениеЗаполнено(НоменклатураИБ.Характеристика), НоменклатураИБ.Характеристика.УникальныйИдентификатор(), "");
	ИдУпаковки = ?(ЗначениеЗаполнено(НоменклатураИБ.Упаковка), НоменклатураИБ.Упаковка.УникальныйИдентификатор(), "");
	
	Результат = "";
	Если ЗначениеЗаполнено(ИдНоменклатуры) Тогда
		Результат = Строка(ИдНоменклатуры) + "#" + Строка(ИдХарактеристики) + "#" + Строка(ИдУпаковки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоединитьШтрихкодыВСтроку(Знач НаборШтрихкодов, Знач МаксимальнаяДлина = 0) 
	
	Результат = "";
	ОграничиватьДлинуРезультата = (МаксимальнаяДлина > 0);
	ТекущаяДлина = 0;
	
	Для Каждого Штрихкод Из НаборШтрихкодов Цикл
		
		ДлинаШтрихкода = СтрДлина(Штрихкод);
		Если ОграничиватьДлинуРезультата
			И ТекущаяДлина + ДлинаШтрихкода + 1 > МаксимальнаяДлина Тогда
			Прервать;
		КонецЕсли;
		
		Результат = Результат + ?(ЗначениеЗаполнено(Результат), ",", "") + Штрихкод;
		ТекущаяДлина = ТекущаяДлина + ДлинаШтрихкода + 1;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьДанныеДокумента(Данные, Знач ДополнительныеДанные, Знач Замещать = Ложь) Экспорт
	
	Для каждого КлючЗначение Из ДополнительныеДанные Цикл
		
		Путь = КлючЗначение.Ключ;
		Значение = КлючЗначение.Значение;
		
		Если Не Замещать Тогда
		
			ТекущееЗначение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, Путь, Ложь);
			Если ЗначениеЗаполнено(ТекущееЗначение) Тогда
				Продолжить;
			КонецЕсли;
		
		КонецЕсли;
		
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗначениеВДерево(Данные, Путь, Значение);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПоместитьРеквизитШапкиВДопДанные(ДеревоДокумента, ПутьКДанным)
	
	ЗначениеРеквизита = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДокумента, ПутьКДанным);
	
	Если Не ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизита = СтрЗаменить(ПутьКДанным, ".", "");
	
	Если ВРег(ИмяРеквизита) = ВРег("ВидОперации") Тогда
		ЗначениеРеквизита = XMLСтрока(ЗначениеРеквизита);
	КонецЕсли;
	
	Если ВРег(ИмяРеквизита) = ВРег("ДатаИсправления") Тогда
		ЗначениеРеквизита = Формат(ЗначениеРеквизита, "ДЛФ=D");
	КонецЕсли;
	
	ДопДанные = Новый Структура(ИмяРеквизита, ЗначениеРеквизита);
	ДеревоЭлектронногоДокументаБЭД.ДобавитьДопДанныеВДерево(ДеревоДокумента, ДопДанные, Истина);
	
КонецПроцедуры

Процедура ПоместитьТаблицуДереваВДопДанные(ДеревоДокумента, ИмяТаблицы, Подписываемые = Истина)
	
	ЗначениеТаблицы = ДеревоЭлектронногоДокументаБЭД.ДанныеДерева(ДеревоДокумента, ИмяТаблицы);
	
	Если Не ЗначениеЗаполнено(ЗначениеТаблицы) Тогда
		Возврат;
	КонецЕсли;
	
	ДопДанные = Новый Структура(ИмяТаблицы, ЗначениеТаблицы);
	ЭлектронноеВзаимодействие.ДобавитьДопДанныеВДерево(ДеревоДокумента, ДопДанные, Подписываемые);
	
КонецПроцедуры

Процедура ПоместитьГруппуДереваВДопДанные(ДеревоДокумента, ПутьКДанным)
	
	ВеткаГруппы = ЗначениеГруппыВДереве(ДеревоДокумента, ПутьКДанным);
	Если ТипЗнч(ВеткаГруппы) = Тип("КоллекцияСтрокДереваЗначений") Тогда
		
		ДанныеГруппы = Новый Структура;
		Для Каждого СтрокаДерева Из ВеткаГруппы Цикл
			
			ЗначениеРеквизита = СтрокаДерева.Значение;
			Если Не ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяРеквизита = СтрЗаменить(СтрокаДерева.ПолныйПуть, ПутьКДанным+".", "");
			
			ДанныеГруппы.Вставить(ИмяРеквизита, ЗначениеРеквизита);
			
		КонецЦикла;
		
		Если ДанныеГруппы.Количество() > 0 Тогда
			ЭлектронноеВзаимодействие.ДобавитьДопДанныеВДерево(ДеревоДокумента, ДанныеГруппы, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗначениеГруппыВДереве(ДеревоДанных, ПолныйПуть) 
	
	НайденнаяСтрока = ДеревоДанных.Строки.Найти(ПолныйПуть, "ПолныйПуть", Истина);
	Если НайденнаяСтрока <> Неопределено Тогда
		Возврат НайденнаяСтрока.Строки;
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьСопоставлениеНоменклатурыВДопДанныеДереваДокументаТаблица(Дерево, ПутьКТаблицеТоваров,
	Знач ТипФорматаФайлаФНС = Ложь, ВерсияФормата = "") Экспорт

	ТаблицаТоваров = ДеревоЭлектронногоДокументаБЭД.ДанныеЭлементаДереваЭлектронногоДокумента(Дерево,
		ПутьКТаблицеТоваров);
		
	СтрокаТаблицыТоваров = Дерево.Строки.Найти(ПутьКТаблицеТоваров, "ПолныйПуть", Истина);
			
	ПоддерживаемыеФорматы = ЭлектронныеДокументыЭДО.ПоддерживаемыеФорматы();
	
	Если ВерсияФормата = ПоддерживаемыеФорматы.БизнесСеть.КоммерческоеПредложение
		Или  ВерсияФормата = ПоддерживаемыеФорматы.БизнесСеть.ЗапросКоммерческогоПредложения Тогда
		СопоставлениеНоменклатуры = Новый Соответствие;
	
		Если ЗначениеЗаполнено(СтрокаТаблицыТоваров.Значение) Тогда

			Для Каждого Позиция Из СтрокаТаблицыТоваров.Строки Цикл

				Номенклатура = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(Позиция,
					"Товары.НомерСтроки.Товар.НоменклатураСсылка");
				Характеристика = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(Позиция,
					"Товары.НомерСтроки.Товар.ХарактеристикаСсылка");
				ЕдиницаИзмерения = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(Позиция,
					"Товары.НомерСтроки.Товар.ЕдиницаИзмеренияСсылка");

				НоменклатураИнформационнойБазы = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураИнформационнойБазы(
					Номенклатура, Характеристика, ЕдиницаИзмерения);

				СопоставлениеНоменклатуры.Вставить(Позиция.Значение, СформироватьИдентификаторНоменклатурыИБ(
					НоменклатураИнформационнойБазы));

			КонецЦикла;

		КонецЕсли;

		ДеревоЭлектронногоДокументаБЭД.ВставитьЗначениеВДерево(Дерево, "СопоставлениеНоменклатуры", СопоставлениеНоменклатуры);
		
		Возврат;
		
	КонецЕсли;
	
	
	Если ТаблицаТоваров.Колонки.Найти("ДопДанныеПодписанные") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСопоставления = ИзвлечьСопоставлениеНоменклатурыИзТаблицыТоваров(ТаблицаТоваров);
	Если ТаблицаСопоставления = Неопределено Или Не ЗначениеЗаполнено(ТаблицаСопоставления) Тогда
		Возврат;
	КонецЕсли;
	
	НаборСопоставленийДляВыгрузки = ПодготовитьСопоставлениеНоменклатурыДляЭлектронногоДокументаПоТаблице(ТаблицаСопоставления, ТипФорматаФайлаФНС);
	
	Индекс = 0;
	
	Для Каждого СтрокаТовара Из СтрокаТаблицыТоваров.Строки Цикл
		
		СопоставлениеДляВыгрузки = НаборСопоставленийДляВыгрузки[Индекс];
		Индекс = Индекс + 1;
		
		СтрокаДопДанных = СтрокаТовара.Строки.Найти(СтрокаТовара.ПолныйПуть + ".ДопДанныеПодписанные", "ПолныйПуть");
		Если СтрокаДопДанных = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлектронноеВзаимодействие.ДобавитьДопДанныеВДерево(СтрокаДопДанных, СопоставлениеДляВыгрузки, Истина);
	
		Если Не ВерсияФормата = "ON_NKORSCHFDOPPR_1_996_03_05_01" Тогда
			
			// Для обратной совместимости дублируем идентификатор в доп. данные с именем "ИД".
			Префикс = ЭлектронныеДокументыЭДО.ПрефиксСлужебныхДополнительныхДанных();
			Если СопоставлениеДляВыгрузки.Свойство(Префикс + "Идентификатор") Тогда
				ДляСовместимости = Новый Структура("ИД", СопоставлениеДляВыгрузки[Префикс + "Идентификатор"]);
				ЭлектронноеВзаимодействие.ДобавитьДопДанныеВДерево(СтрокаДопДанных, ДляСовместимости, Истина);
			КонецЕсли;
			
		КонецЕсли;

		
	КонецЦикла;
	
КонецПроцедуры

// Переносит данные по маркировке из специального реквизита строки дерева документа
// в общую структуру доп. данных данной строки.
//
// Параметры:
//  СтрокаТовара - СтрокаДереваЗначений - строка товара дерева документа, в которой нужно выполнить перенос.
//  СтруктураЭД  - Структура - параметры для создания электронного документа.
//                             См. ОбменСКонтрагентамиВнутренний.СтруктураЭлектронногоДокумента.
//
Процедура ДобавитьСведенияОМаркировкеВДопДанныеДереваДокумента_ГИСМТ(СтрокаТовара)
	
	СтрокаДопДанных = СтрокаТовара.Строки.Найти(СтрокаТовара.ПолныйПуть + ".ДопДанныеПодписанные", "ПолныйПуть");
	Если СтрокаДопДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьСтрокиДопСведенийОМаркировках_ГИСМТ(СтрокаТовара, СтрокаДопДанных,
		".СведенияОМаркировкеДо.ТранспортныеУпаковки", "sscc_до");
	ДобавитьСтрокиДопСведенийОМаркировках_ГИСМТ(СтрокаТовара, СтрокаДопДанных,
		".СведенияОМаркировкеДо.КонтрольныеИдентификационныеЗнаки", "cis_до");
	
	ДобавитьСтрокиДопСведенийОМаркировках_ГИСМТ(СтрокаТовара, СтрокаДопДанных,
		".СведенияОМаркировкеПосле.ТранспортныеУпаковки", "sscc");
	ДобавитьСтрокиДопСведенийОМаркировках_ГИСМТ(СтрокаТовара, СтрокаДопДанных,
		".СведенияОМаркировкеПосле.КонтрольныеИдентификационныеЗнаки", "cis");
	
КонецПроцедуры

Процедура ДобавитьСтрокиДопСведенийОМаркировках_ГИСМТ(СтрокаТовара, СтрокаДопДанных,
	ПутьКТаблицеМаркировки, Идентификатор) 
	
	ПутьКСведениямПоУпаковкам = СтрокаТовара.ПолныйПуть + ПутьКТаблицеМаркировки;
	Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(СтрокаТовара, ПутьКСведениямПоУпаковкам);
	Если ТипЗнч(Реквизит) = Тип("Число") И Реквизит > 0 Тогда
		
		СтрокиУпаковок = СтрокаТовара.Строки.Найти(ПутьКСведениямПоУпаковкам, "ПолныйПуть", Истина);
		Для Каждого СтрокаУпаковки Из СтрокиУпаковок.Строки Цикл
			НомерУпаковки = СокрЛП(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(СтрокаУпаковки,
				ПутьКСведениямПоУпаковкам + ".НомерСтроки.Код"));
				
			Если ЗначениеЗаполнено(НомерУпаковки) Тогда
				СведенияПоМаркировкеДо = Новый Структура(Идентификатор, НомерУпаковки);
				ЭлектронноеВзаимодействие.ДобавитьДопДанныеВДерево(СтрокаДопДанных, СведенияПоМаркировкеДо, Истина, Истина);
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьСвязанныеОбъектыУчетаCML(СвязанныеОбъектыУчета, Данные) Экспорт

	НаборОбъектовУчета = Новый Массив;
	СтрокаТаблицаТоваров = Данные.Строки.Найти("Товары", "ПолныйПуть");
	Для Каждого Товар Из СтрокаТаблицаТоваров.Строки Цикл
		Основание = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "Товары.НомерСтроки.ДокументОснование");
		Если ЗначениеЗаполнено(Основание) Тогда
			НаборОбъектовУчета.Добавить(Основание);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НаборОбъектовУчета) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СвязанныеОбъектыУчета, НаборОбъектовУчета, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Автозаполнение

Процедура УКД_ИнформацияПродавца_АвтозаполнениеАдресов(Данные)
	
	ДатаСведений = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "ДатаДокумента", Ложь);
	
	Участники = Новый Структура;
	Участники.Вставить("СведенияОПродавце");
	Участники.Вставить("СведенияОПокупателе");
	Участники.Вставить("СведенияОКомиссионере");
	
	Для каждого КлючЗначение Из Участники Цикл
		
		Путь = КлючЗначение.Ключ;
		Колонка = КлючЗначение.Значение;
		
		СтрокаДерева = Данные.Строки.Найти(Путь, "ПолныйПуть");
		
		Если СтрокаДерева.Признак = "Таблица" Тогда
			
			Для каждого СтрокаТаблицы Из СтрокаДерева.Строки Цикл
				
				УчастникМассивом = Новый Массив;
				УчастникМассивом.Добавить(Путь + ".НомерСтроки" + ?(ЗначениеЗаполнено(Колонка), "." + Колонка, ""));
				ЗаполнитьАдресаУчастниковСделкиУКД(УчастникМассивом, СтрокаТаблицы, ДатаСведений);
				
			КонецЦикла;
			
		ИначеЕсли СтрокаДерева.Признак = "Группа" Тогда
			
			УчастникМассивом = Новый Массив;
			УчастникМассивом.Добавить(Путь);
			ЗаполнитьАдресаУчастниковСделкиУКД(УчастникМассивом, Данные, ДатаСведений);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УКД_ИнформацияПродавца_ЗаполнитьФункцию(Данные, Параметры)

	Если Параметры.ТипДокумента = ЭлектронныеДокументыЭДО.СтандартныеТипыДокументов().УКД Тогда
		ФункцияУКД = "КСЧФДИС";                
	ИначеЕсли Параметры.ТипДокумента  =ЭлектронныеДокументыЭДО.СтандартныеТипыДокументов().КорректировочныйСчетФактура Тогда
		ФункцияУКД = "КСЧФ";
	Иначе  		
		ФункцияУКД = "ДИС";
	КонецЕсли; 	
	
	ДеревоЭлектронногоДокументаБЭД.ЗаполнитьЗначениеРеквизитаВДереве(Данные, "Функция", ФункцияУКД);	
	
КонецПроцедуры

Процедура ЗаполнитьАдресаУчастниковСделкиУКД(Участники, ДеревоДанных, ДатаАдреса = Неопределено)
	
	ПутьККорнюАдреса = ".Адрес";
	ПутьКСтруктурированномуАдресу = ".Адрес.АдресРФ";
	ПутьКПроизвольномуАдресу      = ".Адрес.АдресИнформация";
	ПутьКИностранномуАдресу       = ".Адрес.АдресИнформация";
	ПолеКодРегиона = ".КодРегиона";
	ПолеНаселПункт = ".НаселенныйПункт";
	ПолеКвартира   = ".Квартира";
		
	Для Каждого Участник Из Участники Цикл
		
		ОбъектКонтактнойИнформации = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, Участник + ".Адрес.АвтоматическиЗаполняемый.ОбъектКонтактнойИнформации");
			
		ВидКонтактнойИнформации    = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, Участник + ".Адрес.АвтоматическиЗаполняемый.ВидКонтактнойИнформации");
		
		Если Не ЗначениеЗаполнено(ОбъектКонтактнойИнформации) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОбработкиОшибок = ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки();
		
		// Корневой элемент группы "АвтоматическиЗаполняемый" может содержать в себе
		// параметры обработки ошибки, которые могут быть добавлены в переопределяемой части.
		СтрокаДерева = ЭлектронноеВзаимодействие.СтрокаДерева(
			ДеревоДанных, Участник + ".Адрес.АвтоматическиЗаполняемый", Истина);
		ЗаполнитьЗначенияСвойств(ПараметрыОбработкиОшибок, СтрокаДерева);
		
		Если ТипЗнч(ВидКонтактнойИнформации) <> Тип("Массив") Тогда
			ВидыКонтактнойИнформации = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВидКонтактнойИнформации);
		Иначе
			ВидыКонтактнойИнформации = ВидКонтактнойИнформации;
		КонецЕсли;
		
		Для Каждого ПроверяемыйВид Из ВидыКонтактнойИнформации Цикл 
			КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
				ОбъектКонтактнойИнформации, ПроверяемыйВид, ДатаАдреса, Ложь);
				
			Если КонтактнаяИнформация.Количество() Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;	
				
		Если ЗначениеЗаполнено(КонтактнаяИнформация) Тогда
			
			АдресЗначение = КонтактнаяИнформация[0].Значение;
			Адрес = РаботаСАдресами.СведенияОбАдресе(АдресЗначение, Новый Структура("КодыАдреса", Ложь));
			СоответствуетФорматуКЛАДР = АдресСоответствуетФорматуКЛАДР(Адрес);
			
			Если Адрес.КодСтраны = "643" Тогда // Россия
				
				Если СоответствуетФорматуКЛАДР Тогда
					
					// Заполняем структурированный адрес.
					
					ПутьКАдресу = Участник + ПутьКСтруктурированномуАдресу;
					
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Индекс", Адрес.Индекс, ПараметрыОбработкиОшибок);
						
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ПолеКодРегиона, Адрес.КодРегиона,
						ПараметрыОшибкиЗаполненияКодаРегиона(ПараметрыОбработкиОшибок, ОбъектКонтактнойИнформации));
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(Адрес.Район, Адрес.РайонСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Район", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(Адрес.Город, Адрес.ГородСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Город", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
						Адрес.НаселенныйПункт, Адрес.НаселенныйПунктСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ПолеНаселПункт, ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(Адрес.Улица, Адрес.УлицаСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Улица", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
						НРег(Адрес.Здание.ТипЗдания), "№", Адрес.Здание.Номер);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Дом", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					Если Адрес.Корпуса.Количество() Тогда
						ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
							НРег(Адрес.Корпуса[0].ТипКорпуса), Адрес.Корпуса[0].Номер);
					Иначе
						ПредставлениеЭлемента = "";
					КонецЕсли;
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Корпус", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					Если Адрес.Помещения.Количество() Тогда
						ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
							НРег(Адрес.Помещения[0].ТипПомещения), Адрес.Помещения[0].Номер);
					Иначе
						ПредставлениеЭлемента = "";
					КонецЕсли;
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ПолеКвартира, ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
				Иначе
					
					// Заполняем адрес в произвольной форме.
					
					ПутьКАдресу = Участник + ПутьКПроизвольномуАдресу;
					
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
							ДеревоДанных, ПутьКАдресу + ".КодСтраны", Адрес.КодСтраны, ПараметрыОбработкиОшибок);
						
					Если Адрес.ТипАдреса = "Муниципальный" Тогда

						ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
								ДеревоДанных, ПутьКАдресу + ".АдресТекст", Адрес.МуниципальноеПредставление,
							ПараметрыОбработкиОшибок);
					Иначе
						ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
								ДеревоДанных, ПутьКАдресу + ".АдресТекст", Адрес.Представление,
							ПараметрыОбработкиОшибок);

					КонецЕсли;	
				КонецЕсли;
				
			Иначе
				
				ПутьКАдресу = Участник + ПутьКИностранномуАдресу;
				
				ПолеКодСтраны  = ".КодСтраны";
				ПолеАдресТекст = ".АдресТекст";
				
				Если ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных, ПутьКАдресу + ".КодСтр") Тогда
					ПолеКодСтраны  = ".КодСтр";
					ПолеАдресТекст = ".АдрТекст";
				КонецЕсли;
				
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
					ДеревоДанных, ПутьКАдресу + ПолеКодСтраны, Адрес.КодСтраны, ПараметрыОбработкиОшибок);
				
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
					ДеревоДанных, ПутьКАдресу + ПолеАдресТекст, Адрес.Представление, ПараметрыОбработкиОшибок);
				
			КонецЕсли;
				
		Иначе
			
			// Не заполнена контактная информация.
			// Очищаем значение адреса, чтобы проверка заполненности не считала реквизит заполненным.
			
			ПутьКАдресу = Участник + ПутьККорнюАдреса;
			ДеревоЭлектронногоДокументаБЭД.ОчиститьЗначениеВСтрокеДерева(ДеревоДанных, ПутьКАдресу, ПараметрыОбработкиОшибок);			
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура АктОРасхожденииИнформацияПокупателя_АвтозаполнениеАдресов(Данные)
	
	ДатаСведений = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "ДатаАкта", Ложь);
	
	Участники = Новый Структура;
	Участники.Вставить("Продавец");
	Участники.Вставить("Покупатель");
	Участники.Вставить("Грузоотправитель");
	Участники.Вставить("Грузополучатель");
	Участники.Вставить("СтраховаяКомпания");
	
	Для каждого КлючЗначение Из Участники Цикл
		
		Путь = КлючЗначение.Ключ;
		Колонка = КлючЗначение.Значение;
		
		СтрокаДерева = Данные.Строки.Найти(Путь, "ПолныйПуть");
		
		Если СтрокаДерева.Признак = "Таблица" Тогда
			
			Для каждого СтрокаТаблицы Из СтрокаДерева.Строки Цикл
				
				УчастникМассивом = Новый Массив;
				УчастникМассивом.Добавить(Путь + ".НомерСтроки" + ?(ЗначениеЗаполнено(Колонка), "." + Колонка, ""));
				ЗаполнитьАдресаУчастниковСделкиАктОРасхождении(УчастникМассивом, СтрокаТаблицы, ДатаСведений);
				
			КонецЦикла;
			
		ИначеЕсли СтрокаДерева.Признак = "Группа" Тогда
			
			УчастникМассивом = Новый Массив;
			УчастникМассивом.Добавить(Путь);
			ЗаполнитьАдресаУчастниковСделкиАктОРасхождении(УчастникМассивом, Данные, ДатаСведений);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьАдресаУчастниковСделкиАктОРасхождении(Участники, ДеревоДанных, ДатаАдреса = Неопределено)
	
	ПутьККорнюАдреса = ".Адрес";
	ПутьКСтруктурированномуАдресу = ".Адрес.АдресРФ";
	ПутьКПроизвольномуАдресу      = ".Адрес.АдресИнформация";
	ПутьКИностранномуАдресу       = ".Адрес.АдресИнформация";
	ПолеКодРегиона = ".КодРегиона";
	ПолеНаселПункт = ".НаселенныйПункт";
	ПолеКвартира   = ".Квартира";
		
	Для Каждого Участник Из Участники Цикл
		
		ОбъектКонтактнойИнформации = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, Участник + ".Адрес.АвтоматическиЗаполняемый.ОбъектКонтактнойИнформации");
			
		ВидКонтактнойИнформации    = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, Участник + ".Адрес.АвтоматическиЗаполняемый.ВидКонтактнойИнформации");
		
		Если Не ЗначениеЗаполнено(ОбъектКонтактнойИнформации) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОбработкиОшибок = ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки();
		
		// Корневой элемент группы "АвтоматическиЗаполняемый" может содержать в себе
		// параметры обработки ошибки, которые могут быть добавлены в переопределяемой части.
		СтрокаДерева = ЭлектронноеВзаимодействие.СтрокаДерева(
			ДеревоДанных, Участник + ".Адрес.АвтоматическиЗаполняемый", Истина);
		ЗаполнитьЗначенияСвойств(ПараметрыОбработкиОшибок, СтрокаДерева);
		
		Если ТипЗнч(ВидКонтактнойИнформации) <> Тип("Массив") Тогда
			ВидыКонтактнойИнформации = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВидКонтактнойИнформации);
		Иначе
			ВидыКонтактнойИнформации = ВидКонтактнойИнформации;
		КонецЕсли;
		
		Для Каждого ПроверяемыйВид Из ВидыКонтактнойИнформации Цикл 
			КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
				ОбъектКонтактнойИнформации, ПроверяемыйВид, ДатаАдреса, Ложь);
				
			Если КонтактнаяИнформация.Количество() Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;		
			
		Если ЗначениеЗаполнено(КонтактнаяИнформация) Тогда
			
			АдресЗначение = КонтактнаяИнформация[0].Значение;
			Адрес = РаботаСАдресами.СведенияОбАдресе(АдресЗначение, Новый Структура("КодыАдреса", Ложь));
			СоответствуетФорматуКЛАДР = АдресСоответствуетФорматуКЛАДР(Адрес);
			
			Если Адрес.КодСтраны = "643" Тогда // Россия
				
				Если СоответствуетФорматуКЛАДР Тогда
					
					// Заполняем структурированный адрес.
					
					ПутьКАдресу = Участник + ПутьКСтруктурированномуАдресу;
					
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Индекс", Адрес.Индекс, ПараметрыОбработкиОшибок);
						
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ПолеКодРегиона, Адрес.КодРегиона,
						ПараметрыОшибкиЗаполненияКодаРегиона(ПараметрыОбработкиОшибок, ОбъектКонтактнойИнформации));
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(Адрес.Район, Адрес.РайонСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Район", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(Адрес.Город, Адрес.ГородСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Город", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
						Адрес.НаселенныйПункт, Адрес.НаселенныйПунктСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ПолеНаселПункт, ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(Адрес.Улица, Адрес.УлицаСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Улица", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
						НРег(Адрес.Здание.ТипЗдания), "№", Адрес.Здание.Номер);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Дом", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					Если Адрес.Корпуса.Количество() Тогда
						ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
							НРег(Адрес.Корпуса[0].ТипКорпуса), Адрес.Корпуса[0].Номер);
					Иначе
						ПредставлениеЭлемента = "";
					КонецЕсли;
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Корпус", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					Если Адрес.Помещения.Количество() Тогда
						ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
							НРег(Адрес.Помещения[0].ТипПомещения), Адрес.Помещения[0].Номер);
					Иначе
						ПредставлениеЭлемента = "";
					КонецЕсли;
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ПолеКвартира, ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
				Иначе
					
					// Заполняем адрес в произвольной форме.
					
					ПутьКАдресу = Участник + ПутьКПроизвольномуАдресу;

					Если Адрес.ТипАдреса = "Муниципальный" Тогда

						ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
								ДеревоДанных, ПутьКАдресу + ".АдресТекст", Адрес.МуниципальноеПредставление,
							ПараметрыОбработкиОшибок);
							
					Иначе
						ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
								ДеревоДанных, ПутьКАдресу + ".АдресТекст", Адрес.Представление,
							ПараметрыОбработкиОшибок);

					КонецЕсли;
					
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
								ДеревоДанных, ПутьКАдресу + ".КодСтраны", Адрес.КодСтраны,
							ПараметрыОбработкиОшибок); 
						
				КонецЕсли;
				
			Иначе
				
				ПутьКАдресу = Участник + ПутьКИностранномуАдресу;
				
				ПолеКодСтраны  = ".КодСтраны";
				ПолеАдресТекст = ".АдресТекст";
				
				Если ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных, ПутьКАдресу + ".КодСтр") Тогда
					ПолеКодСтраны  = ".КодСтр";
					ПолеАдресТекст = ".АдрТекст";
				КонецЕсли;
				
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
					ДеревоДанных, ПутьКАдресу + ПолеКодСтраны, Адрес.КодСтраны, ПараметрыОбработкиОшибок);
				
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
					ДеревоДанных, ПутьКАдресу + ПолеАдресТекст, Адрес.Представление, ПараметрыОбработкиОшибок);
				
			КонецЕсли;
				
		Иначе
			
			// Не заполнена контактная информация.
			// Очищаем значение адреса, чтобы проверка заполненности не считала реквизит заполненным.
			
			ПутьКАдресу = Участник + ПутьККорнюАдреса;
			ДеревоЭлектронногоДокументаБЭД.ОчиститьЗначениеВСтрокеДерева(ДеревоДанных, ПутьКАдресу, ПараметрыОбработкиОшибок);			
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередачаУслуг_ИнформацияПродавца_АвтозаполнениеАдресов(Данные)
	
	ДатаСведений = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "ДатаАкта", Ложь);
	
	Участники = Новый Структура;
	Участники.Вставить("Исполнитель");
	Участники.Вставить("Заказчик");
	
	Для каждого КлючЗначение Из Участники Цикл
		
		Путь = КлючЗначение.Ключ;
		Колонка = КлючЗначение.Значение;
		
		СтрокаДерева = Данные.Строки.Найти(Путь, "ПолныйПуть");
		
		Если СтрокаДерева.Признак = "Таблица" Тогда
			
			Для каждого СтрокаТаблицы Из СтрокаДерева.Строки Цикл
				
				УчастникМассивом = Новый Массив;
				УчастникМассивом.Добавить(Путь + ".НомерСтроки" + ?(ЗначениеЗаполнено(Колонка), "." + Колонка, ""));
				ЗаполнитьАдресаУчастниковСделкиПередачаТоваров(УчастникМассивом, СтрокаТаблицы, ДатаСведений);
				
			КонецЦикла;
			
		ИначеЕсли СтрокаДерева.Признак = "Группа" Тогда
			
			УчастникМассивом = Новый Массив;
			УчастникМассивом.Добавить(Путь);
			ЗаполнитьАдресаУчастниковСделкиПередачаТоваров(УчастникМассивом, Данные, ДатаСведений);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередачаТоваров_ИнформацияПродавца_АвтозаполнениеАдресов(Данные)
	
	ДатаСведений = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "ДатаТоварнойНакладной", Ложь);
	
	Участники = Новый Структура;
	Участники.Вставить("Поставщик");
	Участники.Вставить("Плательщик");
	Участники.Вставить("Грузоотправитель");
	Участники.Вставить("Грузополучатель");
	
	Для каждого КлючЗначение Из Участники Цикл
		
		Путь = КлючЗначение.Ключ;
		Колонка = КлючЗначение.Значение;
		
		СтрокаДерева = Данные.Строки.Найти(Путь, "ПолныйПуть");
		
		Если СтрокаДерева.Признак = "Таблица" Тогда
			
			Для каждого СтрокаТаблицы Из СтрокаДерева.Строки Цикл
				
				УчастникМассивом = Новый Массив;
				УчастникМассивом.Добавить(Путь + ".НомерСтроки" + ?(ЗначениеЗаполнено(Колонка), "." + Колонка, ""));
				ЗаполнитьАдресаУчастниковСделкиПередачаТоваров(УчастникМассивом, СтрокаТаблицы, ДатаСведений);
				
			КонецЦикла;
			
		ИначеЕсли СтрокаДерева.Признак = "Группа" Тогда
			
			УчастникМассивом = Новый Массив;
			УчастникМассивом.Добавить(Путь);
			ЗаполнитьАдресаУчастниковСделкиПередачаТоваров(УчастникМассивом, Данные, ДатаСведений);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьАдресаУчастниковСделкиПередачаТоваров(Участники, ДеревоДанных, ДатаАдреса = Неопределено)
	
	ПутьККорнюАдреса = ".Адрес";
	ПутьКСтруктурированномуАдресу = ".Адрес.Структурированный";
	ПутьКПроизвольномуАдресу      = ".Адрес.Произвольный";
	ПутьКИностранномуАдресу       = ".Адрес.Иностранный";
	ПолеКодРегиона = ".КодРегион";
	ПолеНаселПункт = ".НаселПункт";
	ПолеКвартира   = ".Кварт";
		
	Для Каждого Участник Из Участники Цикл
		
		ОбъектКонтактнойИнформации = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, Участник + ".Адрес.АвтоматическиЗаполняемый.ОбъектКонтактнойИнформации");
			
		ВидКонтактнойИнформации    = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, Участник + ".Адрес.АвтоматическиЗаполняемый.ВидКонтактнойИнформации");
		
		Если Не ЗначениеЗаполнено(ОбъектКонтактнойИнформации) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОбработкиОшибок = ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки();
		
		// Корневой элемент группы "АвтоматическиЗаполняемый" может содержать в себе
		// параметры обработки ошибки, которые могут быть добавлены в переопределяемой части.
		СтрокаДерева = ЭлектронноеВзаимодействие.СтрокаДерева(
			ДеревоДанных, Участник + ".Адрес.АвтоматическиЗаполняемый", Истина);
		ЗаполнитьЗначенияСвойств(ПараметрыОбработкиОшибок, СтрокаДерева);
		
		Если ТипЗнч(ВидКонтактнойИнформации) <> Тип("Массив") Тогда
			ВидыКонтактнойИнформации = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВидКонтактнойИнформации);
		Иначе
			ВидыКонтактнойИнформации = ВидКонтактнойИнформации;
		КонецЕсли;
		
		Для Каждого ПроверяемыйВид Из ВидыКонтактнойИнформации Цикл 
			КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
				ОбъектКонтактнойИнформации, ПроверяемыйВид, ДатаАдреса, Ложь);
				
			Если КонтактнаяИнформация.Количество() Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;		
			
		Если ЗначениеЗаполнено(КонтактнаяИнформация) Тогда
			
			АдресЗначение = КонтактнаяИнформация[0].Значение;
			Адрес = РаботаСАдресами.СведенияОбАдресе(АдресЗначение, Новый Структура("КодыАдреса", Ложь));
			СоответствуетФорматуКЛАДР = АдресСоответствуетФорматуКЛАДР(Адрес);
			
			Если Адрес.КодСтраны = "643" Тогда // Россия
				
				Если СоответствуетФорматуКЛАДР Тогда
					
					// Заполняем структурированный адрес.
					
					ПутьКАдресу = Участник + ПутьКСтруктурированномуАдресу;
					
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Индекс", Адрес.Индекс, ПараметрыОбработкиОшибок);
						
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ПолеКодРегиона, Адрес.КодРегиона,
						ПараметрыОшибкиЗаполненияКодаРегиона(ПараметрыОбработкиОшибок, ОбъектКонтактнойИнформации));
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(Адрес.Район, Адрес.РайонСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Район", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(Адрес.Город, Адрес.ГородСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Город", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
						Адрес.НаселенныйПункт, Адрес.НаселенныйПунктСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ПолеНаселПункт, ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(Адрес.Улица, Адрес.УлицаСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Улица", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
						НРег(Адрес.Здание.ТипЗдания), "№", Адрес.Здание.Номер);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Дом", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					Если Адрес.Корпуса.Количество() Тогда
						ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
							НРег(Адрес.Корпуса[0].ТипКорпуса), Адрес.Корпуса[0].Номер);
					Иначе
						ПредставлениеЭлемента = "";
					КонецЕсли;
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Корпус", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					Если Адрес.Помещения.Количество() Тогда
						ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
							НРег(Адрес.Помещения[0].ТипПомещения), Адрес.Помещения[0].Номер);
					Иначе
						ПредставлениеЭлемента = "";
					КонецЕсли;
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ПолеКвартира, ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
				Иначе
					
					// Заполняем адрес в произвольной форме.
					
					ПутьКАдресу = Участник + ПутьКПроизвольномуАдресу;
					
					Если Адрес.ТипАдреса = "Муниципальный" Тогда

						ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
								ДеревоДанных, ПутьКАдресу, Адрес.МуниципальноеПредставление,
							ПараметрыОбработкиОшибок);
					Иначе
						ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
								ДеревоДанных, ПутьКАдресу, Адрес.Представление,
							ПараметрыОбработкиОшибок);

					КонецЕсли;	
						
				КонецЕсли;
				
			Иначе
				
				ПутьКАдресу = Участник + ПутьКИностранномуАдресу;
				
				ПолеКодСтраны  = ".КодСтраны";
				ПолеАдресТекст = ".АдресТекст";
				
				Если ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных, ПутьКАдресу + ".КодСтр") Тогда
					ПолеКодСтраны  = ".КодСтр";
					ПолеАдресТекст = ".АдрТекст";
				КонецЕсли;
				
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
					ДеревоДанных, ПутьКАдресу + ПолеКодСтраны, Адрес.КодСтраны, ПараметрыОбработкиОшибок);
				
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
					ДеревоДанных, ПутьКАдресу + ПолеАдресТекст, Адрес.Представление, ПараметрыОбработкиОшибок);
				
			КонецЕсли;
				
		Иначе
			
			// Не заполнена контактная информация.
			// Очищаем значение адреса, чтобы проверка заполненности не считала реквизит заполненным.
			
			ПутьКАдресу = Участник + ПутьККорнюАдреса;
			ДеревоЭлектронногоДокументаБЭД.ОчиститьЗначениеВСтрокеДерева(ДеревоДанных, ПутьКАдресу, ПараметрыОбработкиОшибок);			
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД2019_ИнформацияПродавца_АвтозаполнениеАдресов(Данные)
	
	ДатаСведений = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "ДатаДокумента", Ложь);
	
	Участники = Новый Структура;
	Участники.Вставить("СведенияОПродавце");
	Участники.Вставить("СведенияОПокупателе");
	Участники.Вставить("СведенияОГрузоотправителе", "Грузоотправитель");
	Участники.Вставить("СведенияОГрузополучателе");
	Участники.Вставить("СведенияОКомиссионере");
	Участники.Вставить("СведенияОПеревозчике");
	
	Для каждого КлючЗначение Из Участники Цикл
		
		Путь = КлючЗначение.Ключ;
		Колонка = КлючЗначение.Значение;
		
		СтрокаДерева = Данные.Строки.Найти(Путь, "ПолныйПуть");
		
		Если СтрокаДерева.Признак = "Таблица" Тогда
			
			Для каждого СтрокаТаблицы Из СтрокаДерева.Строки Цикл
				
				УчастникМассивом = Новый Массив;
				УчастникМассивом.Добавить(Путь + ".НомерСтроки" + ?(ЗначениеЗаполнено(Колонка), "." + Колонка, ""));
				ЗаполнитьАдресаУчастниковСделкиУПД2019(УчастникМассивом, СтрокаТаблицы, ДатаСведений);
				
			КонецЦикла;
			
		ИначеЕсли СтрокаДерева.Признак = "Группа" Тогда
			
			УчастникМассивом = Новый Массив;
			УчастникМассивом.Добавить(Путь);
			ЗаполнитьАдресаУчастниковСделкиУПД2019(УчастникМассивом, Данные, ДатаСведений);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УПД2019_ИнформацияПродавца_ЗаполнитьФункцию(Данные, Параметры)

	Если Параметры.ТипДокумента = ЭлектронныеДокументыЭДО.СтандартныеТипыДокументов().УПД Тогда
		ФункцияУПД = "СЧФДОП";                
	ИначеЕсли Параметры.ТипДокумента  = ЭлектронныеДокументыЭДО.СтандартныеТипыДокументов().СчетФактура Тогда
		ФункцияУПД = "СЧФ";
	Иначе  		
		ФункцияУПД = "ДОП";
	КонецЕсли; 	
	
	ДеревоЭлектронногоДокументаБЭД.ЗаполнитьЗначениеРеквизитаВДереве(Данные, "Функция", ФункцияУПД);	
	
КонецПроцедуры

Процедура ЗаполнитьАдресаУчастниковСделкиУПД2019(Участники, ДеревоДанных, ДатаАдреса = Неопределено)
	
	ПутьККорнюАдреса = ".Адрес";
	ПутьКСтруктурированномуАдресу = ".Адрес.АдресРФ";
	ПутьКПроизвольномуАдресу      = ".Адрес.АдресИнформация";
	ПутьКИностранномуАдресу       = ".Адрес.АдресИнформация";
	ПолеКодРегиона = ".КодРегиона";
	ПолеНаселПункт = ".НаселенныйПункт";
	ПолеКвартира   = ".Квартира";
		
	Для Каждого Участник Из Участники Цикл
		
		ОбъектКонтактнойИнформации = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, Участник + ".Адрес.АвтоматическиЗаполняемый.ОбъектКонтактнойИнформации");
			
		ВидКонтактнойИнформации    = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, Участник + ".Адрес.АвтоматическиЗаполняемый.ВидКонтактнойИнформации");
		
		Если Не ЗначениеЗаполнено(ОбъектКонтактнойИнформации) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОбработкиОшибок = ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки();
		
		// Корневой элемент группы "АвтоматическиЗаполняемый" может содержать в себе
		// параметры обработки ошибки, которые могут быть добавлены в переопределяемой части.
		СтрокаДерева = ЭлектронноеВзаимодействие.СтрокаДерева(
			ДеревоДанных, Участник + ".Адрес.АвтоматическиЗаполняемый", Истина);
		ЗаполнитьЗначенияСвойств(ПараметрыОбработкиОшибок, СтрокаДерева);
		
		Если ТипЗнч(ВидКонтактнойИнформации) <> Тип("Массив") Тогда
			ВидыКонтактнойИнформации = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВидКонтактнойИнформации);
		Иначе
			ВидыКонтактнойИнформации = ВидКонтактнойИнформации;
		КонецЕсли;
		
		Для Каждого ПроверяемыйВид Из ВидыКонтактнойИнформации Цикл 
			КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
				ОбъектКонтактнойИнформации, ПроверяемыйВид, ДатаАдреса, Ложь);
				
			Если КонтактнаяИнформация.Количество() Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;		
			
		Если ЗначениеЗаполнено(КонтактнаяИнформация) Тогда
			
			АдресЗначение = КонтактнаяИнформация[0].Значение;
			Адрес = РаботаСАдресами.СведенияОбАдресе(АдресЗначение, Новый Структура("КодыАдреса", Ложь));
			СоответствуетФорматуКЛАДР = АдресСоответствуетФорматуКЛАДР(Адрес);
			
			Если Адрес.КодСтраны = "643" Тогда // Россия
				
				Если СоответствуетФорматуКЛАДР Тогда
					
					// Заполняем структурированный адрес.
					
					ПутьКАдресу = Участник + ПутьКСтруктурированномуАдресу;
					
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Индекс", Адрес.Индекс, ПараметрыОбработкиОшибок);
						
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ПолеКодРегиона, Адрес.КодРегиона,
						ПараметрыОшибкиЗаполненияКодаРегиона(ПараметрыОбработкиОшибок, ОбъектКонтактнойИнформации));
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(Адрес.Район, Адрес.РайонСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Район", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(Адрес.Город, Адрес.ГородСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Город", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
						Адрес.НаселенныйПункт, Адрес.НаселенныйПунктСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ПолеНаселПункт, ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(Адрес.Улица, Адрес.УлицаСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Улица", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
						НРег(Адрес.Здание.ТипЗдания), "№", Адрес.Здание.Номер);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Дом", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					Если Адрес.Корпуса.Количество() Тогда
						ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
							НРег(Адрес.Корпуса[0].ТипКорпуса), Адрес.Корпуса[0].Номер);
					Иначе
						ПредставлениеЭлемента = "";
					КонецЕсли;
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Корпус", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					Если Адрес.Помещения.Количество() Тогда
						ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
							НРег(Адрес.Помещения[0].ТипПомещения), Адрес.Помещения[0].Номер);
					Иначе
						ПредставлениеЭлемента = "";
					КонецЕсли;
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ПолеКвартира, ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
				Иначе
					
					// Заполняем адрес в произвольной форме.
					
					ПутьКАдресу = Участник + ПутьКПроизвольномуАдресу;
					
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
							ДеревоДанных, ПутьКАдресу + ".КодСтраны", Адрес.КодСтраны, ПараметрыОбработкиОшибок);

					Если Адрес.ТипАдреса = "Муниципальный" Тогда

						ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
								ДеревоДанных, ПутьКАдресу + ".АдресТекст", Адрес.МуниципальноеПредставление,
							ПараметрыОбработкиОшибок);
					Иначе
						ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
								ДеревоДанных, ПутьКАдресу + ".АдресТекст", Адрес.Представление,
							ПараметрыОбработкиОшибок);

					КонецЕсли;
						
				КонецЕсли;
				
			Иначе
				
				ПутьКАдресу = Участник + ПутьКИностранномуАдресу;
				
				ПолеКодСтраны  = ".КодСтраны";
				ПолеАдресТекст = ".АдресТекст";
				
				Если ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных, ПутьКАдресу + ".КодСтр") Тогда
					ПолеКодСтраны  = ".КодСтр";
					ПолеАдресТекст = ".АдрТекст";
				КонецЕсли;
				
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
					ДеревоДанных, ПутьКАдресу + ПолеКодСтраны, Адрес.КодСтраны, ПараметрыОбработкиОшибок);
				
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
					ДеревоДанных, ПутьКАдресу + ПолеАдресТекст, Адрес.Представление, ПараметрыОбработкиОшибок);
				
			КонецЕсли;
				
		Иначе
			
			// Не заполнена контактная информация.
			// Очищаем значение адреса, чтобы проверка заполненности не считала реквизит заполненным.
			
			ПутьКАдресу = Участник + ПутьККорнюАдреса;
			ДеревоЭлектронногоДокументаБЭД.ОчиститьЗначениеВСтрокеДерева(ДеревоДанных, ПутьКАдресу, ПараметрыОбработкиОшибок);			
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет в дереве электронного документа поле "Адрес"
// по полям, заполняемым на стороне прикладного решения:
//  "Адрес.АвтоматическиЗаполняемый.ОбъектКонтактнойИнформации",
//  "Адрес.АвтоматическиЗаполняемый.ВидКонтактнойИнформации".
//
// Параметры:
//  Участники - Массив - участники сделки в дереве электронного документа.
//   *ЭлементМассива - Строка - Путь в дереве электронного документа до участника сделки.
//  ДеревоДанных - ДеревоЗначений - Дерево электронного документа.
//  ДатаАдреса - Дата - дата получения контактной информации. Если не задана, то используется текущая дата сеанса.
//
Процедура ЗаполнитьАдресаУчастниковСделкиCML(Участники, ДеревоДанных, ДатаАдреса = Неопределено)
	
	Если Не ЗначениеЗаполнено(ДатаАдреса) Тогда
		ДатаАдреса = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ПутьККорнюАдреса = ".Адрес";
	ПутьКСтруктурированномуАдресу = ".Адрес.Структурированный";
	ПутьКПроизвольномуАдресу = ".Адрес.Произвольный";
	ПутьКИностранномуАдресу = ".Адрес.Иностранный";
	ПолеКодРегиона = ".КодРегион";
	ПолеНаселПункт = ".НаселПункт";
	ПолеКвартира = ".Кварт";
	
	Для Каждого Участник Из Участники Цикл
		
		ОбъектКонтактнойИнформации = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, Участник + ".Адрес.АвтоматическиЗаполняемый.ОбъектКонтактнойИнформации");
			
		ВидКонтактнойИнформации    = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, Участник + ".Адрес.АвтоматическиЗаполняемый.ВидКонтактнойИнформации");
		
		Если Не ЗначениеЗаполнено(ОбъектКонтактнойИнформации) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОбработкиОшибок = ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки();
		
		// Корневой элемент группы "АвтоматическиЗаполняемый" может содержать в себе
		// параметры обработки ошибки, которые могут быть добавлены в переопределяемой части.
		СтрокаДерева = ЭлектронноеВзаимодействие.СтрокаДерева(
			ДеревоДанных, Участник + ".Адрес.АвтоматическиЗаполняемый", Истина);
		ЗаполнитьЗначенияСвойств(ПараметрыОбработкиОшибок, СтрокаДерева);
				
		Если ТипЗнч(ВидКонтактнойИнформации) <> Тип("Массив") Тогда
			ВидыКонтактнойИнформации = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВидКонтактнойИнформации);
		Иначе
			ВидыКонтактнойИнформации = ВидКонтактнойИнформации;
		КонецЕсли;
		
		Для Каждого ПроверяемыйВид Из ВидыКонтактнойИнформации Цикл 
			КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
				ОбъектКонтактнойИнформации, ПроверяемыйВид, ДатаАдреса, Ложь);
				
			Если КонтактнаяИнформация.Количество() Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;			
			
		Если ЗначениеЗаполнено(КонтактнаяИнформация) Тогда
			
			АдресЗначение = КонтактнаяИнформация[0].Значение;
			Адрес = РаботаСАдресами.СведенияОбАдресе(АдресЗначение, Новый Структура("КодыАдреса", Ложь));
			СоответствуетФорматуКЛАДР = АдресСоответствуетФорматуКЛАДР(Адрес);
			
			Если Адрес.КодСтраны = "643" Тогда // Россия
				
				Если СоответствуетФорматуКЛАДР Тогда
					
					// Заполняем структурированный адрес.
					
					ПутьКАдресу = Участник + ПутьКСтруктурированномуАдресу;
					
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Индекс", Адрес.Индекс, ПараметрыОбработкиОшибок);				
				
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ПолеКодРегиона, Адрес.КодРегиона, 
						ПараметрыОшибкиЗаполненияКодаРегиона(ПараметрыОбработкиОшибок, ОбъектКонтактнойИнформации));
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(Адрес.Район, Адрес.РайонСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Район", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(Адрес.Город, Адрес.ГородСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Город", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
						Адрес.НаселенныйПункт, Адрес.НаселенныйПунктСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ПолеНаселПункт, ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(Адрес.Улица, Адрес.УлицаСокращение);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Улица", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
						НРег(Адрес.Здание.ТипЗдания), "№", Адрес.Здание.Номер);
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Дом", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					Если Адрес.Корпуса.Количество() Тогда
						ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
							НРег(Адрес.Корпуса[0].ТипКорпуса), Адрес.Корпуса[0].Номер);
					Иначе
						ПредставлениеЭлемента = "";
					КонецЕсли;
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ".Корпус", ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
					Если Адрес.Помещения.Количество() Тогда
						ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
							НРег(Адрес.Помещения[0].ТипПомещения), Адрес.Помещения[0].Номер);
					Иначе
						ПредставлениеЭлемента = "";
					КонецЕсли;
					ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
						ДеревоДанных, ПутьКАдресу + ПолеКвартира, ПредставлениеЭлемента, ПараметрыОбработкиОшибок);
						
				Иначе
					
					// Заполняем адрес в произвольной форме.
					
					ПутьКАдресу = Участник + ПутьКПроизвольномуАдресу;
					
					Если Адрес.ТипАдреса = "Муниципальный" Тогда

						ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
								ДеревоДанных, ПутьКАдресу, Адрес.МуниципальноеПредставление,
							ПараметрыОбработкиОшибок);
					Иначе
						ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
								ДеревоДанных, ПутьКАдресу, Адрес.Представление,
							ПараметрыОбработкиОшибок);

					КонецЕсли;
				КонецЕсли;
				
			Иначе
				
				ПутьКАдресу = Участник + ПутьКИностранномуАдресу;
				
				ПолеКодСтраны  = ".КодСтраны";
				ПолеАдресТекст = ".АдресТекст";
				
				Если ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных, ПутьКАдресу + ".КодСтр") Тогда
					ПолеКодСтраны  = ".КодСтр";
					ПолеАдресТекст = ".АдрТекст";
				КонецЕсли;
				
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
					ДеревоДанных, ПутьКАдресу + ПолеКодСтраны, Адрес.КодСтраны, ПараметрыОбработкиОшибок);
				
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
					ДеревоДанных, ПутьКАдресу + ПолеАдресТекст, Адрес.Представление, ПараметрыОбработкиОшибок);
				
			КонецЕсли;
				
		Иначе
			
			// Не заполнена контактная информация.
			// Очищаем значение адреса, чтобы проверка заполненности не считала реквизит заполненным.
			
			ПутьКАдресу = Участник + ПутьККорнюАдреса;
			ДеревоЭлектронногоДокументаБЭД.ОчиститьЗначениеВСтрокеДерева(ДеревоДанных, ПутьКАдресу, ПараметрыОбработкиОшибок);			
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПараметрыОшибкиЗаполненияКодаРегиона(ПараметрыОбработкиОшибок, ОбъектКонтактнойИнформации)
	ПараметрыОбработкиОшибокКодРегиона = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыОбработкиОшибок);	
	
	Если Не ЗначениеЗаполнено(ПараметрыОбработкиОшибокКодРегиона.ТекстОшибки) Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru ='Не удалось определить код региона адреса для %1. Возможно, адрес указан в свободной форме.
			|Смените тип адреса (команды ""Административно-территориальное"" или ""Муниципальное деление"" меню ""Еще"" формы редактирования адреса.'"),
			ОбъектКонтактнойИнформации);
		ПараметрыОбработкиОшибокКодРегиона.ТекстОшибки = ТекстОшибки;
	КонецЕсли;
	
	Возврат ПараметрыОбработкиОшибокКодРегиона;
	
КонецФункции

// Проверяет адрес на соответствие формату КЛАДР. Если в сведении об адресе
// заполнены специфичные для ФИАС поля, то он не поместится в формат КЛАДР.
//
// Параметры:
//  Адрес - Структура - Структура адреса, возвращаемая методом РаботаСАдресами.СведенияОбАдресе.
//
// Возвращаемое значение - Булево - Истина, если адрес соответствует формату КЛАДР.
//
Функция АдресСоответствуетФорматуКЛАДР(СведенияОбАдресе)
	
	Соответствует = Истина;
	
	Если СведенияОбАдресе.ТипАдреса <> "Административно-территориальный"
		ИЛИ ЗначениеЗаполнено(СведенияОбАдресе.Территория)
		ИЛИ СведенияОбАдресе.Корпуса.Количество() > 1
		Или СведенияОбАдресе.Помещения.Количество() > 1 Тогда
		
		Соответствует = Ложь
	КонецЕсли;
	
	Возврат Соответствует;
	
КонецФункции

Функция ПредставлениеАдресногоЭлемента(ПервыйЭлемент = "", ВторойЭлемент = "", ТретийЭлемент = "")

	МассивСоставляющих = Новый Массив;
	Если ЗначениеЗаполнено(ПервыйЭлемент) Тогда
		МассивСоставляющих.Добавить(ПервыйЭлемент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВторойЭлемент) Тогда
		МассивСоставляющих.Добавить(ВторойЭлемент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТретийЭлемент) Тогда
		МассивСоставляющих.Добавить(ТретийЭлемент);
	КонецЕсли;
	
	Возврат СтрСоединить(МассивСоставляющих, " ");

КонецФункции

#КонецОбласти

#Область CML

#Область КаталогТоваров

Функция КаталогТоваров_ДанныеУчета(ОбъектУчета, Параметры, ДополнительныеДанные) Экспорт

	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента("ОбменСКонтрагентами.КаталогТоваров");
	
	Отказ = Ложь;
	
	ДанныеКаталога = ПолучитьИзВременногоХранилища(ДополнительныеДанные.ДанныеКаталога);
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПоКаталогуТоваровCML(
		Параметры.Отправитель, ДанныеКаталога, Данные, Отказ);
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;
	
	КаталогТоваров_Автозаполнение(Данные, ОбъектУчета);
	
	Если Параметры.ВыгружатьДополнительныеСведения Тогда
		КаталогТоваров_ДобавитьДополнительныеДанные(Данные);
	КонецЕсли;
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	Результат.Основания.Добавить(ОбъектУчета);
	
	Возврат Результат;

КонецФункции

Процедура КаталогТоваров_Автозаполнение(Данные, Знач ОбъектУчета)
	
	УчастникиСделки = Новый Массив;
	УчастникиСделки.Добавить("Владелец");
	
	ДатаСведений = ТекущаяДатаСеанса();
	
	ЗаполнитьАдресаУчастниковСделкиCML(УчастникиСделки, Данные, ДатаСведений);
	
	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("_Операция", "КаталогТоваров");
	ДополнительныеДанные.Вставить("Ид", ИдентификаторОбъектаУчета(ОбъектУчета));
	ДополнитьДанныеДокумента(Данные, ДополнительныеДанные);
	
КонецПроцедуры

Процедура КаталогТоваров_ДобавитьДополнительныеДанные(Данные)
	
	ПоместитьСопоставлениеНоменклатурыВДополнительныеДанныеCML(Данные, "Товары");
	
КонецПроцедуры

#КонецОбласти

#Область ПрайсЛист

Функция ПрайсЛист_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента("ОбменСКонтрагентами.ПрайсЛист");
	
	Отказ = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПоПрайсЛисту(ОбъектУчета, Данные, Отказ);
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;
	
	ПрайсЛист_Автозаполнение(Данные, ОбъектУчета);
	
	Если Параметры.ВыгружатьДополнительныеСведения Тогда
		ПрайсЛист_ДобавитьДополнительныеДанные(Данные);
	КонецЕсли;
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	Результат.Основания.Добавить(ОбъектУчета);
	
	Возврат Результат;
	
КонецФункции

Процедура ПрайсЛист_Автозаполнение(Данные, Знач ОбъектУчета)
	
	ДатаСведений = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "ДатаФормирования", Ложь);
	
	УчастникиСделки = Новый Массив;
	УчастникиСделки.Добавить("Владелец");
	ЗаполнитьАдресаУчастниковСделкиCML(УчастникиСделки, Данные, ДатаСведений);
	
	Описание = ОписаниеОснованияЭлектронногоДокумента(ОбъектУчета);
	
	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("_Операция", "ПрайсЛист");
	ДополнительныеДанные.Вставить("Ид", ИдентификаторОбъектаУчета(ОбъектУчета));
	ДополнительныеДанные.Вставить("Номер", Описание.Номер);
	ДополнительныеДанные.Вставить("Дата", Описание.Дата);
	
	ДополнитьДанныеДокумента(Данные, ДополнительныеДанные);
	
КонецПроцедуры

Процедура ПрайсЛист_ДобавитьДополнительныеДанные(Данные)
	
	ПоместитьСопоставлениеНоменклатурыВДополнительныеДанныеCML(Данные, "Товары");
	
КонецПроцедуры

#КонецОбласти

#Область СчетНаОплату

Функция СчетНаОплату_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента("ОбменСКонтрагентами.СчетНаОплату");
	
	Отказ = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПоСчету(ОбъектУчета, Данные, Отказ);
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;
	
	СчетНаОплату_Автозаполнение(Данные, ОбъектУчета);
	
	Если Параметры.ВыгружатьДополнительныеСведения Тогда
		СчетНаОплату_ДобавитьДополнительныеДанные(Данные);
	КонецЕсли;
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	Результат.Основания.Добавить(ОбъектУчета);
	ЗаполнитьСвязанныеОбъектыУчетаCML(Результат.СвязанныеОбъектыУчета, Данные);
	
	Возврат Результат;
	
КонецФункции

Процедура СчетНаОплату_Автозаполнение(Данные, Знач ОбъектУчета)
	
	УчастникиСделки = Новый Массив;
	УчастникиСделки.Добавить("Продавец");
	УчастникиСделки.Добавить("Покупатель");
	
	ДатаСведений = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "Дата", Ложь);
	
	ЗаполнитьАдресаУчастниковСделкиCML(УчастникиСделки, Данные, ДатаСведений);
	
	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("_Операция", "СчетНаОплату");
	ДополнительныеДанные.Вставить("Ид", ИдентификаторОбъектаУчета(ОбъектУчета));
	ДополнитьДанныеДокумента(Данные, ДополнительныеДанные);
	
КонецПроцедуры

Процедура СчетНаОплату_ДобавитьДополнительныеДанные(Данные)
	
	ПоместитьРеквизитШапкиВДопДанные(Данные, "НалогообложениеНДС");
	ПоместитьРеквизитШапкиВДопДанные(Данные, "НазначениеПлатежа");
	ПоместитьРеквизитШапкиВДопДанные(Данные, "ИтогоПоДокументу.Сумма");
	ПоместитьРеквизитШапкиВДопДанные(Данные, "ИтогоПоДокументу.СуммаСкидки");
	ПоместитьРеквизитШапкиВДопДанные(Данные, "ИтогоПоДокументу.СуммаБезСкидки");
	ПоместитьРеквизитШапкиВДопДанные(Данные, "ИтогиПрописью");
	ПоместитьРеквизитШапкиВДопДанные(Данные, "УникальныйИдентификаторПлатежа");
	ПоместитьТаблицуДереваВДопДанные(Данные, "ДокументыСделки");
	ПоместитьТаблицуДереваВДопДанные(Данные, "ГрафикОплаты");
		
	ПоместитьСопоставлениеНоменклатурыВДополнительныеДанныеCML(Данные, "Товары");
	
КонецПроцедуры

#КонецОбласти

#Область ЗаказПоставщику

Функция ЗаказПоставщику_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента("ОбменСКонтрагентами.ЗаказТовара");
	
	Отказ = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПоЗаказуТоваров(ОбъектУчета, Данные, Отказ);
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;
	
	ЗаказПоставщику_Автозаполнение(Данные, ОбъектУчета);
	
	Если Параметры.ВыгружатьДополнительныеСведения Тогда
		ЗаказПоставщику_ДобавитьДополнительныеДанные(Данные);
	КонецЕсли;
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	Результат.Основания.Добавить(ОбъектУчета);
	ЗаполнитьСвязанныеОбъектыУчетаCML(Результат.СвязанныеОбъектыУчета, Данные);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаказПоставщику_Автозаполнение(Данные, Знач ОбъектУчета)
	
	ДатаСведений = ТекущаяДатаСеанса();
	
	УчастникиСделки = Новый Массив;
	УчастникиСделки.Добавить("Покупатель");
	УчастникиСделки.Добавить("Продавец");
	УчастникиСделки.Добавить("Получатель");
	ЗаполнитьАдресаУчастниковСделкиCML(УчастникиСделки, Данные, ДатаСведений);
	
	Описание = ОписаниеОснованияЭлектронногоДокумента(ОбъектУчета);
	
	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("_Операция", "ЗаказПоставщику");
	ДополнительныеДанные.Вставить("Ид", ИдентификаторОбъектаУчета(ОбъектУчета));
	ДополнительныеДанные.Вставить("Номер", Описание.Номер);
	ДополнительныеДанные.Вставить("Дата", Описание.Дата);
	ДополнитьДанныеДокумента(Данные, ДополнительныеДанные);
	
КонецПроцедуры

Процедура ЗаказПоставщику_ДобавитьДополнительныеДанные(Данные)
	
	ПоместитьРеквизитШапкиВДопДанные(Данные, "НомерДокументаОснования");
	ПоместитьРеквизитШапкиВДопДанные(Данные, "ДатаДокументаОснования");
	ПоместитьРеквизитШапкиВДопДанные(Данные, "ИтогиПрописью");
	ПоместитьТаблицуДереваВДопДанные(Данные, "ДокументыСделки");
	ПоместитьГруппуДереваВДопДанные(Данные, "ИтогоПоДокументу");
	
	ПоместитьСопоставлениеНоменклатурыВДополнительныеДанныеCML(Данные, "Товары");
	
КонецПроцедуры

#КонецОбласти

#Область ЗаказПокупателя

Функция ЗаказПокупателя_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
		
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента("ОбменСКонтрагентами.ОтветНаЗаказ");
	
	Отказ = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПоОтветуНаЗаказ(ОбъектУчета, Данные, Отказ);
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;
	
	ЗаказПокупателя_Автозаполнение(Данные, ОбъектУчета);
	
	Если Параметры.ВыгружатьДополнительныеСведения Тогда
		ЗаказПокупателя_ДобавитьДополнительныеДанные(Данные);
	КонецЕсли;
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	Результат.Основания.Добавить(ОбъектУчета);
	ЗаполнитьСвязанныеОбъектыУчетаCML(Результат.СвязанныеОбъектыУчета, Данные);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаказПокупателя_Автозаполнение(Данные, Знач ОбъектУчета)
	
	ДатаДокумента = ТекущаяДатаСеанса();
	
	УчастникиСделки = Новый Массив;
	УчастникиСделки.Добавить("Покупатель");
	УчастникиСделки.Добавить("Продавец");
	УчастникиСделки.Добавить("Получатель");
	ЗаполнитьАдресаУчастниковСделкиCML(УчастникиСделки, Данные, ДатаДокумента);
	
	Описание = ОписаниеОснованияЭлектронногоДокумента(ОбъектУчета);
	
	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("_Операция", "ЗаказПокупателя");
	ДополнительныеДанные.Вставить("Ид", ИдентификаторОбъектаУчета(ОбъектУчета));
	ДополнительныеДанные.Вставить("Номер", Описание.Номер);
	ДополнительныеДанные.Вставить("Дата", Описание.Дата);
	ДополнитьДанныеДокумента(Данные, ДополнительныеДанные);
	
КонецПроцедуры

Процедура ЗаказПокупателя_ДобавитьДополнительныеДанные(Данные)
	
	ПоместитьРеквизитШапкиВДопДанные(Данные, "НомерДокументаОснования");
	ПоместитьРеквизитШапкиВДопДанные(Данные, "ДатаДокументаОснования");
	ПоместитьГруппуДереваВДопДанные(Данные, "ИтогоПоДокументу");
	ПоместитьТаблицуДереваВДопДанные(Данные, "ДокументыСделки");
		
	ПоместитьСопоставлениеНоменклатурыВДополнительныеДанныеCML(Данные, "Товары");
	
КонецПроцедуры

#КонецОбласти

#Область ОтчетОПродажахКомиссионногоТовара

Функция ОтчетОПродажах_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента("ОбменСКонтрагентами.ОтчетКомиссионераОПродажах");
	
	Отказ = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПоОтчетуОПродажахКомиссионногоТовара(ОбъектУчета, Данные, Отказ);
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;
	
	ОтчетОПродажах_Автозаполнение(Данные, ОбъектУчета);
	
	Если Параметры.ВыгружатьДополнительныеСведения Тогда
		ОтчетОПродажах_ДобавитьДополнительныеДанные(Данные);
	КонецЕсли;
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	Результат.Основания.Добавить(ОбъектУчета);
	ЗаполнитьСвязанныеОбъектыУчетаCML(Результат.СвязанныеОбъектыУчета, Данные);
	
	Возврат Результат;
	
КонецФункции

Процедура ОтчетОПродажах_Автозаполнение(Данные, Знач ОбъектУчета)
	
	ДатаДокумента = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "ДатаФормирования", Ложь);
	
	УчастникиСделки = Новый Массив;
	УчастникиСделки.Добавить("Комитент");
	УчастникиСделки.Добавить("Комиссионер");
	ЗаполнитьАдресаУчастниковСделкиCML(УчастникиСделки, Данные, ДатаДокумента);
	
	Описание = ОписаниеОснованияЭлектронногоДокумента(ОбъектУчета);
	
	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("_Операция", "ОтчетОПродажах");
	ДополнительныеДанные.Вставить("Ид", ИдентификаторОбъектаУчета(ОбъектУчета));
	ДополнительныеДанные.Вставить("Номер", Описание.Номер);
	ДополнительныеДанные.Вставить("Дата", Описание.Дата);
	ДополнитьДанныеДокумента(Данные, ДополнительныеДанные);
	
КонецПроцедуры

Процедура ОтчетОПродажах_ДобавитьДополнительныеДанные(Данные)
	
	ПоместитьГруппуДереваВДопДанные(Данные, "ИтогоПоДокументу");
	ПоместитьТаблицуДереваВДопДанные(Данные, "ГрафикОплаты");
	ПоместитьГруппуДереваВДопДанные(Данные, "Услуга");
	ПоместитьТаблицуДереваВДопДанные(Данные, "ДокументыСделки");
		
	ПоместитьСопоставлениеНоменклатурыВДополнительныеДанныеCML(Данные, "Товары");
	
КонецПроцедуры

#КонецОбласти

#Область ОтчетОСписанииКомиссионногоТовара

Функция ОтчетОСписании_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента("ОбменСКонтрагентами.ОтчетКомиссионераОСписании");
	
	Отказ = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПоОтчетуОСписанииКомиссионногоТовара(ОбъектУчета, Данные, Отказ);
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;
	
	ОтчетОСписании_Автозаполнение(Данные, ОбъектУчета);
	
	Если Параметры.ВыгружатьДополнительныеСведения Тогда
		ОтчетОСписании_ДобавитьДополнительныеДанные(Данные);
	КонецЕсли;
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	Результат.Основания.Добавить(ОбъектУчета);
	ЗаполнитьСвязанныеОбъектыУчетаCML(Результат.СвязанныеОбъектыУчета, Данные);
	
	Возврат Результат;
	
КонецФункции

Процедура ОтчетОСписании_Автозаполнение(Данные, Знач ОбъектУчета)
	
	ДатаДокумента = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "ДатаФормирования", Ложь);
	
	УчастникиСделки = Новый Массив;
	УчастникиСделки.Добавить("Комитент");
	УчастникиСделки.Добавить("Комиссионер");
	ЗаполнитьАдресаУчастниковСделкиCML(УчастникиСделки, Данные, ДатаДокумента);
	
	Описание = ОписаниеОснованияЭлектронногоДокумента(ОбъектУчета);
	
	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("_Операция", "ОтчетОСписании");
	ДополнительныеДанные.Вставить("Ид", ИдентификаторОбъектаУчета(ОбъектУчета));
	ДополнительныеДанные.Вставить("Номер", Описание.Номер);
	ДополнительныеДанные.Вставить("Дата", Описание.Дата);
	ДополнитьДанныеДокумента(Данные, ДополнительныеДанные);
	
КонецПроцедуры

Процедура ОтчетОСписании_ДобавитьДополнительныеДанные(Данные)
	
	ПоместитьТаблицуДереваВДопДанные(Данные, "ДокументыСделки");
	
	ПоместитьСопоставлениеНоменклатурыВДополнительныеДанныеCML(Данные, "Товары");
	
КонецПроцедуры

#КонецОбласти

#Область РеквизитыОрганизации

Функция РеквизитыОрганизации_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента("ОбменСКонтрагентами.РеквизитыОрганизации");
	
	Отказ = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеРеквизитыОрганизации(ОбъектУчета, Данные, Отказ);
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;
	
	РеквизитыОрганизации_Автозаполнение(Данные);
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	Результат.Основания.Добавить(ОбъектУчета);
	
	Возврат Результат;
	
КонецФункции

Процедура РеквизитыОрганизации_Автозаполнение(Данные)
	
	ДатаДокумента = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "ДатаФормирования", Ложь);
	
	УчастникиСделки = Новый Массив;
	УчастникиСделки.Добавить("Организация");
	ЗаполнитьАдресаУчастниковСделкиCML(УчастникиСделки, Данные, ДатаДокумента);
	
	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("_Операция", "РеквизитыОрганизации");
	ДополнитьДанныеДокумента(Данные, ДополнительныеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ПередачаТовараМеждуОрганизациями

Функция ПередачаТовараМеждуОрганизациями_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента(
		"ОбменСКонтрагентами.ПередачаВозвратТоваровМеждуОрганизациями");
	
	Отказ = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ПодготовитьДанныеПоПередачеТоваровМеждуОрганизациями(ОбъектУчета, Данные, Отказ);
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;
	
	ПередачаТовараМеждуОрганизациями_Автозаполнение(Данные, ОбъектУчета);
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	Результат.Основания.Добавить(ОбъектУчета);
	
	Возврат Результат;
	
КонецФункции

Процедура ПередачаТовараМеждуОрганизациями_Автозаполнение(Данные, ОбъектУчета)

	Описание = ОписаниеОснованияЭлектронногоДокумента(ОбъектУчета);
	
	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("_Операция", "ПередачаТовараМеждуОрганизациями");
	ДополнительныеДанные.Вставить("Ид", ИдентификаторОбъектаУчета(ОбъектУчета));
	ДополнительныеДанные.Вставить("Номер", Описание.Номер);
	ДополнительныеДанные.Вставить("Дата", Описание.Дата);

	ДополнитьДанныеДокумента(Данные, ДополнительныеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ВозвратТовараМеждуОрганизациями

Функция ВозвратТовараМеждуОрганизациями_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента(
		"ОбменСКонтрагентами.ПередачаВозвратТоваровМеждуОрганизациями");
	
	Отказ = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ПодготовитьДанныеПоВозвратуТоваровМеждуОрганизациями(ОбъектУчета, Данные, Отказ);
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;
	
	ВозвратТовараМеждуОрганизациями_Автозаполнение(Данные, ОбъектУчета);
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	Результат.Основания.Добавить(ОбъектУчета);
	
	Возврат Результат;
	
КонецФункции

Процедура ВозвратТовараМеждуОрганизациями_Автозаполнение(Данные, ОбъектУчета)
	
	Описание = ОписаниеОснованияЭлектронногоДокумента(ОбъектУчета);
	
	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("_Операция", "ВозвратТовараМеждуОрганизациями");
	ДополнительныеДанные.Вставить("Ид", ИдентификаторОбъектаУчета(ОбъектУчета));
	ДополнительныеДанные.Вставить("Номер", Описание.Номер);
	ДополнительныеДанные.Вставить("Дата", Описание.Дата);

	ДополнитьДанныеДокумента(Данные, ДополнительныеДанные);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ФНС

#Область УПД2019_ИнформацияПродавца

Функция УПД2019_ИнформацияПродавца_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Настройки = УПД2019_ИнформацияПродавца_НастройкиЗаполнения(Параметры);
	Данные = УПД2019_ИнформацияПродавца_НовыеДанные();
	Описание = УПД2019_ИнформацияПродавца_Описание(Параметры);
	Отказ = Ложь;
	
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеУПД2019_ИнформацияПродавца(
		ОбъектУчета, Настройки, Данные, Описание, Отказ);
	
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();
	КонецЕсли;
	
	УПД2019_ИнформацияПродавца_Автозаполнение(Данные);
	
	Если Параметры.ВыгружатьДополнительныеСведения Тогда
		УПД2019_ИнформацияПродавца_ДобавитьДополнительныеДанные(Данные);
	Иначе
		УПД2019_ИнформацияПродавца_УдалитьДополнительныеДанные(Данные);
	КонецЕсли;
	
	УПД2019_ИнформацияПродавца_ЗаполнитьФункцию(Данные, Параметры);
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	Результат.Основания.Добавить(ОбъектУчета);
	Для каждого Основание Из Описание.Основания Цикл
		Результат.Основания.Добавить(Основание);
	КонецЦикла;
	
	УПД2019_ИнформацияПродавца_ЗаполнитьСвязанныеОбъектыУчета(Результат.СвязанныеОбъектыУчета, Данные);
	
	Возврат Результат;
	
КонецФункции

Функция УПД2019_ИнформацияПродавца_НастройкиЗаполнения(Знач Параметры)
	
	Настройки = Новый Структура;
	Настройки.Вставить("ТипДокумента", Параметры.ТипДокумента);
	
	Настройки.Вставить("ВариантыЗаполненияПолей", Новый Структура);
	Настройки.ВариантыЗаполненияПолей.Вставить("ТоварКод", Параметры.ЗаполнениеКодаТовара);
	
	Возврат Настройки;
	
КонецФункции

Функция УПД2019_ИнформацияПродавца_НовыеДанные()
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента(
		"ОбменСКонтрагентами.УПД_ИнформацияПродавца_2019");
	
	Возврат Данные;
	
КонецФункции

Функция УПД2019_ИнформацияПродавца_Описание(Знач Параметры)
	
	Описание = Новый Структура;
	Описание.Вставить("Основания", Новый Массив);
	
	Возврат Описание;
	
КонецФункции

Процедура УПД2019_ИнформацияПродавца_Автозаполнение(Данные)
	
	УПД2019_ИнформацияПродавца_АвтозаполнениеАдресов(Данные);
	
КонецПроцедуры

Процедура УПД2019_ИнформацияПродавца_ДобавитьДополнительныеДанные(Данные)
	
	ТекстоваяИнформация = Новый ТаблицаЗначений;
	ТекстоваяИнформация.Колонки.Добавить("Идентификатор");
	ТекстоваяИнформация.Колонки.Добавить("Значение");
	
	ОписаниеПоляВидОборота = ФорматыЭДО_ФНС.ОписаниеПоляВидОборотаМаркированнымиТоварамиВКомиссионныхОперациях();
	ВидОборота = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные,
		ОписаниеПоляВидОборота.ИмяРеквизита, Ложь);
	Если ЗначениеЗаполнено(ВидОборота) Тогда
		НоваяСтрока = ТекстоваяИнформация.Добавить();
		НоваяСтрока.Идентификатор = ОписаниеПоляВидОборота.ИмяПоля;
		НоваяСтрока.Значение = ВидОборота;
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(Данные, НоваяСтрока,
			"ДопДанныеДокументаОтгрузки.ТекстоваяИнформация");
	КонецЕсли;
			
	ДокументыОснования = Данные.Строки.Найти("ДокументыОснованияСчетаФактуры", "ПолныйПуть").Значение;
	Если ЗначениеЗаполнено(ДокументыОснования) Тогда
		Если ТипЗнч(ДокументыОснования) <> Тип("Массив") Тогда
			ДокументыОснования= ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументыОснования);
		КонецЕсли;
		Для каждого Основание Из ДокументыОснования Цикл
			ИдентификаторОснования = Строка(Основание.УникальныйИдентификатор());
			НоваяСтрока = ТекстоваяИнформация.Добавить();
			НоваяСтрока.Идентификатор = "ИдентификаторДокументаОснования";
			НоваяСтрока.Значение = ИдентификаторОснования;
			ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(
				Данные, НоваяСтрока, "ДопДанныеСчетаФактуры.ТекстоваяИнформация");
		КонецЦикла;
	КонецЕсли;
	
	ДокументыОснования = Данные.Строки.Найти("ДокументыОснованияДокументаОтгрузки", "ПолныйПуть").Значение;
	Если ЗначениеЗаполнено(ДокументыОснования) Тогда
		Если ТипЗнч(ДокументыОснования) <> Тип("Массив") Тогда
			ДокументыОснования= ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументыОснования);
		КонецЕсли;
		Для каждого Основание Из ДокументыОснования Цикл
			ИдентификаторОснования = Строка(Основание.УникальныйИдентификатор());
			НоваяСтрока = ТекстоваяИнформация.Добавить();
			НоваяСтрока.Идентификатор = "ИдентификаторДокументаОснования";
			НоваяСтрока.Значение = ИдентификаторОснования;
			ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(
				Данные, НоваяСтрока, "ДопДанныеДокументаОтгрузки.ТекстоваяИнформация");
		КонецЦикла;
	КонецЕсли;
	
	ВидСчетаФактуры = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "ВидСчетаФактуры");
	Если ЗначениеЗаполнено(ВидСчетаФактуры)Тогда
		НоваяСтрока = ТекстоваяИнформация.Добавить();
		НоваяСтрока.Идентификатор = "ВидСчетаФактуры";
		НоваяСтрока.Значение = ВидСчетаФактуры;
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(
			Данные, НоваяСтрока, "ДопДанныеСчетаФактуры.ТекстоваяИнформация");
	КонецЕсли;
	
	ТолькоУслуги = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "ТолькоУслуги");
	Если ЗначениеЗаполнено(ТолькоУслуги)Тогда
		НоваяСтрока = ТекстоваяИнформация.Добавить();
		НоваяСтрока.Идентификатор = "ТолькоУслуги";
		НоваяСтрока.Значение = ТолькоУслуги;
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(
			Данные, НоваяСтрока, "ДопДанныеСчетаФактуры.ТекстоваяИнформация");
	КонецЕсли;
	
	ИныеСведенияОбОтгрузке = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
		Данные, "ИныеСведенияОбОтгрузке");
	Если ЗначениеЗаполнено(ИныеСведенияОбОтгрузке) Тогда
		НоваяСтрока = ТекстоваяИнформация.Добавить();
		НоваяСтрока.Идентификатор = "ИныеСведенияОбОтгрузке";
		НоваяСтрока.Значение = ИныеСведенияОбОтгрузке;
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(
			Данные, НоваяСтрока, "ДопДанныеДокументаОтгрузки.ТекстоваяИнформация");
	КонецЕсли;
	
	СтрокаТаблицаТоваров = Данные.Строки.Найти("СведенияОТоварах", "ПолныйПуть");
	Для Каждого Товар Из СтрокаТаблицаТоваров.Строки Цикл
		Основание = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			Товар, "СведенияОТоварах.НомерСтроки.ДокументОснование");
		Если ЗначениеЗаполнено(Основание) Тогда
			ИдентификаторОснования = Строка(Основание.УникальныйИдентификатор());
			НоваяСтрока = ТекстоваяИнформация.Добавить();
			НоваяСтрока.Идентификатор = "ИдентификаторДокументаОснования";
			НоваяСтрока.Значение = ИдентификаторОснования;
			ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(
				Товар, НоваяСтрока, "СведенияОТоварах.НомерСтроки.ТекстоваяИнформация");
		КонецЕсли;
							
		ОснованиеОсвобожденияОтНДС = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.ОснованиеОсвобожденияОтНДС");
		Если ЗначениеЗаполнено(ОснованиеОсвобожденияОтНДС) Тогда
			НоваяСтрока = ТекстоваяИнформация.Добавить();
			НоваяСтрока.Идентификатор = "ОснованиеОсвобожденияОтНДС";
			НоваяСтрока.Значение = ОснованиеОсвобожденияОтНДС;
			ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(Товар, НоваяСтрока, "СведенияОТоварах.НомерСтроки.ТекстоваяИнформация");
		КонецЕсли;
	КонецЦикла;
	
	ДобавитьСопоставлениеНоменклатурыВДопДанныеДереваДокументаТаблица(
		Данные, СтрокаТаблицаТоваров.ПолныйПуть, Истина);
	
КонецПроцедуры

Процедура УПД2019_ИнформацияПродавца_УдалитьДополнительныеДанные(Данные)
	
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		Данные, "СведенияОКомиссионере", Неопределено);
	
КонецПроцедуры

Процедура УПД2019_ИнформацияПродавца_ЗаполнитьСвязанныеОбъектыУчета(СвязанныеОбъектыУчета, Данные) Экспорт
	
	ДокументыОснованияСчетаФактуры = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "ДокументыОснованияСчетаФактуры");
	Если ЗначениеЗаполнено(ДокументыОснованияСчетаФактуры) Тогда
		Если ТипЗнч(ДокументыОснованияСчетаФактуры) <> Тип("Массив") Тогда
			ДокументыОснованияСчетаФактуры = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументыОснованияСчетаФактуры);
		КонецЕсли;  
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СвязанныеОбъектыУчета, ДокументыОснованияСчетаФактуры, Истина);
	КонецЕсли;
	ДокументыОснованияДокументаОтгрузки = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "ДокументыОснованияДокументаОтгрузки");
	Если ЗначениеЗаполнено(ДокументыОснованияДокументаОтгрузки) Тогда
		Если ТипЗнч(ДокументыОснованияДокументаОтгрузки) <> Тип("Массив") Тогда
			ДокументыОснованияДокументаОтгрузки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументыОснованияДокументаОтгрузки);
		КонецЕсли;  
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СвязанныеОбъектыУчета, ДокументыОснованияДокументаОтгрузки, Истина);
	КонецЕсли;
	
	НаборОбъектовУчета = Новый Массив;
	СтрокаТаблицаТоваров = Данные.Строки.Найти("СведенияОТоварах", "ПолныйПуть");
	Для Каждого Товар Из СтрокаТаблицаТоваров.Строки Цикл
		Основание = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.ДокументОснование");
		Если ЗначениеЗаполнено(Основание) Тогда
			НаборОбъектовУчета.Добавить(Основание);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НаборОбъектовУчета) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СвязанныеОбъектыУчета, НаборОбъектовУчета, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УПД2019_ИнформацияПокупателя

Функция УПД2019_ИнформацияПокупателя_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Данные = УПД2019_ИнформацияПокупателя_НовыеДанные();

	Отказ = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеУПД2019_ИнформацияПокупателя(ОбъектУчета, Данные, Отказ);
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	
	Возврат Результат;
	
КонецФункции

Функция УПД2019_ИнформацияПокупателя_НовыеДанные()
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента(
		"ОбменСКонтрагентами.УПД_ИнформацияПокупателя_2019");
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти

#Область ПередачаТоваров_ИнформацияПродавца

Функция ПередачаТоваров_ИнформацияПродавца_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Настройки = ПередачаТоваров_ИнформацияПродавца_НастройкиЗаполнения(Параметры);
	Данные = ПередачаТоваров_ИнформацияПродавца_НовыеДанные();
	Описание = ПередачаТоваров_ИнформацияПродавца_Описание(Параметры);
	Отказ = Ложь;
	
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПередачаТоваров_ИнформацияПродавца(
		ОбъектУчета, Настройки, Данные, Описание, Отказ);
	
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;
	
	ПередачаТоваров_ИнформацияПродавца_Автозаполнение(Данные);
	
	Если Параметры.ВыгружатьДополнительныеСведения Тогда
		ПередачаТоваров_ИнформацияПродавца_ДобавитьДополнительныеДанные(Данные);
	КонецЕсли;
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	Результат.Основания.Добавить(ОбъектУчета);
	Для каждого Основание Из Описание.Основания Цикл
		Результат.Основания.Добавить(Основание);
	КонецЦикла;
	
	ПередачаТоваров_ИнформацияПродавца_ЗаполнитьСвязанныеОбъектыУчета(Результат.СвязанныеОбъектыУчета, Данные);
	
	Возврат Результат;
	
КонецФункции

Функция ПередачаТоваров_ИнформацияПродавца_НастройкиЗаполнения(Знач Параметры)
	
	Настройки = Новый Структура;
	Настройки.Вставить("ТипДокумента", Параметры.ТипДокумента);
	
	Настройки.Вставить("ВариантыЗаполненияПолей", Новый Структура);
	Настройки.ВариантыЗаполненияПолей.Вставить("ТоварКод", Параметры.ЗаполнениеКодаТовара);
	
	Возврат Настройки;
	
КонецФункции

Функция ПередачаТоваров_ИнформацияПродавца_НовыеДанные()
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента(
		"ОбменСКонтрагентами.ТОРГ12_Продавец");
	
	Возврат Данные;
	
КонецФункции

Функция ПередачаТоваров_ИнформацияПродавца_Описание(Знач Параметры)
	
	Описание = Новый Структура;
	Описание.Вставить("Основания", Новый Массив);
	
	Возврат Описание;
	
КонецФункции

Процедура ПередачаТоваров_ИнформацияПродавца_Автозаполнение(Данные)
	
	ПередачаТоваров_ИнформацияПродавца_АвтозаполнениеАдресов(Данные);
	
КонецПроцедуры

Процедура ПередачаТоваров_ИнформацияПродавца_ДобавитьДополнительныеДанные(Данные)
	
	ТекстоваяИнформация = Новый ТаблицаЗначений;
	ТекстоваяИнформация.Колонки.Добавить("Идентификатор");
	ТекстоваяИнформация.Колонки.Добавить("Значение");	
	
	СтрокаТаблицаТоваров = Данные.Строки.Найти("ТаблицаТоваров", "ПолныйПуть");

	ДобавитьСопоставлениеНоменклатурыВДопДанныеДереваДокументаТаблица(
		Данные, СтрокаТаблицаТоваров.ПолныйПуть, Истина);
	
КонецПроцедуры

Процедура ПередачаТоваров_ИнформацияПродавца_ЗаполнитьСвязанныеОбъектыУчета(СвязанныеОбъектыУчета, Данные) Экспорт
	
	ДокументыОснования = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "ДокументыОснования");
	
	Если ДокументыОснования <> Неопределено Тогда	
		Если ТипЗнч(ДокументыОснования) <> Тип("Массив") Тогда
			ДокументыОснования = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументыОснования);
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СвязанныеОбъектыУчета, ДокументыОснования, Истина);
		
	КонецЕсли;
	
	НаборОбъектовУчета = Новый Массив;
	СтрокаТаблицаТоваров = Данные.Строки.Найти("ТаблицаТоваров", "ПолныйПуть");
	Для Каждого Товар Из СтрокаТаблицаТоваров.Строки Цикл
		Основание = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "ТаблицаТоваров.НомерСтроки.ДокументОснование");
		НаборОбъектовУчета.Добавить(Основание);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НаборОбъектовУчета) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СвязанныеОбъектыУчета, НаборОбъектовУчета, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПередачаТоваров_ИнформацияПокупателя

Функция ПередачаТоваров_ИнформацияПокупателя_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Данные = ПередачаТоваров_ИнформацияПокупателя_НовыеДанные();
	
	Отказ = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПередачаТоваров_ИнформацияПокупателя(ОбъектУчета, Данные, Отказ);
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;
	
	СоставительДокументаНаименование = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "СоставительДокументаНаименование");
	Если Не ЗначениеЗаполнено(СоставительДокументаНаименование) Тогда
		РеквизитНаименованиеОрганизации = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении(
			"НаименованиеОрганизации");
		Если НЕ ЗначениеЗаполнено(РеквизитНаименованиеОрганизации) Тогда
			РеквизитНаименованиеОрганизации = "Наименование";
		КонецЕсли;
		СоставительДокументаНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Отправитель, РеквизитНаименованиеОрганизации);
		ДеревоЭлектронногоДокументаБЭД.ЗаполнитьЗначениеРеквизитаВДереве(Данные, "СоставительДокументаНаименование", СоставительДокументаНаименование);
	КонецЕсли;
	
	ДатаПолученияГруза = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "ДатаПолученияГруза");
	
	Если Не ЗначениеЗаполнено(ДатаПолученияГруза) Тогда
		
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			Данные, "ДатаПолученияГруза", ТекущаяДатаСеанса());
	
	КонецЕсли;
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	
	Возврат Результат;
	
КонецФункции

Функция ПередачаТоваров_ИнформацияПокупателя_НовыеДанные()
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента(
		"ОбменСКонтрагентами.ТОРГ12_Покупатель");
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти

#Область ПередачаУслуг_ИнформацияПродавца

Функция ПередачаУслуг_ИнформацияПродавца_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Настройки = ПередачаУслуг_ИнформацияПродавца_НастройкиЗаполнения(Параметры);
	Данные = ПередачаУслуг_ИнформацияПродавца_НовыеДанные();
	Описание = ПередачаУслуг_ИнформацияПродавца_Описание(Параметры);
	Отказ = Ложь;
	
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПередачаУслуг_ИнформацияПродавца(
		ОбъектУчета, Настройки, Данные, Описание, Отказ);
	
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;
	
	ПередачаУслуг_ИнформацияПродавца_Автозаполнение(Данные);
	
	Если Параметры.ВыгружатьДополнительныеСведения Тогда
		ПередачаУслуг_ИнформацияПродавца_ДобавитьДополнительныеДанные(Данные);
	КонецЕсли;
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	Результат.Основания.Добавить(ОбъектУчета);
	Для каждого Основание Из Описание.Основания Цикл
		Результат.Основания.Добавить(Основание);
	КонецЦикла;
	
	ПередачаУслуг_ИнформацияПродавца_ЗаполнитьСвязанныеОбъектыУчета(Результат.СвязанныеОбъектыУчета, Данные);
	
	Возврат Результат;
	
КонецФункции

Функция ПередачаУслуг_ИнформацияПродавца_НастройкиЗаполнения(Знач Параметры)
	
	Настройки = Новый Структура;
	Настройки.Вставить("ТипДокумента", Параметры.ТипДокумента);
	
	Настройки.Вставить("ВариантыЗаполненияПолей", Новый Структура);
	Настройки.ВариантыЗаполненияПолей.Вставить("ТоварКод", Параметры.ЗаполнениеКодаТовара);
	
	Возврат Настройки;
	
КонецФункции

Функция ПередачаУслуг_ИнформацияПродавца_НовыеДанные()
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента(
		"ОбменСКонтрагентами.Акт501_Исполнитель");
	
	Возврат Данные;
	
КонецФункции

Функция ПередачаУслуг_ИнформацияПродавца_Описание(Знач Параметры)
	
	Описание = Новый Структура;
	Описание.Вставить("Основания", Новый Массив);
		
	Возврат Описание;
	
КонецФункции

Процедура ПередачаУслуг_ИнформацияПродавца_Автозаполнение(Данные)
	
	ПередачаУслуг_ИнформацияПродавца_АвтозаполнениеАдресов(Данные);
	
КонецПроцедуры

Процедура ПередачаУслуг_ИнформацияПродавца_ДобавитьДополнительныеДанные(Данные)
	
	ТекстоваяИнформация = Новый ТаблицаЗначений;
	ТекстоваяИнформация.Колонки.Добавить("Идентификатор");
	ТекстоваяИнформация.Колонки.Добавить("Значение");
	
	
	СтрокаТаблицаТоваров = Данные.Строки.Найти("ТаблицаУслуг", "ПолныйПуть");

	ДобавитьСопоставлениеНоменклатурыВДопДанныеДереваДокументаТаблица(
		Данные, СтрокаТаблицаТоваров.ПолныйПуть, Истина);
	
КонецПроцедуры

Процедура ПередачаУслуг_ИнформацияПродавца_ЗаполнитьСвязанныеОбъектыУчета(СвязанныеОбъектыУчета, Данные) Экспорт
	
	ДокументыОснования = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "ДокументыОснования");
	Если ДокументыОснования <> Неопределено Тогда
		Если ТипЗнч(ДокументыОснования) <> Тип("Массив") Тогда
			ДокументыОснования = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументыОснования);
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СвязанныеОбъектыУчета, ДокументыОснования, Истина);
	КонецЕсли;
	
	НаборОбъектовУчета = Новый Массив;
	СтрокаТаблицаТоваров = Данные.Строки.Найти("ТаблицаУслуг", "ПолныйПуть");
	Для Каждого Товар Из СтрокаТаблицаТоваров.Строки Цикл
		Основание = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "ТаблицаУслуг.НомерСтроки.ДокументОснование");
		Если ЗначениеЗаполнено(Основание) Тогда
			НаборОбъектовУчета.Добавить(Основание);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НаборОбъектовУчета) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СвязанныеОбъектыУчета, ДокументыОснования, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПередачаУслуг_ИнформацияПокупателя

Функция ПередачаУслуг_ИнформацияПокупателя_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Данные = ПередачаУслуг_ИнформацияПокупателя_НовыеДанные();
	
	Отказ = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПередачаУслуг_ИнформацияПокупателя(ОбъектУчета, Данные, Отказ);
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;
	
	СоставительДокументаНаименование = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "СоставительДокументаНаименование");
	Если Не ЗначениеЗаполнено(СоставительДокументаНаименование) Тогда
		РеквизитНаименованиеОрганизации = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении(
			"НаименованиеОрганизации");
		Если НЕ ЗначениеЗаполнено(РеквизитНаименованиеОрганизации) Тогда
			РеквизитНаименованиеОрганизации = "Наименование";
		КонецЕсли;
		СоставительДокументаНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Отправитель, РеквизитНаименованиеОрганизации);
		ДеревоЭлектронногоДокументаБЭД.ЗаполнитьЗначениеРеквизитаВДереве(Данные, "СоставительДокументаНаименование", СоставительДокументаНаименование);
	КонецЕсли;
	
	Претензия = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "СведенияПоВыполнениюУслуг.Претензия");
	
	Если Не ЗначениеЗаполнено(Претензия) Тогда
		
		Претензия = НСтр("ru = 'Результаты работ (оказанных услуг) приняты без претензий'");
		
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			Данные, "СведенияПоВыполнениюУслуг.Претензия", Претензия);
			
	КонецЕсли;
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	
	Возврат Результат;
	
КонецФункции

Функция ПередачаУслуг_ИнформацияПокупателя_НовыеДанные()
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента(
		"ОбменСКонтрагентами.Акт501_Заказчик");
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти

#Область АктОРасхождениях_ИнформацияПокупателя

Функция АктОРасхождениях_ИнформацияПокупателя_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Настройки = АктОРасхождениях_ИнформацияПокупателя_НастройкиЗаполнения(Параметры);
	Данные = АктОРасхождениях_ИнформацияПокупателя_НовыеДанные();
	Описание = АктОРасхождениях_ИнформацияПокупателя_Описание(Параметры);
	Отказ = Ложь;
	
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеАктОРасхождениях_ИнформацияПокупателя(
		ОбъектУчета, Настройки, Данные, Описание, Отказ);
	
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;
	
	АктОРасхождениях_ИнформацияПокупателя_Автозаполнение(Данные);
	
	Если Параметры.ВыгружатьДополнительныеСведения Тогда
		АктОРасхождениях_ИнформацияПокупателя_ДобавитьДополнительныеДанные(Данные);
	КонецЕсли;
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	Результат.Основания.Добавить(ОбъектУчета);
	Для каждого Основание Из Описание.Основания Цикл
		Результат.Основания.Добавить(Основание);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция АктОРасхождениях_ИнформацияПокупателя_НастройкиЗаполнения(Знач Параметры)
	
	Настройки = Новый Структура;
	Настройки.Вставить("ТипДокумента", Параметры.ТипДокумента);
	
	Настройки.Вставить("ВариантыЗаполненияПолей", Новый Структура);
	Настройки.ВариантыЗаполненияПолей.Вставить("ТоварКод", Параметры.ЗаполнениеКодаТовара);
	
	Возврат Настройки;
	
КонецФункции

Функция АктОРасхождениях_ИнформацияПокупателя_НовыеДанные()
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента(
		"ОбменСКонтрагентами.АктОРасхождениях_2019");
	
	Возврат Данные;
	
КонецФункции

Функция АктОРасхождениях_ИнформацияПокупателя_Описание(Знач Параметры)
	
	Описание = Новый Структура;
	Описание.Вставить("Основания", Новый Массив);
		
	Возврат Описание;
	
КонецФункции

Процедура АктОРасхождениях_ИнформацияПокупателя_ДобавитьДополнительныеДанные(Данные)
	
	СтрокаТаблицаТоваров = Данные.Строки.Найти("РезультатыПриемки", "ПолныйПуть");

	ДобавитьСопоставлениеНоменклатурыВДопДанныеДереваДокументаТаблица(
		Данные, СтрокаТаблицаТоваров.ПолныйПуть, Истина);
	
КонецПроцедуры

Процедура АктОРасхождениях_ИнформацияПокупателя_Автозаполнение(Данные)
	
	АктОРасхожденииИнформацияПокупателя_АвтозаполнениеАдресов(Данные);
	
КонецПроцедуры

#КонецОбласти

#Область КоммерческоеПредложение

Функция КоммерческоеПредложение_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Данные = КоммерческоеПредложение_НовыеДанные();
	Отказ = Ложь;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.КоммерческиеПредложения") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("КоммерческиеПредложенияСлужебный");
		МодульПодсистемы.ЗаполнитьДанныеПоКоммерческомуПредложению(ОбъектУчета, Данные, Отказ);
	Иначе
		ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПоКоммерческомуПредложению(ОбъектУчета,
			Данные, Отказ);
	КонецЕсли;
	
	Если Параметры.ВыгружатьДополнительныеСведения Тогда
		КоммерческоеПредложение_ДобавитьДополнительныеДанные(Данные);
	КонецЕсли;
	
	Описание = ОписаниеОснованияЭлектронногоДокумента(ОбъектУчета);
	ДеревоЭлектронногоДокументаБЭД.ВставитьЗначениеВДерево(Данные, "Идентификатор", Строка(ОбъектУчета.УникальныйИдентификатор()));
	ДеревоЭлектронногоДокументаБЭД.ВставитьЗначениеВДерево(Данные, "Номер", Описание.Номер);
	ДеревоЭлектронногоДокументаБЭД.ВставитьЗначениеВДерево(Данные, "Дата", Описание.Дата);
		
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;	
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	Результат.Основания.Добавить(ОбъектУчета);
	
	Возврат Результат;
	
КонецФункции

Функция КоммерческоеПредложение_НовыеДанные()
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента(
		"ОбменСКонтрагентами.КоммерческоеПредложение");
	
	Возврат Данные;
	
КонецФункции

Процедура КоммерческоеПредложение_ДобавитьДополнительныеДанные(Данные)
	
	СтрокаТаблицаТоваров = Данные.Строки.Найти("Товары", "ПолныйПуть");

	ДобавитьСопоставлениеНоменклатурыВДопДанныеДереваДокументаТаблица(
		Данные, СтрокаТаблицаТоваров.ПолныйПуть, Истина,
		ЭлектронныеДокументыЭДО.ПоддерживаемыеФорматы().БизнесСеть.КоммерческоеПредложение);
	
КонецПроцедуры

#КонецОбласти

#Область ЗапросКоммерческогоПредложения

Функция ЗапросКоммерческогоПредложения_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Данные = ЗапросКоммерческогоПредложения_НовыеДанные();
	Отказ = Ложь;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.КоммерческиеПредложения") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("КоммерческиеПредложенияСлужебный");
		МодульПодсистемы.ЗаполнитьДанныеПоЗапросуКоммерческихПредложений(ОбъектУчета, Данные, Отказ);
	Иначе
		ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПоЗапросуКоммерческихПредложений(ОбъектУчета,
			Данные, Отказ);
	КонецЕсли;
	
	Если Параметры.ВыгружатьДополнительныеСведения Тогда
		ЗапросКоммерческогоПредложения_ДобавитьДополнительныеДанные(Данные);
	КонецЕсли;
	
	Описание = ОписаниеОснованияЭлектронногоДокумента(ОбъектУчета);
	ДеревоЭлектронногоДокументаБЭД.ВставитьЗначениеВДерево(Данные, "Идентификатор", Строка(ОбъектУчета.УникальныйИдентификатор()));
	ДеревоЭлектронногоДокументаБЭД.ВставитьЗначениеВДерево(Данные, "Номер", Описание.Номер);
	ДеревоЭлектронногоДокументаБЭД.ВставитьЗначениеВДерево(Данные, "Дата", Описание.Дата);
	
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;	
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	Результат.Основания.Добавить(ОбъектУчета);
	
	Возврат Результат;
	
КонецФункции

Функция ЗапросКоммерческогоПредложения_НовыеДанные()
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента(
		"ОбменСКонтрагентами.ЗапросКоммерческихПредложений");
	
	Возврат Данные;
	
КонецФункции

Процедура ЗапросКоммерческогоПредложения_ДобавитьДополнительныеДанные(Данные)
	
	СтрокаТаблицаТоваров = Данные.Строки.Найти("Товары", "ПолныйПуть");

	ДобавитьСопоставлениеНоменклатурыВДопДанныеДереваДокументаТаблица(
		Данные, СтрокаТаблицаТоваров.ПолныйПуть, Истина,
		ЭлектронныеДокументыЭДО.ПоддерживаемыеФорматы().БизнесСеть.ЗапросКоммерческогоПредложения);
	
КонецПроцедуры

#КонецОбласти

#Область УКД_ИнформацияПродавца

Функция УКД_ИнформацияПродавца_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Настройки = УКД_ИнформацияПродавца_НастройкиЗаполнения(Параметры);
	Данные = УКД_ИнформацияПродавца_НовыеДанные();
	Описание = УКД_ИнформацияПродавца_Описание(Параметры);
	Отказ = Ложь;
	
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеУКД_ИнформацияПродавца(
		ОбъектУчета, Настройки, Данные, Описание, Отказ);
	
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;
	
	УКД_ИнформацияПродавца_Автозаполнение(Данные);
	
	Если Параметры.ВыгружатьДополнительныеСведения Тогда
		УКД_ИнформацияПродавца_ДобавитьДополнительныеДанные(Данные);
	Иначе
		УКД_ИнформацияПродавца_УдалитьДополнительныеДанные(Данные);
	КонецЕсли;
	
	УКД_ИнформацияПродавца_ЗаполнитьФункцию(Данные, Параметры);
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	Результат.Основания.Добавить(ОбъектУчета);
	Для каждого Основание Из Описание.Основания Цикл
		Результат.Основания.Добавить(Основание);
	КонецЦикла;
	
	УКД_ИнформацияПродавца_ЗаполнитьСвязанныеОбъектыУчета(Результат.СвязанныеОбъектыУчета, Данные);
	
	Возврат Результат;
	
КонецФункции

Функция УКД_ИнформацияПродавца_НастройкиЗаполнения(Знач Параметры)
	
	Настройки = Новый Структура;
	Настройки.Вставить("ТипДокумента", Параметры.ТипДокумента);
	
	Настройки.Вставить("ВариантыЗаполненияПолей", Новый Структура);
	Настройки.ВариантыЗаполненияПолей.Вставить("ТоварКод", Параметры.ЗаполнениеКодаТовара);
	
	Возврат Настройки;
	
КонецФункции

Функция УКД_ИнформацияПродавца_НовыеДанные()
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента(
		"ОбменСКонтрагентами.УКД_ИнформацияПродавца");
	
	Возврат Данные;
	
КонецФункции

Функция УКД_ИнформацияПродавца_Описание(Знач Параметры)
	
	Описание = Новый Структура;
	Описание.Вставить("Основания", Новый Массив);
	
	Возврат Описание;
	
КонецФункции

Процедура УКД_ИнформацияПродавца_Автозаполнение(Данные)
	
	УКД_ИнформацияПродавца_АвтозаполнениеАдресов(Данные);
	
КонецПроцедуры

Процедура УКД_ИнформацияПродавца_ДобавитьДополнительныеДанные(Данные)
	
	ТекстоваяИнформация = Новый ТаблицаЗначений;
	ТекстоваяИнформация.Колонки.Добавить("Идентификатор");
	ТекстоваяИнформация.Колонки.Добавить("Значение");
	
	ДобавитьВидДокументаДляОтображенияВДопДанныеДереваДокумента(Данные, ТекстоваяИнформация);
	
	ДокументыОснования = Данные.Строки.Найти("ДокументыОснованияСчетаФактуры", "ПолныйПуть").Значение;
	Если ЗначениеЗаполнено(ДокументыОснования) Тогда
		Если ТипЗнч(ДокументыОснования) <> Тип("Массив") Тогда
			ДокументыОснования = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументыОснования);
		КонецЕсли;
		
		Для каждого Основание Из ДокументыОснования Цикл
			ИдентификаторОснования = Строка(Основание.УникальныйИдентификатор());
			НоваяСтрока = ТекстоваяИнформация.Добавить();
			НоваяСтрока.Идентификатор = "ИдентификаторДокументаОснования";
			НоваяСтрока.Значение = ИдентификаторОснования;
			ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(
				Данные, НоваяСтрока, "ДопДанныеСчетаФактуры.ТекстоваяИнформация");
		КонецЦикла;
	КонецЕсли;
	
	ТолькоУслуги = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "ТолькоУслуги");
	Если ЗначениеЗаполнено(ТолькоУслуги)Тогда
		НоваяСтрока = ТекстоваяИнформация.Добавить();
		НоваяСтрока.Идентификатор = "ТолькоУслуги";
		НоваяСтрока.Значение = ТолькоУслуги;
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(
			Данные, НоваяСтрока, "ДопДанныеСчетаФактуры.ТекстоваяИнформация");
	КонецЕсли;
	
	СтрокаТаблицаТоваров = Данные.Строки.Найти("СведенияОТоварах", "ПолныйПуть");
	Для Каждого Товар Из СтрокаТаблицаТоваров.Строки Цикл
		Основание = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			Товар, "СведенияОТоварах.НомерСтроки.ДокументОснование");
		Если ЗначениеЗаполнено(Основание) Тогда
			ИдентификаторОснования = Строка(Основание.УникальныйИдентификатор());
			НоваяСтрока = ТекстоваяИнформация.Добавить();
			НоваяСтрока.Идентификатор = "ИдентификаторДокументаОснования";
			НоваяСтрока.Значение = ИдентификаторОснования;
			ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(
				Товар, НоваяСтрока, "СведенияОТоварах.НомерСтроки.ТекстоваяИнформация");
		КонецЕсли;
		
		ДобавитьСведенияОМаркировкеВДопДанныеДереваДокумента_ГИСМТ(Товар);
	КонецЦикла;
	
	ДобавитьСопоставлениеНоменклатурыВДопДанныеДереваДокументаТаблица(
		Данные, СтрокаТаблицаТоваров.ПолныйПуть, Истина);
	
КонецПроцедуры

Процедура УКД_ИнформацияПродавца_УдалитьДополнительныеДанные(Данные)
	
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(Данные, "СведенияОКомиссионере", Неопределено);
	
КонецПроцедуры

Процедура УКД_ИнформацияПродавца_ЗаполнитьСвязанныеОбъектыУчета(СвязанныеОбъектыУчета, Данные) Экспорт
	
	ДокументыОснованияСчетаФактуры = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные,
		"ДокументыОснованияСчетаФактуры");
	
	Если ДокументыОснованияСчетаФактуры <> Неопределено Тогда
		
		Если ТипЗнч(ДокументыОснованияСчетаФактуры) <> Тип("Массив") Тогда
			ДокументыОснованияСчетаФактуры = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументыОснованияСчетаФактуры);
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СвязанныеОбъектыУчета, ДокументыОснованияСчетаФактуры, Истина);
		
	КонецЕсли;
	
	НаборОбъектовУчета = Новый Массив;
	СтрокаТаблицаТоваров = Данные.Строки.Найти("СведенияОТоварах", "ПолныйПуть");
	Для Каждого Товар Из СтрокаТаблицаТоваров.Строки Цикл
		Основание = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар,
			"СведенияОТоварах.НомерСтроки.ДокументОснование");
		Если ЗначениеЗаполнено(Основание) Тогда
			НаборОбъектовУчета.Добавить(Основание);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НаборОбъектовУчета) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СвязанныеОбъектыУчета, НаборОбъектовУчета, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УКД_ИнформацияПокупателя

Функция УКД_ИнформацияПокупателя_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Данные = УКД_ИнформацияПокупателя_НовыеДанные();
	
	Отказ = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеУКД_ИнформацияПокупателя(ОбъектУчета, Данные, Отказ);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	
	Возврат Результат;
	
КонецФункции

Функция УКД_ИнформацияПокупателя_НовыеДанные()
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента(
		"ОбменСКонтрагентами.УКД_ИнформацияПокупателя");
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти

#Область УКД2020_ИнформацияПродавца

Функция УКД2020_ИнформацияПродавца_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Настройки = УКД2020_ИнформацияПродавца_НастройкиЗаполнения(Параметры);
	Данные = УКД2020_ИнформацияПродавца_НовыеДанные();
	Описание = УКД2020_ИнформацияПродавца_Описание(Параметры);
	Отказ = Ложь;
	
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеУКД2020_ИнформацияПродавца(
		ОбъектУчета, Настройки, Данные, Описание, Отказ);
	
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;
	
	УКД2020_ИнформацияПродавца_Автозаполнение(Данные);
	
	Если Параметры.ВыгружатьДополнительныеСведения Тогда
		УКД2020_ИнформацияПродавца_ДобавитьДополнительныеДанные(Данные);
	Иначе
		УКД2020_ИнформацияПродавца_УдалитьДополнительныеДанные(Данные);
	КонецЕсли;
	
	УКД_ИнформацияПродавца_ЗаполнитьФункцию(Данные, Параметры);
		
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	Результат.Основания.Добавить(ОбъектУчета);
	Для каждого Основание Из Описание.Основания Цикл
		Результат.Основания.Добавить(Основание);
	КонецЦикла;
	
	УКД2020_ИнформацияПродавца_ЗаполнитьСвязанныеОбъектыУчета(Результат.СвязанныеОбъектыУчета, Данные);
	
	Возврат Результат;
	
КонецФункции

Функция УКД2020_ИнформацияПродавца_НастройкиЗаполнения(Знач Параметры)
	
	Настройки = Новый Структура;
	Настройки.Вставить("ТипДокумента", Параметры.ТипДокумента);
	
	Настройки.Вставить("ВариантыЗаполненияПолей", Новый Структура);
	Настройки.ВариантыЗаполненияПолей.Вставить("ТоварКод", Параметры.ЗаполнениеКодаТовара);
	
	Возврат Настройки;
	
КонецФункции

Функция УКД2020_ИнформацияПродавца_НовыеДанные()
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента(
		"ОбменСКонтрагентами.УКД_ИнформацияПродавца_2020");
	
	Возврат Данные;
	
КонецФункции

Функция УКД2020_ИнформацияПродавца_Описание(Знач Параметры)
	
	Описание = Новый Структура;
	Описание.Вставить("Основания", Новый Массив);
	
	Возврат Описание;
	
КонецФункции

Процедура УКД2020_ИнформацияПродавца_Автозаполнение(Данные)
	
	УКД_ИнформацияПродавца_АвтозаполнениеАдресов(Данные);
	
КонецПроцедуры

Процедура УКД2020_ИнформацияПродавца_ДобавитьДополнительныеДанные(Данные)
	
	ТекстоваяИнформация = Новый ТаблицаЗначений;
	ТекстоваяИнформация.Колонки.Добавить("Идентификатор");
	ТекстоваяИнформация.Колонки.Добавить("Значение");
	
	ДобавитьВидДокументаДляОтображенияВДопДанныеДереваДокумента(Данные, ТекстоваяИнформация);
	
	ДокументыОснования = Данные.Строки.Найти("ДокументыОснованияСчетаФактуры", "ПолныйПуть").Значение;
	Если ЗначениеЗаполнено(ДокументыОснования) Тогда
		Если ТипЗнч(ДокументыОснования) <> Тип("Массив") Тогда
			ДокументыОснования= ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументыОснования);
		КонецЕсли;
		Для каждого Основание Из ДокументыОснования Цикл
			ИдентификаторОснования = Строка(Основание.УникальныйИдентификатор());
			НоваяСтрока = ТекстоваяИнформация.Добавить();
			НоваяСтрока.Идентификатор = "ИдентификаторДокументаОснования";
			НоваяСтрока.Значение = ИдентификаторОснования;
			ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(
				Данные, НоваяСтрока, "ДопДанныеСчетаФактуры.ТекстоваяИнформация");
		КонецЦикла;
	КонецЕсли;
	
	ТолькоУслуги = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "ТолькоУслуги");
	Если ЗначениеЗаполнено(ТолькоУслуги)Тогда
		НоваяСтрока = ТекстоваяИнформация.Добавить();
		НоваяСтрока.Идентификатор = "ТолькоУслуги";
		НоваяСтрока.Значение = ТолькоУслуги;
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(
			Данные, НоваяСтрока, "ДопДанныеСчетаФактуры.ТекстоваяИнформация");
	КонецЕсли;
	
	СтрокаТаблицаТоваров = Данные.Строки.Найти("СведенияОТоварах", "ПолныйПуть");
	Для Каждого Товар Из СтрокаТаблицаТоваров.Строки Цикл
		Основание = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			Товар, "СведенияОТоварах.НомерСтроки.ДокументОснование");
		Если ЗначениеЗаполнено(Основание) Тогда
			ИдентификаторОснования = Строка(Основание.УникальныйИдентификатор());
			НоваяСтрока = ТекстоваяИнформация.Добавить();
			НоваяСтрока.Идентификатор = "ИдентификаторДокументаОснования";
			НоваяСтрока.Значение = ИдентификаторОснования;
			ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(
				Товар, НоваяСтрока, "СведенияОТоварах.НомерСтроки.ТекстоваяИнформация");
		КонецЕсли;
	КонецЦикла;
	
	ДобавитьСопоставлениеНоменклатурыВДопДанныеДереваДокументаТаблица(
		Данные, СтрокаТаблицаТоваров.ПолныйПуть, Истина,
		ЭлектронныеДокументыЭДО.ПоддерживаемыеФорматы().ФНС.УКД2020.ИнформацияПродавца);
	
КонецПроцедуры

Процедура УКД2020_ИнформацияПродавца_УдалитьДополнительныеДанные(Данные)
	
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(Данные, "СведенияОКомиссионере", Неопределено);
	
КонецПроцедуры

Процедура УКД2020_ИнформацияПродавца_ЗаполнитьСвязанныеОбъектыУчета(СвязанныеОбъектыУчета, Данные) Экспорт
	ДокументыОснованияСчетаФактуры = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Данные, "ДокументыОснованияСчетаФактуры");
	
	Если ДокументыОснованияСчетаФактуры <> Неопределено Тогда
		Если ТипЗнч(ДокументыОснованияСчетаФактуры) <> Тип("Массив") Тогда
			ДокументыОснованияСчетаФактуры = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументыОснованияСчетаФактуры);
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СвязанныеОбъектыУчета, ДокументыОснованияСчетаФактуры, Истина);
	КонецЕсли;
	
	НаборОбъектовУчета = Новый Массив;
	СтрокаТаблицаТоваров = Данные.Строки.Найти("СведенияОТоварах", "ПолныйПуть");
	Для Каждого Товар Из СтрокаТаблицаТоваров.Строки Цикл
		Основание = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.ДокументОснование");
		Если ЗначениеЗаполнено(Основание) Тогда
			НаборОбъектовУчета.Добавить(Основание);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НаборОбъектовУчета) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СвязанныеОбъектыУчета, НаборОбъектовУчета, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УКД2020_ИнформацияПокупателя

Функция УКД2020_ИнформацияПокупателя_ДанныеУчета(Знач ОбъектУчета, Знач Параметры)
	
	Данные = УКД2020_ИнформацияПокупателя_НовыеДанные();
	
	Отказ = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеУКД2020_ИнформацияПокупателя(ОбъектУчета, Данные, Отказ);
	Если Отказ Тогда
		Возврат НовыйРезультатФормированияДанныхОбъектаУчета();;
	КонецЕсли;
	
	Результат = НовыйРезультатФормированияДанныхОбъектаУчета();
	Результат.Данные = Данные;
	
	Возврат Результат;
	
КонецФункции

Функция УКД2020_ИнформацияПокупателя_НовыеДанные()
	
	Данные = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента(
		"ОбменСКонтрагентами.УКД_ИнформацияПокупателя_2020");
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

// Возвращает дополнительные параметры для перезаполнения документа ИБ,
// используется в процедуре ИнтеграцияЭДО.ПерезаполнитьОбъектУчетаПоЭлектронномуДокументу.
//
// Возвращаемое значение:
// Структура - с ключами:
//  ОбъектМетаданных - Строка - возвращает название объекта метаданных перезаполняемого документа;
//  ДокументЗагружен - Булево - если Истина, то документ успешно перезаполнен;
//
Функция ДополнительныеПараметрыПерезаполненияДокументаИБ() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ОбъектМетаданных", "");
	Параметры.Вставить("ДокументЗагружен", Ложь);
	
	Возврат Параметры;
	
КонецФункции 

Процедура ДополнитьДеревоСсылкамиНаДокументыОснования(ДеревоРазбора, Данные, ДанныеЭлектронногоДокумента)

	ПоддерживаемыеФорматы = ЭлектронныеДокументыЭДО.ПоддерживаемыеФорматы();

	Формат = Данные.ВерсияФормата;
	ЭлектронныйДокумент = ДанныеЭлектронногоДокумента.ЭлектронныйДокумент;
	ДокументыОснования = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ЭлектронныйДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	Если Формат = ПоддерживаемыеФорматы.ФНС.УПД.ИнформацияПродавца Тогда
	
		МассивИдентификаторов = Новый Массив;
		
		СтрокиДопДанныеСчетаФактуры = Данные.ЗначениеРеквизита.Строки.Найти("ДопДанныеСчетаФактуры", "ПолныйПуть");
		СтрокаТаблицы = СтрокиДопДанныеСчетаФактуры.Строки.Найти("ДопДанныеСчетаФактуры.ТекстоваяИнформация", "ПолныйПуть");
		Если ТипЗнч(СтрокаТаблицы.Значение) = Тип("Число") И СтрокаТаблицы.Значение > 0 Тогда
			Для Каждого Информация Из СтрокаТаблицы.Строки Цикл
				
				Идентификатор = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Информация,
					"ДопДанныеСчетаФактуры.ТекстоваяИнформация.НомерСтроки.Идентификатор");
				Значение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Информация,
					"ДопДанныеСчетаФактуры.ТекстоваяИнформация.НомерСтроки.Значение");
				
				Если Идентификатор = "ИдентификаторДокументаОснования" Тогда
					МассивИдентификаторов.Добавить(Значение);
				КонецЕсли;

			КонецЦикла;			
		КонецЕсли;
		
		ДокументыОснования = ДокументыОснованияПоИдентификаторам(МассивИдентификаторов, ЭлектронныйДокумент);			
				
		ДеревоЭлектронногоДокументаБЭД.ЗаполнитьЗначениеРеквизитаВДереве(Данные.ЗначениеРеквизита, "ДокументыОснованияСчетаФактуры",
				ДокументыОснования);
				
	ИначеЕсли Формат = ПоддерживаемыеФорматы.ФНС.УПД2019.ИнформацияПродавца Тогда
		
		МассивИдентификаторов = Новый Массив;
		
		СтрокиДопДанныеСчетаФактуры = Данные.ЗначениеРеквизита.Строки.Найти("ДопДанныеСчетаФактуры", "ПолныйПуть");
		СтрокаТаблицы = СтрокиДопДанныеСчетаФактуры.Строки.Найти("ДопДанныеСчетаФактуры.ТекстоваяИнформация", "ПолныйПуть");
		Если ТипЗнч(СтрокаТаблицы.Значение) = Тип("Число") И СтрокаТаблицы.Значение > 0 Тогда
			Для Каждого Информация Из СтрокаТаблицы.Строки Цикл
				
				Идентификатор = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Информация,
					"ДопДанныеСчетаФактуры.ТекстоваяИнформация.НомерСтроки.Идентификатор");
				Значение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Информация,
					"ДопДанныеСчетаФактуры.ТекстоваяИнформация.НомерСтроки.Значение");
				
				Если Идентификатор = "ИдентификаторДокументаОснования" Тогда
					МассивИдентификаторов.Добавить(Значение);
				КонецЕсли;

			КонецЦикла;			
		КонецЕсли;
		
		ДокументыОснования = ДокументыОснованияПоИдентификаторам(МассивИдентификаторов, ЭлектронныйДокумент);			
		
		ДеревоЭлектронногоДокументаБЭД.ЗаполнитьЗначениеРеквизитаВДереве(Данные.ЗначениеРеквизита, "ДокументыОснованияСчетаФактуры",
				ДокументыОснования);
	
		МассивИдентификаторов = Новый Массив;
		
		СтрокиДопДанныеСчетаФактуры = Данные.ЗначениеРеквизита.Строки.Найти("ДопДанныеДокументаОтгрузки", "ПолныйПуть");
		СтрокаТаблицы = СтрокиДопДанныеСчетаФактуры.Строки.Найти("ДопДанныеДокументаОтгрузки.ТекстоваяИнформация", "ПолныйПуть");
		Если ТипЗнч(СтрокаТаблицы.Значение) = Тип("Число") И СтрокаТаблицы.Значение > 0 Тогда
			Для Каждого Информация Из СтрокаТаблицы.Строки Цикл
				
				Идентификатор = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Информация,
					"ДопДанныеДокументаОтгрузки.ТекстоваяИнформация.НомерСтроки.Идентификатор");
				Значение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Информация,
					"ДопДанныеДокументаОтгрузки.ТекстоваяИнформация.НомерСтроки.Значение");
				
				Если Идентификатор = "ИдентификаторДокументаОснования" Тогда
					МассивИдентификаторов.Добавить(Значение);
				КонецЕсли;

			КонецЦикла;			
		КонецЕсли;
		
		ДокументыОснования = ДокументыОснованияПоИдентификаторам(МассивИдентификаторов, ЭлектронныйДокумент);			
		
		ДеревоЭлектронногоДокументаБЭД.ЗаполнитьЗначениеРеквизитаВДереве(Данные.ЗначениеРеквизита, "ДокументыОснованияДокументаОтгрузки",
				ДокументыОснования);
	
	ИначеЕсли Формат = ПоддерживаемыеФорматы.ФНС.УКД.ИнформацияПродавца 
		Или Формат = ПоддерживаемыеФорматы.ФНС.УКД2020.ИнформацияПродавца Тогда
		
		МассивИдентификаторов = Новый Массив;
		
		СтрокиДопДанныеСчетаФактуры = Данные.ЗначениеРеквизита.Строки.Найти("ДопДанныеСчетаФактуры", "ПолныйПуть");
		СтрокаТаблицы = СтрокиДопДанныеСчетаФактуры.Строки.Найти("ДопДанныеСчетаФактуры.ТекстоваяИнформация", "ПолныйПуть");
		Если ТипЗнч(СтрокаТаблицы.Значение) = Тип("Число") И СтрокаТаблицы.Значение > 0 Тогда
			Для Каждого Информация Из СтрокаТаблицы.Строки Цикл
				
				Идентификатор = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Информация,
					"ДопДанныеСчетаФактуры.ТекстоваяИнформация.НомерСтроки.Идентификатор");
				Значение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Информация,
					"ДопДанныеСчетаФактуры.ТекстоваяИнформация.НомерСтроки.Значение");
				
				Если Идентификатор = "ИдентификаторДокументаОснования" Тогда
					МассивИдентификаторов.Добавить(Значение);
				КонецЕсли;

			КонецЦикла;			
		КонецЕсли;
		
		ДокументыОснования = ДокументыОснованияПоИдентификаторам(МассивИдентификаторов, ЭлектронныйДокумент);			
		
		ДеревоЭлектронногоДокументаБЭД.ЗаполнитьЗначениеРеквизитаВДереве(Данные.ЗначениеРеквизита, "ДокументыОснованияСчетаФактуры",
				ДокументыОснования);
					
	ИначеЕсли Формат = ПоддерживаемыеФорматы.ФНС.ПередачаТоваров.ИнформацияПродавца Тогда
		
		МассивИдентификаторов = Новый Массив;
		
		СтрокиДопДанныеСчетаФактуры = Данные.ЗначениеРеквизита.Строки.Найти("ДопДанные", "ПолныйПуть");
		СтрокаТаблицы = СтрокиДопДанныеСчетаФактуры.Строки.Найти("ДопДанные.Подписанные", "ПолныйПуть");
		Если ТипЗнч(СтрокаТаблицы.Значение) = Тип("Число") И СтрокаТаблицы.Значение > 0 Тогда
			Для Каждого Информация Из СтрокаТаблицы.Строки Цикл
				
				Идентификатор = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Информация,
					"ДопДанные.Подписанные.НомерСтроки.Идентификатор");
				Значение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Информация,
					"ДопДанные.Подписанные.НомерСтроки.Значение");
				
				Если Идентификатор = "ИдентификаторДокументаОснования" Тогда
					МассивИдентификаторов.Добавить(Значение);
				КонецЕсли;

			КонецЦикла;			
		КонецЕсли;
		
		ДокументыОснования = ДокументыОснованияПоИдентификаторам(МассивИдентификаторов, ЭлектронныйДокумент);			
		
		ДеревоЭлектронногоДокументаБЭД.ЗаполнитьЗначениеРеквизитаВДереве(Данные.ЗначениеРеквизита, "ДокументыОснования",
				ДокументыОснования);
		
	Иначе		 
		 ЗаполнитьСсылкиНаДокументыОснованияПоИдентификаторам(ДеревоРазбора, Данные, ДанныеЭлектронногоДокумента);	
	КонецЕсли;	

КонецПроцедуры

Процедура ЗаполнитьСсылкиНаДокументыОснованияПоИдентификаторам(ДеревоРазбора, НовыйЭД, ДанныеЭлектронногоДокумента)
	
	ЭлектронныйДокумент = ДанныеЭлектронногоДокумента.ЭлектронныйДокумент;
	
	ЭтоСчетФактура = ДанныеЭлектронногоДокумента.ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетФактура Или
		ДанныеЭлектронногоДокумента.ТипДокумента = Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура;
		
	ИДДокументаОснования = НовыйЭД.Строки.Найти("ИдентификаторДокументаОснования", "Реквизит", Истина);
	ИДЭДДокументаОснования = НовыйЭД.Строки.Найти("ИДЭДДокументаОснования", "Реквизит", Истина);
	// Для счета-фактуры в переопределяемой части ожидается несколько иная структура данных по основаниям.
	Если ЭтоСчетФактура Тогда
		ДокументыОснования = НовыйЭД.Строки.Найти("ДокументыОснования", "Реквизит", Истина);
		Если ДокументыОснования <> Неопределено Тогда
			Для Каждого Строка Из ДокументыОснования.Строки Цикл
				ПараметрыДокументаОснования = Строка.ЗначениеРеквизита;
				ДокументОснование = Неопределено;
				Если ПараметрыДокументаОснования.Свойство("ИдентификаторДокументаОснования", ИДЭДДокументаОснования)
					И ЗначениеЗаполнено(ИДЭДДокументаОснования) Тогда

					ИдентификаторыОснований = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИДДокументаОснования.ЗначениеРеквизита); 
					ДокументыОснования = ДокументыОснованияПоИдентификаторам(ИдентификаторыОснований, ЭлектронныйДокумент);
					Если ЗначениеЗаполнено(ДокументыОснования) Тогда
						ДокументОснование = ДокументыОснования[0];
					КонецЕсли;
				КонецЕсли;
				Если ДокументОснование <> Неопределено Тогда
					Строка.СсылкаНаОбъект = ДокументОснование;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Если ИДДокументаОснования <> Неопределено Тогда
				ИдентификаторыОснований = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИДДокументаОснования.ЗначениеРеквизита); 
				ДокументыОснования = ДокументыОснованияПоИдентификаторам(ИдентификаторыОснований, ЭлектронныйДокумент);
				Если ЗначениеЗаполнено(ДокументыОснования) Тогда
					ДокументОснование = ДокументыОснования[0];
				КонецЕсли;
			КонецЕсли;
			Если ДокументОснование <> Неопределено Тогда
				ПараметрыОснования = Новый Структура("ИдентификаторДокументаОснования, ИДЭДДокументаОснования,
					|ВидДокументаОснования, НомерДокументаОснования, ДатаДокументаОснования");
				Для Каждого Элемент Из ПараметрыОснования Цикл
					СтрокаРеквизита = НовыйЭД.Строки.Найти(Элемент.Ключ, "Реквизит", Истина);
					Если СтрокаРеквизита <> Неопределено Тогда	
						ПараметрыОснования[Элемент.Ключ] = СтрокаРеквизита.ЗначениеРеквизита;
					КонецЕсли;
				КонецЦикла;
				НовСтрока = НовыйЭД.Строки.Добавить();
				НовСтрока.Реквизит = "ДокументыОснования";
				ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовСтрока, "ДокументОснования", ПараметрыОснования, ДокументОснование);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ДокументОснование = Неопределено;
		Если ИДДокументаОснования <> Неопределено Тогда
			ИдентификаторыОснований = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИДДокументаОснования.ЗначениеРеквизита); 
			ДокументыОснования = ДокументыОснованияПоИдентификаторам(ИдентификаторыОснований, ЭлектронныйДокумент);
			Если ЗначениеЗаполнено(ДокументыОснования) Тогда
				ДокументОснование = ДокументыОснования[0];
			КонецЕсли;
		КонецЕсли;
		Если ДокументОснование <> Неопределено Тогда
			НайденныйТипВДереве = ДеревоЭлектронногоДокументаБЭД.НайтиСоздатьТипОбъектаВДеревеРазбора(ДеревоРазбора, "ДокументыОснования");
			ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НайденныйТипВДереве, "ДокументОснования", ДокументОснование, ДокументОснование);
			НайденнаяСтрока = НайденныйТипВДереве.Строки.Найти(ДокументОснование, "СсылкаНаОбъект");
			НайденнаяСтрока.ИндексСтроки = НайденныйТипВДереве.ИндексСтроки + "_"
				+ Строка(НайденныйТипВДереве.Строки.Индекс(НайденнаяСтрока));
			ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "Основание", НайденнаяСтрока.ИндексСтроки, ДокументОснование);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ДокументыОснованияПоИдентификаторам(ИдентификаторыОснований, ЭлектронныйДокумент)

	Если Не ЗначениеЗаполнено(ЭлектронныйДокумент) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ОтборСвязанныхДокументов = ЭлектронныеДокументыЭДО.НовыйОтборСвязанныхДокументовВходящегоЭДО();
	ОтборСвязанныхДокументов.ИдентификаторыСвязи = ИдентификаторыОснований;
	ОтборСвязанныхДокументов.ЭлектронныйДокумент = ЭлектронныйДокумент;
	
	ЗапросСвязанныхДокументов = ЭлектронныеДокументыЭДО.ЗапросСвязанныхДокументовВходящегоЭДО(ОтборСвязанныхДокументов, "СвязанныеДокументы");
	
	Запросы = Новый Массив;
	Запросы.Добавить(ЗапросСвязанныхДокументов);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СвязанныеДокументы.ЭлектронныйДокумент КАК ЭлектронныеДокумент,
	|	АктуальныеДокументыЭДО.ОбъектУчета КАК ОбъектУчета
	|ИЗ
	|	СвязанныеДокументы КАК СвязанныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеДокументыЭДО КАК АктуальныеДокументыЭДО
	|		ПО АктуальныеДокументыЭДО.ЭлектронныйДокумент = СвязанныеДокументы.ЭлектронныйДокумент";
	
	ИтоговыйЗапрос = ОбщегоНазначенияБЭД.СоединитьЗапросы(Запрос, Запросы);
	
	Возврат ИтоговыйЗапрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОбъектУчета");
	
КонецФункции

Функция СпособОбработкиЭлектронногоДокументаПоОснованию(ЭлектронныйДокумент, ОбъектУчета)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОбъектыУчетаДокументовЭДО.СпособОбработки КАК СпособОбработки
		|ИЗ
		|	РегистрСведений.ОбъектыУчетаДокументовЭДО КАК ОбъектыУчетаДокументовЭДО
		|ГДЕ
		|	ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент
		|	И ОбъектыУчетаДокументовЭДО.ОбъектУчета = &ОбъектУчета";
	
	Запрос.УстановитьПараметр("ОбъектУчета", ОбъектУчета);
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.СпособОбработки;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

Функция НовыеСведенияФизЛицаПользователя()
	СведенияФизЛицаПользователя = Новый Структура;
	СведенияФизЛицаПользователя.Вставить("ИмяПолное", "");
	СведенияФизЛицаПользователя.Вставить("Должность", "");
	Возврат СведенияФизЛицаПользователя;
КонецФункции

// Возвращает массив проведенных документов.
//
// Параметры:
//  МассивДокументов - Массив - массив ссылок на документы.
//
// Возвращаемое значение:
//  Массив - массив ссылок на документы, которые проведены.
//
Функция МассивПроведенныхДокументов(Знач МассивДокументов) Экспорт
	
	МассивПроведенныхДокументов = Новый Массив;
	МассивПроводимыхДокументов = ОбщегоНазначенияБЭД.МассивПроводимыхДокументов(
		МассивДокументов);
	
	Для Каждого Документ Из МассивПроводимыхДокументов Цикл
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Проведен") Тогда
			МассивПроведенныхДокументов.Добавить(Документ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивПроведенныхДокументов;
	
КонецФункции

Функция НовыеСвойстваАктуальногоТипаДокумента()
	Возврат Новый Структура("ИспользоватьДляВходящих, ИспользоватьДляИсходящих");
КонецФункции

Функция НовыеПараметрыОбработкиСохранитьДанныеОбъектаВБД(СсылкаНаВладельца = Неопределено, Записывать = Истина,
	СпособОбработки = "") Экспорт

	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("СсылкаНаВладельца", СсылкаНаВладельца);
	ПараметрыОбработки.Вставить("Записывать",        Записывать);
	ПараметрыОбработки.Вставить("СпособОбработки",   СпособОбработки);
	
	Возврат ПараметрыОбработки;

КонецФункции

Функция СтатусПриглашения(Настройки)
	
	ОтборПриглашений = ПриглашенияЭДО.НовыйОтборПриглашений();
	ОтборПриглашений.ИдентификаторОрганизации = "&ИдентификаторОрганизации";
	ОтборПриглашений.ИдентификаторКонтрагента = "&ИдентификаторКонтрагента";
	ЗапросПриглашений = ПриглашенияЭДО.ЗапросПриглашений("Приглашения", ОтборПриглашений);
	
	Запросы = Новый Массив;
	Запросы.Добавить(ЗапросПриглашений);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Приглашения.Статус
	|ИЗ
	|	Приглашения КАК Приглашения";
	
	ИтоговыйЗапрос = ОбщегоНазначенияБЭД.СоединитьЗапросы(Запрос, Запросы);
	ИтоговыйЗапрос.УстановитьПараметр("ИдентификаторОрганизации", Настройки.ИдентификаторОтправителя);
	ИтоговыйЗапрос.УстановитьПараметр("ИдентификаторКонтрагента", Настройки.ИдентификаторПолучателя);
	
	РезультатЗапроса = ИтоговыйЗапрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			СтатусПодключения = Выборка.Статус;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтатусПодключения;
	
КонецФункции

Функция ПредставлениеОснованияБезОбъектаУчета(ТипДокумента)
	Возврат Строка(ТипДокумента);
КонецФункции

Процедура ДобавитьВидДокументаДляОтображенияВДопДанныеДереваДокумента(Данные, ТекстоваяИнформация)
	
	ИдентификаторВидаДокумента = ИдентификаторВидаДокументаДляОтображенияВУчете();
	ВидДокументаДляОтображения = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
		Данные, ИдентификаторВидаДокумента, Ложь);
	Если ЗначениеЗаполнено(ВидДокументаДляОтображения) Тогда
		НоваяСтрока = ТекстоваяИнформация.Добавить();
		НоваяСтрока.Идентификатор = ИдентификаторВидаДокумента;
		НоваяСтрока.Значение = ВидДокументаДляОтображения;
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(
			Данные, НоваяСтрока, "ДопДанныеСчетаФактуры.ТекстоваяИнформация");
	КонецЕсли;
	
КонецПроцедуры

Функция ИдентификаторВидаДокументаДляОтображенияВУчете() 
	
	Возврат "ВидДокумента";
	
КонецФункции

#КонецОбласти

Функция НовыйРезультатОтраженияВУчете() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Отражено", 0);
	Результат.Вставить("Пропущено", 0);
	Результат.Вставить("ОтражениеНедоступно", 0);

	Возврат Результат;
	
КонецФункции

Процедура ИсключитьНеОтражаемыеВУчетеЭлектронныеДокументы(Параметры, Результат)
	
	Для каждого СтрокаПараметров Из Параметры Цикл
		
		Файл = Новый Файл(СтрокаПараметров.ДанныеОсновногоФайла.ИмяФайла);
		
		Описание = "";
		Если Нрег(Файл.Расширение) <> ".xml" 
			Или Не ВозможноСозданиеУчетногоДокумента(СтрокаПараметров.ДанныеОсновногоФайла.ДвоичныеДанные, Описание) Тогда
			СтрокаПараметров.ОтключитьКонтрольОтраженияВУчете = Истина;			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВозможноСозданиеУчетногоДокумента(ДвоичныеДанные, Описание) Экспорт

	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("ЭтоСводныйУПД", ЭлектронныеДокументыЭДО.ЭтоСводныйУПД(ДвоичныеДанные));	
	
	Отказ = Ложь;
	ОбменСКонтрагентамиПереопределяемый.ПриПроверкеВозможностиСозданияУчетногоДокумента(ПараметрыПроверки, Отказ, Описание);
	
	Возврат Не Отказ;
	
КонецФункции

Процедура ВключитьКонтрольОтраженияВУчете(Параметры)
	
	УстановитьПривилегированныйРежим(Истина);	
	
	НаКонтроль = Новый Массив;
	ТребуетсяКонтроль = ТребуетсяКонтрольОтраженияВУчете(Параметры);
	
	Для Каждого СтрокаПараметров Из Параметры Цикл
		
		Если Не ТребуетсяКонтроль[СтрокаПараметров.ЭлектронныйДокумент] Тогда
			Продолжить;
		КонецЕсли;
		
		НаКонтроль.Добавить(СтрокаПараметров.ЭлектронныйДокумент);
		
		ВыполнитьКонтрольСопоставленияНоменклатуры(СтрокаПараметров);
		ВыполнитьКонтрольПроведенияУчетныхДокументов(СтрокаПараметров.ЭлектронныйДокумент);
		
	КонецЦикла;
	
	ВыполнитьКонтрольОтраженияВУчете(НаКонтроль);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#Область КонтрольСопоставленияНоменклатуры

// Выполняет проверку электронного документа на наличие не сопоставленной номенклатуры.
// Не сопоставленная номенклатура ставится на контроль.
//
// Параметры:
//  ДанныеЭлектронногоДокумента - См. _ЭлектронныеДокументыЭДО.НовыеДанныеДокументооборота() - электронный документ на проверку.
//                                                                     Обязателен, если не задан параметр НаборНоменклатурыКонтрагентов.
//  НаборНоменклатурыКонтрагентов - Массив - номенклатура контрагентов для контроля.
//                                           Если задан, то номенклатура из электронного документа не извлекается.
//  Сохранить - Булево - признак сохранения номенклатуры контрагента в информационной базе.
//                       Если задан параметр ЭлектронныйДокумент, то сохранение будет выполнено в любом случае, т.к. необходимо для работы механизма контроля.
//
Функция ВыполнитьКонтрольСопоставленияНоменклатуры(Знач ДанныеЭлектронногоДокумента = Неопределено,
		Знач НаборНоменклатурыКонтрагентов = Неопределено, Знач Сохранить = Истина) Экспорт
	
	ЭлектронныйДокумент = Неопределено;
	Если ДанныеЭлектронногоДокумента <> Неопределено Тогда
		ЭлектронныйДокумент = ДанныеЭлектронногоДокумента.ЭлектронныйДокумент;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлектронныйДокумент) И Не ОтключенКонтрольОтраженияВУчетеВНастройках(ДанныеЭлектронногоДокумента) Тогда
		Сохранить = Истина;
	КонецЕсли;

	// Извлекаем данные о номенклатуре контрагента из электронного документа.
	СодержитИзменяемыеДанные = Ложь;
	Если Не ЗначениеЗаполнено(НаборНоменклатурыКонтрагентов) И ЗначениеЗаполнено(ЭлектронныйДокумент) Тогда
				
		ПараметрыПолучения = ЭлектронныеДокументыЭДО.НовыеПараметрыПолученияДанныхДокумента();
		ПараметрыПолучения.ОсновнойФайл = ДанныеЭлектронногоДокумента.ДанныеОсновногоФайла;
		ПараметрыПолучения.ДополнительныйФайл = ДанныеЭлектронногоДокумента.ДанныеДополнительногоФайла;
	
		ИнформацияОТоваре = ЭлектронныеДокументыЭДО.ДанныеНоменклатурыДокумента(ПараметрыПолучения);
		
		Контрагент = ДанныеЭлектронногоДокумента.Отправитель;
		Владелец = СопоставлениеНоменклатурыКонтрагентовСлужебный.ВладелецНоменклатурыКонтрагента(Контрагент);		
		НаборНоменклатурыКонтрагентов = ЗаполнитьНаборНоменклатурыКонтрагентовПоТаблицеТоваров(ИнформацияОТоваре, Владелец, СодержитИзменяемыеДанные);
	КонецЕсли;
	// Найдем номенклатуру, которую не нужно сопоставлять с номенклатурой контрагентов.
	КОбработке = Новый Массив;
	НаборИдентификаторовСервиса = Новый Массив;
	Для Каждого НоменклатураКонтрагента Из НаборНоменклатурыКонтрагентов Цикл
		// Найдем номенклатуру, которая задана в наших идентификаторах.
		НоменклатураИБ = НайтиНоменклатуруИБПоИдентификатору(НоменклатураКонтрагента.Идентификатор);
		Если ЗначениеЗаполнено(НоменклатураИБ.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		КОбработке.Добавить(НоменклатураКонтрагента);
		// Заполним набор идентификаторов сервиса.
		Если ЗначениеЗаполнено(НоменклатураКонтрагента.ИдентификаторНоменклатурыСервиса) Тогда
			ИдентификаторСервиса = Новый Структура("ИдентификаторНоменклатуры,ИдентификаторХарактеристики",
				НоменклатураКонтрагента.ИдентификаторНоменклатурыСервиса, НоменклатураКонтрагента.ИдентификаторХарактеристикиСервиса);
			НаборИдентификаторовСервиса.Добавить(ИдентификаторСервиса);
		КонецЕсли;
	КонецЦикла;
	// Найдем номенклатуру, связанную с сервисом 1С:Номенклатура.
	ЕстьРаботаСНоменклатурой = ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.РаботаСНоменклатурой");
	Если ЕстьРаботаСНоменклатурой И ЗначениеЗаполнено(НаборИдентификаторовСервиса) Тогда
		МодульРаботаСНоменклатурой = ОбщегоНазначения.ОбщийМодуль("РаботаСНоменклатурой");
		ДанныеСервиса = МодульРаботаСНоменклатурой.НоменклатураИХарактеристикиПоИдентификаторам(НаборИдентификаторовСервиса);
		Если ЗначениеЗаполнено(ДанныеСервиса) Тогда
			ДанныеСервиса.Индексы.Добавить("ИдентификаторНоменклатуры, ИдентификаторХарактеристики");
			СоответствиеСвойствНоменклатурыИБ = СопоставлениеНоменклатурыКонтрагентовСлужебный.СвойстваНоменклатурыИнформационнойБазы(ДанныеСервиса.ВыгрузитьКолонку("Номенклатура"));
		КонецЕсли;
	КонецЕсли;
	// Найдем сопоставление с номенклатурой контрагентов
	НаСопоставление = Новый Массив;
	НеСопоставлено = Новый Массив;
	Для Каждого НоменклатураКонтрагента Из КОбработке Цикл
		// Пропускаем найденное по идентификаторам сервиса.
		Если ЕстьРаботаСНоменклатурой И ЗначениеЗаполнено(НоменклатураКонтрагента.ИдентификаторНоменклатурыСервиса) Тогда
			ОтборИдентификатораСервиса = Новый Структура("ИдентификаторНоменклатуры, ИдентификаторХарактеристики", 
				НоменклатураКонтрагента.ИдентификаторНоменклатурыСервиса, НоменклатураКонтрагента.ИдентификаторХарактеристикиСервиса);
			СтрокиДанныхСервиса = ДанныеСервиса.НайтиСтроки(ОтборИдентификатораСервиса);
			Если ЗначениеЗаполнено(СтрокиДанныхСервиса) Тогда
				НоменклатураИБ = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураИнформационнойБазы(
					СтрокиДанныхСервиса[0].Номенклатура, СтрокиДанныхСервиса[0].Характеристика);
					
				ОбязательноеЗаполнениеХарактеристики = Ложь;
				ИспользоватьХарактеристики           = Неопределено;
				Свойства = СоответствиеСвойствНоменклатурыИБ.Получить(НоменклатураИБ.Номенклатура);
				Если Свойства <> Неопределено Тогда
					ОбязательноеЗаполнениеХарактеристики = Свойства.ОбязательноеЗаполнениеХарактеристики;
					ИспользоватьХарактеристики           = Свойства.ИспользоватьХарактеристики;
				КонецЕсли;
				
				// Если характеристики не определены и используются, то добавляем к сопоставлению.
				Если НЕ ЗначениеЗаполнено(НоменклатураИБ.Характеристика) Тогда
					Если ИспользоватьХарактеристики = Истина И ОбязательноеЗаполнениеХарактеристики Тогда
						НаСопоставление.Добавить(НоменклатураКонтрагента);
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				СопоставлениеНоменклатурыКонтрагентов.УстановитьСоответствиеНоменклатуры(НоменклатураКонтрагента, НоменклатураИБ, ИспользоватьХарактеристики, Ложь);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		НаСопоставление.Добавить(НоменклатураКонтрагента);
	КонецЦикла;
	Если НЕ ЗначениеЗаполнено(НаСопоставление) Тогда
		Возврат НеСопоставлено;
	КонецЕсли;
	ОтборПоНоменклатуреКонтрагента = Новый Структура("НоменклатураКонтрагента", НаСопоставление);
	Сопоставление = СопоставлениеНоменклатурыКонтрагентов.НайтиСоответствиеНоменклатуры(ОтборПоНоменклатуреКонтрагента);
	// Определим не сопоставленную номенклатуру.
	НаОбновление = Новый Массив;
	НаборНоменклатурыДляПоискаСвойств = Новый Массив;
	Для Каждого НоменклатураКонтрагента Из НаСопоставление Цикл
		
		ЕстьСопоставление = Ложь;
		Для Каждого Элемент Из Сопоставление Цикл
			Если НЕ ЗначениеЗаполнено(Элемент.НоменклатураИБ.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			Если НоменклатураКонтрагента.Владелец = Элемент.НоменклатураКонтрагента.Владелец
				И НоменклатураКонтрагента.Идентификатор = Элемент.НоменклатураКонтрагента.Идентификатор Тогда
				// Если содержит изменяемые данные о номенклатуре, то остальные свойства не проверяем.
				Если СодержитИзменяемыеДанные Тогда
					ЕстьСопоставление = Истина;
					Прервать;
				КонецЕсли;
			Иначе
				Продолжить;
			КонецЕсли;
			// Очистим свойства, которые не нужно сравнивать.
			ДанныеДокумента = ОбщегоНазначения.СкопироватьРекурсивно(НоменклатураКонтрагента);
			ДанныеБазы = ОбщегоНазначения.СкопироватьРекурсивно(Элемент.НоменклатураКонтрагента);
			ИсключаемыеСвойства = СтрРазделить("СтавкаНДС,Штрихкод,ШтрихкодКомбинации,ШтрихкодыНоменклатуры,ИсторияИдентификаторов"
				+ ",НаименованиеУпаковки,ЕдиницаИзмерения", ",");
			
			Для Каждого Свойство Из ИсключаемыеСвойства Цикл
				ДанныеДокумента.Вставить(Свойство, Неопределено);
				ДанныеБазы.Вставить(Свойство, Неопределено);
			КонецЦикла;
			НормализоватьДанныеСопоставления(ДанныеДокумента);
			НормализоватьДанныеСопоставления(ДанныеБазы);
			// Приведение длины наименования в связи с увеличением с 300 до 1000 символов.
			ДанныеДокумента.Наименование = Лев(ДанныеДокумента.Наименование, 300);
			
			ДанныеДокумента.ИдентификаторНоменклатуры = Лев(ДанныеДокумента.ИдентификаторНоменклатуры, 100);
			ДанныеДокумента.ИдентификаторХарактеристики = Лев(ДанныеДокумента.ИдентификаторХарактеристики, 100);
			ДанныеДокумента.ИдентификаторУпаковки = Лев(ДанныеДокумента.ИдентификаторУпаковки, 100);
						
			Если ОбщегоНазначения.ДанныеСовпадают(ДанныеДокумента, ДанныеБазы) Тогда
				ЕстьСопоставление = Истина;
				ДанныеДокументаОбновление = ОбщегоНазначения.СкопироватьРекурсивно(НоменклатураКонтрагента);
				ДанныеДокументаОбновление.ИсторияИдентификаторов = Неопределено;
				ДанныеБазыОбновление = ОбщегоНазначения.СкопироватьРекурсивно(Элемент.НоменклатураКонтрагента);
				ДанныеБазыОбновление.ИсторияИдентификаторов = Неопределено;
				Если НЕ ОбщегоНазначения.ДанныеСовпадают(ДанныеДокументаОбновление, ДанныеБазыОбновление) Тогда
					ДанныеДляОбновления = ОбщегоНазначения.СкопироватьРекурсивно(Элемент);
					ЗаполнитьЗначенияСвойств(ДанныеДляОбновления.НоменклатураКонтрагента, НоменклатураКонтрагента);
					НаОбновление.Добавить(ДанныеДляОбновления);
					НаборНоменклатурыДляПоискаСвойств.Добавить(Элемент.НоменклатураИБ.Номенклатура);
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ЕстьСопоставление Тогда
			НоваяНоменклатураКонтрагента = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагента();
			ЗаполнитьЗначенияСвойств(НоваяНоменклатураКонтрагента, НоменклатураКонтрагента);
			НеСопоставлено.Добавить(НоваяНоменклатураКонтрагента);
		КонецЕсли;
		
	КонецЦикла;
	// Проверка истории изменения идентификатора.
	НеСопоставлено = ПроверитьИсториюИдентификаторовНоменклатурыКонтрагентов(НеСопоставлено);
	// Включаем контроль по не сопоставленной номенклатуре.
	Если ЗначениеЗаполнено(ЭлектронныйДокумент) И Не ОтключенКонтрольОтраженияВУчетеВНастройках(ДанныеЭлектронногоДокумента) Тогда
		ВключитьКонтрольСопоставленияНоменклатуры(ЭлектронныйДокумент, НеСопоставлено);
	КонецЕсли;
	// Сохраняем не сопоставленную номенклатуру контрагента.
	Если Сохранить Тогда
		Для Каждого НоменклатураКонтрагента Из НеСопоставлено Цикл
			СопоставлениеНоменклатурыКонтрагентов.УстановитьСоответствиеНоменклатуры(НоменклатураКонтрагента);
		КонецЦикла;
		
		СоответствиеСвойствНоменклатурыИБ = СопоставлениеНоменклатурыКонтрагентовСлужебный.СвойстваНоменклатурыИнформационнойБазы(НаборНоменклатурыДляПоискаСвойств);
		
		Для Каждого Элемент Из НаОбновление Цикл
			ИспользоватьХарактеристики = Ложь;
			Свойства = СоответствиеСвойствНоменклатурыИБ.Получить(Элемент.НоменклатураИБ.Номенклатура);
			Если Свойства <> Неопределено Тогда
				ИспользоватьХарактеристики = Свойства.ИспользоватьХарактеристики;
			КонецЕсли;
			СопоставлениеНоменклатурыКонтрагентов.УстановитьСоответствиеНоменклатуры(Элемент.НоменклатураКонтрагента, Элемент.НоменклатураИБ, ИспользоватьХарактеристики);
		КонецЦикла;
	КонецЕсли;
	
	Возврат НеСопоставлено;
	
КонецФункции

Функция ЗаполнитьНаборНоменклатурыКонтрагентовПоТаблицеТоваров(ТаблицаТоваров, Владелец, СодержитИзменяемыеДанные = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ТаблицаТоваров) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	НаборНоменклатурыКонтрагентов = Новый Массив;
	
	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		Сопоставление = СтрокаТовара.Сопоставление;
		Если ТипЗнч(Сопоставление) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		Если Не Сопоставление.Свойство("Идентификатор") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Сопоставление.Свойство("СодержитИзменяемыеДанные")
			И Сопоставление.СодержитИзменяемыеДанные Тогда
			СодержитИзменяемыеДанные = Истина;
		КонецЕсли;
		
		НоменклатураКонтрагента = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагента();
		ЗаполнитьЗначенияСвойств(НоменклатураКонтрагента, Сопоставление);
		НоменклатураКонтрагента.Владелец = Владелец;
		
		СопоставлениеНоменклатурыКонтрагентовКлиентСервер.РазделитьИдентификаторНаЧасти(Сопоставление.Идентификатор, НоменклатураКонтрагента);
		
		НаборНоменклатурыКонтрагентов.Добавить(НоменклатураКонтрагента);
		
	КонецЦикла;
	
	Возврат НаборНоменклатурыКонтрагентов;
	
КонецФункции

// Выполняет попытку поиска номенклатуры ИБ по переданному идентификатору.
// 
// Параметры:
//  Идентификатор - Строка - идентификатор, по которому требуется найти номенклатуру ИБ.
//
// Возвращаемое значение:
//  Структура - найденная номенклатура ИБ. См. СопоставлениеНоменклатурыКонтрагентовКлиентСервер..НоваяНоменклатураИнформационнойБазы.
//
Функция НайтиНоменклатуруИБПоИдентификатору(Знач Идентификатор) Экспорт
	
	НоменклатураИБ = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураИнформационнойБазы();
	
	СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриПоискеНоменклатурыПоИдентификатору(Идентификатор, НоменклатураИБ);
	
	Если ЗначениеЗаполнено(НоменклатураИБ.Номенклатура) Тогда
		Возврат НоменклатураИБ;
	КонецЕсли;
	
	// Библиотека формирует идентификатор по шаблону:
	// <ИДНоменклатуры>#<ИДХарактеристики>#<ИДУпаковки>
	ЧастиИД = СтрРазделить(Идентификатор, "#", Истина);
	Если ЧастиИД.Количество() <> 3 Тогда
		Возврат НоменклатураИБ;
	КонецЕсли;
	
	Номенклатура = Неопределено;
	Характеристика = Неопределено;
	Упаковка = Неопределено;
	
	ЕстьОшибка = Ложь;
	
	Попытка
		
		// Номенклатура
		Если ЗначениеЗаполнено(ЧастиИД[0]) Тогда
			Ссылка = ОбщегоНазначенияБЭД.НайтиСсылкуПоИдентификатору(ЧастиИД[0], Метаданные.ОпределяемыеТипы.НоменклатураБЭД.Тип);
			Если ЗначениеЗаполнено(Ссылка) Тогда
				Номенклатура = Ссылка;
			Иначе
				ЕстьОшибка = Истина;
			КонецЕсли;
		КонецЕсли;
		// Характеристика
		Если ЗначениеЗаполнено(ЧастиИД[1]) Тогда
			Ссылка = ОбщегоНазначенияБЭД.НайтиСсылкуПоИдентификатору(ЧастиИД[1], Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатурыБЭД.Тип);
			Если ЗначениеЗаполнено(Ссылка) Тогда
				Характеристика = Ссылка;
			Иначе
				ЕстьОшибка = Истина;
			КонецЕсли;
		КонецЕсли;
		// Упаковка
		Если ЗначениеЗаполнено(ЧастиИД[2]) Тогда
			Ссылка = ОбщегоНазначенияБЭД.НайтиСсылкуПоИдентификатору(ЧастиИД[2], Метаданные.ОпределяемыеТипы.УпаковкаНоменклатурыБЭД.Тип);
			Если ЗначениеЗаполнено(Ссылка) Тогда
				Упаковка = Ссылка;
			Иначе
				ЕстьОшибка = Истина;
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		ЕстьОшибка = Истина;
	КонецПопытки;
	
	Если ЕстьОшибка Тогда
		Возврат НоменклатураИБ;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		НоменклатураИБ.Номенклатура = Номенклатура;
	Иначе
		Возврат НоменклатураИБ;
	КонецЕсли;
	Если ЗначениеЗаполнено(Характеристика) Тогда
		НоменклатураИБ.Характеристика = Характеристика;
	КонецЕсли;
	Если ЗначениеЗаполнено(Упаковка) Тогда
		НоменклатураИБ.Упаковка = Упаковка;
	КонецЕсли;
	
	Возврат НоменклатураИБ;
	
КонецФункции

// Ставит электронный документ на контроль сопоставления номенклатуры контрагента.
//
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - ЭлектронныйДокумент, который ставится на контроль.
//  НаборНоменклатурыКонтрагентов - Массив - номенклатура контрагента, по которой требуется контролировать сопоставление.
//
Процедура ВключитьКонтрольСопоставленияНоменклатуры(Знач ЭлектронныйДокумент, Знач НаборНоменклатурыКонтрагентов)
	
	Если ТипЗнч(НаборНоменклатурыКонтрагентов) <> Тип("Массив") Тогда
		НаборНоменклатурыКонтрагентов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НаборНоменклатурыКонтрагентов);
	КонецЕсли;
	
	Для Каждого НоменклатураКонтрагента Из НаборНоменклатурыКонтрагентов Цикл
		
		Набор = РегистрыСведений.КонтрольСопоставленияНоменклатурыЭДО.СоздатьНаборЗаписей();
		Набор.Отбор.ЭлектронныйДокумент.Установить(ЭлектронныйДокумент);
		Набор.Отбор.Владелец.Установить(НоменклатураКонтрагента.Владелец);
		Набор.Отбор.Идентификатор.Установить(НоменклатураКонтрагента.Идентификатор);
		
		Запись = Набор.Добавить();
		Запись.ЭлектронныйДокумент = ЭлектронныйДокумент;
		Запись.Владелец = НоменклатураКонтрагента.Владелец;
		Запись.Идентификатор = НоменклатураКонтрагента.Идентификатор;
		
		Набор.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Прекращает контроль сопоставления номенклатуры контрагентов.
// Возвращает набор электронных документов, за которыми данный контроль был закреплен.
//
// Параметры:
//  НаборНоменклатурыКонтрагентов - Массив - номенклатура контрагента, по которой требуется отключить контроль сопоставления.
//
Функция ОтключитьКонтрольСопоставленияНоменклатурыКонтрагентов(Знач НаборНоменклатурыКонтрагентов)
	
	Если ТипЗнч(НаборНоменклатурыКонтрагентов) <> Тип("Массив") Тогда
		НаборНоменклатурыКонтрагентов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НаборНоменклатурыКонтрагентов);
	КонецЕсли;
	
	НаборЭлектронныхДокументов = Новый Массив;
	
	Для Каждого НоменклатураКонтрагента Из НаборНоменклатурыКонтрагентов Цикл
		
		НачатьТранзакцию();
		Попытка
			Набор = РегистрыСведений.КонтрольСопоставленияНоменклатурыЭДО.СоздатьНаборЗаписей();
			Набор.Отбор.Владелец.Установить(НоменклатураКонтрагента.Владелец);
			Набор.Отбор.Идентификатор.Установить(НоменклатураКонтрагента.Идентификатор);
			ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(Набор);
			Набор.Прочитать();
			
			Для Каждого Запись Из Набор Цикл
				Если НаборЭлектронныхДокументов.Найти(Запись.ЭлектронныйДокумент) = Неопределено Тогда
					НаборЭлектронныхДокументов.Добавить(Запись.ЭлектронныйДокумент);
				КонецЕсли;
			КонецЦикла;
			
			Если ЗначениеЗаполнено(Набор) Тогда
				Набор.Очистить();
				Набор.Записать();
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат НаборЭлектронныхДокументов;
	
КонецФункции

Функция ПроверитьИсториюИдентификаторовНоменклатурыКонтрагентов(Знач НаборНоменклатурыКонтрагентов)
	
	ТипСтрока100 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная));
	ТипСтрока300 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(300, ДопустимаяДлина.Переменная));
	
	ТаблицаИстории = Новый ТаблицаЗначений;
	ТаблицаИстории.Колонки.Добавить("Владелец", Метаданные.ОпределяемыеТипы.ВладелецНоменклатурыБЭД.Тип);
	ТаблицаИстории.Колонки.Добавить("Идентификатор", ТипСтрока300);
	ТаблицаИстории.Колонки.Добавить("НовыйИдентификатор", ТипСтрока300);
	ТаблицаИстории.Колонки.Добавить("ИдентификаторНоменклатуры", ТипСтрока100);
	
	Для каждого НоменклатураКонтрагента Из НаборНоменклатурыКонтрагентов Цикл
		Если ТипЗнч(НоменклатураКонтрагента.ИсторияИдентификаторов) <> Тип("Массив") Тогда
			Продолжить;
		КонецЕсли;
		Для каждого Идентификатор Из НоменклатураКонтрагента.ИсторияИдентификаторов Цикл
			СтрокаИстории = ТаблицаИстории.Добавить();
			СтрокаИстории.Владелец = НоменклатураКонтрагента.Владелец;
			СтрокаИстории.Идентификатор = Идентификатор;
			СтрокаИстории.НовыйИдентификатор = НоменклатураКонтрагента.Идентификатор;
			СтрокаИстории.ИдентификаторНоменклатуры = НоменклатураКонтрагента.ИдентификаторНоменклатуры;
		КонецЦикла;
	КонецЦикла;
	Если Не ЗначениеЗаполнено(ТаблицаИстории) Тогда
		Возврат НаборНоменклатурыКонтрагентов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаИстории.Владелец КАК Владелец,
	|	ТаблицаИстории.Идентификатор КАК Идентификатор,
	|	ТаблицаИстории.НовыйИдентификатор КАК НовыйИдентификатор,
	|	ТаблицаИстории.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры
	|ПОМЕСТИТЬ втИстория
	|ИЗ
	|	&ТаблицаИстории КАК ТаблицаИстории
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИстория.Владелец КАК Владелец,
	|	втИстория.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры
	|ПОМЕСТИТЬ втИсторияОтбор
	|ИЗ
	|	втИстория КАК втИстория
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураКонтрагентовБЭД КАК НоменклатураКонтрагентовБЭД
	|		ПО втИстория.Владелец = НоменклатураКонтрагентовБЭД.Владелец
	|			И втИстория.ИдентификаторНоменклатуры = НоменклатураКонтрагентовБЭД.ИдентификаторНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	втИстория.Владелец,
	|	втИстория.ИдентификаторНоменклатуры
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НоменклатураКонтрагентовБЭД.Идентификатор) <= 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИстория.Владелец КАК Владелец,
	|	втИстория.Идентификатор КАК Идентификатор,
	|	втИстория.НовыйИдентификатор КАК НовыйИдентификатор
	|ПОМЕСТИТЬ втКопировать
	|ИЗ
	|	втИстория КАК втИстория
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втИсторияОтбор КАК втИсторияОтбор
	|		ПО втИстория.Владелец = втИсторияОтбор.Владелец
	|			И втИстория.ИдентификаторНоменклатуры = втИсторияОтбор.ИдентификаторНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураКонтрагентовБЭД.Владелец КАК Владелец,
	|	НоменклатураКонтрагентовБЭД.Номенклатура КАК Номенклатура,
	|	НоменклатураКонтрагентовБЭД.Характеристика КАК Характеристика,
	|	НоменклатураКонтрагентовБЭД.Упаковка КАК Упаковка,
	|	втКопировать.НовыйИдентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.НоменклатураКонтрагентовБЭД КАК НоменклатураКонтрагентовБЭД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКопировать КАК втКопировать
	|		ПО НоменклатураКонтрагентовБЭД.Владелец = втКопировать.Владелец
	|			И НоменклатураКонтрагентовБЭД.Идентификатор = втКопировать.Идентификатор
	|ГДЕ
	|	НоменклатураКонтрагентовБЭД.Номенклатура <> &ПустаяНоменклатура";
	Запрос.УстановитьПараметр("ТаблицаИстории", ТаблицаИстории);
	Запрос.УстановитьПараметр("ПустаяНоменклатура", Метаданные.ОпределяемыеТипы.НоменклатураБЭД.Тип.ПривестиЗначение());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Сопоставлено = Новый ТаблицаЗначений;
	Сопоставлено.Колонки.Добавить("Владелец", Метаданные.ОпределяемыеТипы.ВладелецНоменклатурыБЭД.Тип);
	Сопоставлено.Колонки.Добавить("Идентификатор", ТипСтрока300);
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		Попытка
			
			Набор = РегистрыСведений.НоменклатураКонтрагентовБЭД.СоздатьНаборЗаписей();
			Набор.Отбор.Владелец.Установить(Выборка.Владелец);
			Набор.Отбор.Идентификатор.Установить(Выборка.Идентификатор);
			ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(Набор);
			
			Набор.Прочитать();
			
			Если Не ЗначениеЗаполнено(Набор) Тогда
				
				Записать = Ложь;
				Запись = Набор.Добавить();
				Для каждого НоменклатураКонтрагента Из НаборНоменклатурыКонтрагентов Цикл
					Если НоменклатураКонтрагента.Владелец = Выборка.Владелец
						И НоменклатураКонтрагента.Идентификатор = Выборка.Идентификатор Тогда
						ЗаполнитьЗначенияСвойств(Запись, НоменклатураКонтрагента);
						ЗаполнитьЗначенияСвойств(Запись, Выборка);
						Записать = Истина;
					КонецЕсли;
				КонецЦикла;
				СопоставлениеНоменклатурыКонтрагентовКлиентСервер.РазделитьИдентификаторНаЧасти(Запись.Идентификатор, Запись);
				Если Записать Тогда
					Набор.Записать();
				КонецЕсли;
				
				СтрокаСопоставления = Сопоставлено.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСопоставления, Запись);
				
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Сопоставлено) Тогда
		Возврат НаборНоменклатурыКонтрагентов;
	КонецЕсли;
	
	Сопоставлено.Индексы.Добавить("Владелец,Идентификатор");
	
	НеСопоставлено = Новый Массив;
	Для каждого НоменклатураКонтрагентов Из НаборНоменклатурыКонтрагентов Цикл
		
		ОтборСтрок = Новый Структура("Владелец,Идентификатор");
		ЗаполнитьЗначенияСвойств(ОтборСтрок, НоменклатураКонтрагентов);
		НайденныеСтроки = Сопоставлено.НайтиСтроки(ОтборСтрок);
		Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
			НеСопоставлено.Добавить(НоменклатураКонтрагентов);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НеСопоставлено;
	
КонецФункции

Процедура НормализоватьДанныеСопоставления(Сопоставление)
	
	Для каждого КлючЗначение Из Сопоставление Цикл
		Если ТипЗнч(КлючЗначение.Значение) = Тип("Строка") Тогда
			Сопоставление.Вставить(КлючЗначение.Ключ, СокрЛП(КлючЗначение.Значение));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область КонтрольПроведения

// Выполняет проверку электронного документа на наличие непроведенных учетных документов.
// Непроведенные документы ставится на контроль.
//
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - электронный документ на проверку.
//
Процедура ВыполнитьКонтрольПроведенияУчетныхДокументов(Знач ЭлектронныйДокумент)
	
	ОтключитьКонтрольПроведенияУчетныхДокументовЭД(ЭлектронныйДокумент);
	
	ОбъектыУчетаЭлектронныхДокументов = ОбъектыУчетаЭлектронныхДокументов(ЭлектронныйДокумент);
	НаборУчетныхДокументов = ОбъектыУчетаЭлектронныхДокументов.ВыгрузитьКолонку("ОбъектУчета");
	 
	НаКонтроль = Новый Массив;
	
	Для Каждого УчетныйДокумент Из НаборУчетныхДокументов Цикл
		
		Если ОбщегоНазначенияБЭД.ЭтоПроводимыйДокумент(УчетныйДокумент) Тогда
			Проведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетныйДокумент, "Проведен");
			Если Не Проведен Тогда
				НаКонтроль.Добавить(УчетныйДокумент);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ВключитьКонтрольПроведенияУчетныхДокументов(ЭлектронныйДокумент, НаКонтроль);
	
КонецПроцедуры

// Ставит электронный документ на контроль проведения связанных с ним учетных документов.
//
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - электронный документ, который ставится на контроль.
//  НаборУчетныхДокументов - Массив - учетные документы, проведение которых нужно контролировать.
//
Процедура ВключитьКонтрольПроведенияУчетныхДокументов(Знач ЭлектронныйДокумент, Знач НаборУчетныхДокументов)
	
	Если ТипЗнч(НаборУчетныхДокументов) <> Тип("Массив") Тогда
		НаборУчетныхДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НаборУчетныхДокументов);
	КонецЕсли;
	
	Для Каждого УчетныйДокумент Из НаборУчетныхДокументов Цикл
		
		Набор = РегистрыСведений.КонтрольПроведенияУчетныхДокументовЭДО.СоздатьНаборЗаписей();
		Набор.Отбор.ЭлектронныйДокумент.Установить(ЭлектронныйДокумент);
		Набор.Отбор.УчетныйДокумент.Установить(УчетныйДокумент);
		
		Запись = Набор.Добавить();
		Запись.ЭлектронныйДокумент = ЭлектронныйДокумент;
		Запись.УчетныйДокумент = УчетныйДокумент;
		
		Набор.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Прекращает контроль проведения учетных документов для электронного документа.
//
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - Электронный документ, который снимается с контроля.
//
Процедура ОтключитьКонтрольПроведенияУчетныхДокументовЭД(Знач ЭлектронныйДокумент)
	
	Набор = РегистрыСведений.КонтрольПроведенияУчетныхДокументовЭДО.СоздатьНаборЗаписей();
	Набор.Отбор.ЭлектронныйДокумент.Установить(ЭлектронныйДокумент);
	
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область КонтрольОтраженияВУчете

// Возвращает необходимость контроля отражения в учете электронного документа.
//
// Параметры:
//  Параметры - Массив из см. ИнтеграцияЭДОКлиентСервер.НовыеДанныеЭлектронногоДокументаДляОтраженияВУчете() - набор параметров отражения в учете.
//
// Возвращаемое значение:
//  Булево, Соответствие - признак того, что электронный документ требует контроля отражения в учете.
//                         Если был передан массив электронных документов, то возвращается соответствие
//                         с электронными документами в ключах и признаком необходимости контроля в значениях.
//
Функция ТребуетсяКонтрольОтраженияВУчете(Параметры)
	
	СостоянияПрерывания = Новый Массив;
	СостоянияПрерывания.Добавить(Перечисления.СостоянияДокументовЭДО.ЗакрытСОтклонением);
	СостоянияПрерывания.Добавить(Перечисления.СостоянияДокументовЭДО.Аннулирован);
	СостоянияПрерывания.Добавить(Перечисления.СостоянияДокументовЭДО.НеСформирован);
	СостоянияПрерывания.Добавить(Перечисления.СостоянияДокументовЭДО.ЗакрытПринудительно);
	
	ОтражаемыеВУчетеТипыЭД = Новый Массив;
	ИспользуемыеТипыДокументов = ИспользуемыеТипыДокументов();
	Для Каждого ОписаниеТипаДокумента Из ИспользуемыеТипыДокументов Цикл
		Если ОписаниеТипаДокумента.Значение.ИспользоватьДляВходящих Тогда
			ОтражаемыеВУчетеТипыЭД.Добавить(ОписаниеТипаДокумента.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.КоммерческиеПредложения") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("КоммерческиеПредложенияСлужебный");
		МодульПодсистемы.ОтключитьКонтрольОтраженияВУчетеДокументовПодсистемы(ОтражаемыеВУчетеТипыЭД);
	КонецЕсли;	
	
	Результат = Новый Соответствие;
	Для каждого СтрокаПараметров Из Параметры Цикл
		ТипДокумента = СтрокаПараметров.ТипДокумента;

		ВозможноОтразитьВУчете = СтрокаПараметров.Направление =  Перечисления.НаправленияЭДО.Входящий 
				И ОтражаемыеВУчетеТипыЭД.Найти(ТипДокумента) <> Неопределено;
		ТребуетсяКонтроль = (СостоянияПрерывания.Найти(СтрокаПараметров.СостояниеДокумента) = Неопределено)
				И ВозможноОтразитьВУчете
				И Не СтрокаПараметров.ОтключитьКонтрольОтраженияВУчете И Не ОтключенКонтрольОтраженияВУчетеВНастройках(СтрокаПараметров);
		Результат.Вставить(СтрокаПараметров.ЭлектронныйДокумент, ТребуетсяКонтроль);
	КонецЦикла;
	
	Возврат Результат;	
	
КонецФункции

Функция ОтключенКонтрольОтраженияВУчетеВНастройках(ДанныеЭлектронногоДокумента) Экспорт
	
	СпособОбработки = СпособОтраженияВУчетеЭлектронногоДокумента(ДанныеЭлектронногоДокумента);
			
	Если ТипЗнч(СпособОбработки) = Тип("Структура") Тогда
		Возврат СпособОбработки.ПервичныйДокумент = СпособОбработки_НеОтражать() И
			СпособОбработки.СчетФактура = СпособОбработки_НеОтражать();
	КонецЕсли;
			
	Возврат СпособОбработки = СпособОбработки_НеОтражать();
	
КонецФункции

Функция СпособОтраженияВУчетеЭлектронногоДокумента(Знач ДанныеДокумента) Экспорт
		
	КлючНастроекОтраженияВУчете = НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтраженияВУчете();
	КлючНастроекОтраженияВУчете.ВидДокумента = ДанныеДокумента.ВидДокумента;
	КлючНастроекОтраженияВУчете.Отправитель = ДанныеДокумента.Отправитель;
	КлючНастроекОтраженияВУчете.Получатель = ДанныеДокумента.Получатель;
	КлючНастроекОтраженияВУчете.ИдентификаторОтправителя = ДанныеДокумента.ИдентификаторОтправителя;
	КлючНастроекОтраженияВУчете.ИдентификаторПолучателя = ДанныеДокумента.ИдентификаторПолучателя;
		
	ДополнительныеВиды = Новый Массив;
		
	Если ДанныеДокумента.ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(Перечисления.ТипыДокументовЭДО.УПД) Тогда
		КлючНастроекОтраженияВУчете.ВидДокумента =  ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(Перечисления.ТипыДокументовЭДО.СчетФактура);
		ДополнительныеВиды = ЭлектронныеДокументыЭДО.ДополнительныеВидыДокументовУПД(ДанныеДокумента.ДанныеОсновногоФайла);	
		
	ИначеЕсли ДанныеДокумента.ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(Перечисления.ТипыДокументовЭДО.УКД) Тогда
		КлючНастроекОтраженияВУчете.ВидДокумента =  ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура);
		ДополнительныеВиды.Добавить(ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости));	
	
	КонецЕсли;
	
	СпособОбработки = НастройкиЭДО.НастройкиОтраженияВУчете(КлючНастроекОтраженияВУчете).СпособОбработки;
	
	Если ЗначениеЗаполнено(ДополнительныеВиды) Тогда
		
		СпособОбработкиДополнительногоВида = СпособОбработки_Вручную();
		
		Если ДополнительныеВиды.Количество() = 1 Тогда
			КлючНастроекОтраженияВУчете.ВидДокумента = ДополнительныеВиды[0];		
			СпособОбработкиДополнительногоВида = НастройкиЭДО.НастройкиОтраженияВУчете(КлючНастроекОтраженияВУчете).СпособОбработки;	
		КонецЕсли;
		
		СпособОбработкиСтруктура = Новый Структура("ПервичныйДокумент, СчетФактура");
		СпособОбработкиСтруктура.ПервичныйДокумент = СпособОбработкиДополнительногоВида;
		СпособОбработкиСтруктура.СчетФактура  = СпособОбработки;
		
		СпособОбработки = СпособОбработкиСтруктура;
	КонецЕсли;
							
	Возврат СпособОбработки;
	
КонецФункции

// Выполняет проверку на соответствие электронных документов требованиям по отражению в учете.
//
// Параметры:
//  НаборЭлектронныхДокументов - Массив - электронные документы (ДокументСсылка.ЭлектронныйДокументВходящий), 
//                                        по которым нужно выполнить проверку.
//  НаборПроверок - Массив, Неопределено - перечень проверок (строка), которые нужно выполнить:
//   * "СопоставитьНоменклатуру" - проверка на завершение сопоставления номенклатуры.
//   * "СоздатьУчетныйДокумент" - проверка на наличие учетного документа.
//   * "ПровестиУчетныйДокумент" - проверка на проведенность учетного документа.
//
Процедура ВыполнитьКонтрольОтраженияВУчете(Знач НаборЭлектронныхДокументов, Знач НаборПроверок = Неопределено)
	
	// Подготовка параметров.
	
	Если Не ЗначениеЗаполнено(НаборЭлектронныхДокументов) Тогда
		Возврат;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(НаборПроверок) Тогда
		НаборПроверок = Новый Массив;
		НаборПроверок.Добавить("СопоставитьНоменклатуру");
		НаборПроверок.Добавить("СоздатьУчетныйДокумент");
		НаборПроверок.Добавить("ПровестиУчетныйДокумент");
	КонецЕсли;
	Если ТипЗнч(НаборПроверок) = Тип("Строка") Тогда
		НаборПроверок = СтрРазделить(НаборПроверок, ",");
	КонецЕсли;
	
	// Сбор текста запроса для выполнения контроля.
	
	КонтрольСоответствие = Новый Соответствие;
	ИндексЗапроса = 0;
	ЧастиЗапроса = Новый Массив;
	
	Для Каждого Проверка Из НаборПроверок Цикл
		
		ТекстЗапроса = "";
		
		Если Проверка = "СопоставитьНоменклатуру" Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	КонтрольСопоставления.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
			|	ИСТИНА КАК СопоставитьНоменклатуру
			|ИЗ
			|	РегистрСведений.КонтрольСопоставленияНоменклатурыЭДО КАК КонтрольСопоставления
			|ГДЕ
			|	КонтрольСопоставления.ЭлектронныйДокумент В(&НаборЭлектронныхДокументов)";
			
		ИначеЕсли Проверка = "СоздатьУчетныйДокумент" Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	КонтрольСоздания.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
			|	КонтрольСоздания.ОбъектУчета КАК УчетныйДокумент
			|ИЗ
			|	РегистрСведений.ОбъектыУчетаДокументовЭДО КАК КонтрольСоздания
			|ГДЕ
			|	КонтрольСоздания.ЭлектронныйДокумент В(&НаборЭлектронныхДокументов)";
			
		ИначеЕсли Проверка = "ПровестиУчетныйДокумент" Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	КонтрольПроведения.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
			|	ИСТИНА КАК ПровестиУчетныйДокумент
			|ИЗ
			|	РегистрСведений.КонтрольПроведенияУчетныхДокументовЭДО КАК КонтрольПроведения
			|ГДЕ
			|	КонтрольПроведения.ЭлектронныйДокумент В(&НаборЭлектронныхДокументов)";
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
			Продолжить;
		КонецЕсли;
		
		КонтрольСоответствие.Вставить(Проверка, ИндексЗапроса);
		
		Если ЗначениеЗаполнено(ЧастиЗапроса) Тогда
			Разделитель =
			"
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|";
			ЧастиЗапроса.Добавить(Разделитель);
		КонецЕсли;
		ЧастиЗапроса.Добавить(ТекстЗапроса);
		
		ИндексЗапроса = ИндексЗапроса + 1
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(ЧастиЗапроса);
	Запрос.УстановитьПараметр("НаборЭлектронныхДокументов", НаборЭлектронныхДокументов);
	
	// Анализ результата запроса.
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ТаблицыПроверок = Новый Массив;
	Для Каждого Результат Из РезультатыЗапроса Цикл
		Таблица = Результат.Выгрузить();
		Таблица.Индексы.Добавить("ЭлектронныйДокумент");
		ТаблицыПроверок.Добавить(Таблица);
	КонецЦикла;
	
	Для Каждого ЭлектронныйДокумент Из НаборЭлектронныхДокументов Цикл
		
		ОтборЭД = Новый Структура("ЭлектронныйДокумент", ЭлектронныйДокумент);
		
		Изменения = Новый Структура;
		
		Для Каждого Элемент Из КонтрольСоответствие Цикл
			
			Проверка = Элемент.Ключ;
			Таблица = ТаблицыПроверок[Элемент.Значение];
			
			Если Проверка = "СопоставитьНоменклатуру" Тогда
				
				НайденныеСтроки = Таблица.НайтиСтроки(ОтборЭД);
				СопоставитьНоменклатуру = ЗначениеЗаполнено(НайденныеСтроки);
				Изменения.Вставить("СопоставитьНоменклатуру", СопоставитьНоменклатуру);
				
			ИначеЕсли Проверка = "СоздатьУчетныйДокумент" Тогда
				
				НайденныеСтроки = Таблица.НайтиСтроки(ОтборЭД);
				СоздатьУчетныйДокумент = Не ЗначениеЗаполнено(НайденныеСтроки);
				Изменения.Вставить("СоздатьУчетныйДокумент", СоздатьУчетныйДокумент);
				
			ИначеЕсли Проверка = "ПровестиУчетныйДокумент" Тогда
				
				НайденныеСтроки = Таблица.НайтиСтроки(ОтборЭД);
				ПровестиУчетныйДокумент = ЗначениеЗаполнено(НайденныеСтроки);
				Изменения.Вставить("ПровестиУчетныйДокумент", ПровестиУчетныйДокумент)
				
			КонецЕсли;
			
		КонецЦикла;
		
		ИзменитьКонтрольОтраженияВУчете(ЭлектронныйДокумент, Изменения);
		
	КонецЦикла;
	
КонецПроцедуры

// Изменяет наличие контроля отражения в учете по электронному документу.
//
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящий - электронный документ, по которому изменяются данные.
//  НаборИзменений - Структура - перечень изменений. 
//   * Ключ - требование.
//    ** СопоставитьНоменклатуру - проверка на завершение сопоставления номенклатуры.
//    ** СоздатьУчетныйДокумент - проверка на наличие учетного документа.
//    ** ПровестиУчетныйДокумент - проверка на проведенность учетного документа.
//   * Значение - Булево - признак нахождения документа на контроле по данному требованию. 
//                         Т.е. если Истина, то документ еще НЕ соответствует требованию.
//
Процедура ИзменитьКонтрольОтраженияВУчете(Знач ЭлектронныйДокумент, Знач НаборИзменений)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();

	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.КонтрольОтраженияВУчетеЭДО");
		ЭлементБлокировки.УстановитьЗначение("ЭлектронныйДокумент", ЭлектронныйДокумент);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		Набор = РегистрыСведений.КонтрольОтраженияВУчетеЭДО.СоздатьНаборЗаписей();
		Набор.Отбор.ЭлектронныйДокумент.Установить(ЭлектронныйДокумент);
		Набор.Прочитать();
		
		Если Набор.Количество() = 0 Тогда
			Запись = Набор.Добавить();
			Запись.ЭлектронныйДокумент = ЭлектронныйДокумент;
		КонецЕсли;
		
		Записать = Ложь;
		Для Каждого Запись Из Набор Цикл
			
			Для Каждого Изменение Из НаборИзменений Цикл
				
				ТекущееЗначение = Запись[Изменение.Ключ];
				НовоеЗначение = Изменение.Значение;
				Если ТекущееЗначение <> НовоеЗначение Тогда
					Записать = Истина;
					Запись[Изменение.Ключ] = НовоеЗначение;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если Записать Тогда
			Набор.Записать();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#Область АктуальныеЭлектронныеДокументы

Процедура ЗапуститьПроверкуАктуальностиВнутреннегоЭД(ОбъектУчета, Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаблокироватьДанныеДляПроверкиАктуальностиЭД(ОбъектУчета, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.АктуальныеДокументыЭДО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектУчета.Установить(ОбъектУчета);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ТребуетсяПересчетАктуальности = Истина;
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
	ЗапуститьЗаданиеПересчетаАктуальности(ОбъектУчета);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ЗаблокироватьДанныеДляПроверкиАктуальностиЭД(ОбъектУчета, Отказ)
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.АктуальныеДокументыЭДО");
	ЭлементБлокировки.УстановитьЗначение("ОбъектУчета", ОбъектУчета);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Попытка
		БлокировкаДанных.Заблокировать();
	Исключение
		
		ТекстСообщения = НСтр("ru = 'Не удалось заблокировать сведения об актуальности ЭД: %ИнформацияОбОшибке%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИнформацияОбОшибке%", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗапуститьЗаданиеПересчетаАктуальности(ОбъектУчета)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОчередьЗаданийПересчетаАктуальностиПуста() Тогда
		Возврат;
	КонецЕсли;
	
	Ключ = "ПересчетАктуальностиЭлектронныхДокументов";
	
	КлючПоиска = Новый Структура("Ключ, Состояние", Ключ, СостояниеФоновогоЗадания.Активно);
	
	Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(КлючПоиска);
	Если Задания.Количество() <> 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЭкспортнойПроцедуры = "ИнтеграцияЭДО.ОбработатьОчередьЗаданий";
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ОбъектУчета", ОбъектУчета);
	
	ПараметрыЭкспортнойПроцедуры = Новый Массив;
	ПараметрыЭкспортнойПроцедуры.Добавить(ПараметрыЗаполнения);
	
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(ИмяЭкспортнойПроцедуры);
	ПараметрыЗадания.Добавить(ПараметрыЭкспортнойПроцедуры);   
	
	НаименованиеЗадания = НСтр("ru = 'Пересчет актуальности электронных документов'");
	
	ФоновыеЗадания.Выполнить("ОбщегоНазначения.ВыполнитьМетодКонфигурации", ПараметрыЗадания, Ключ, НаименованиеЗадания);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ОбработатьОчередьЗаданий(Параметры, АдресРезультата = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОжидатьЗавершениеЗаписиДанныхАктуальности(Параметры.ОбъектУчета);
	
	ДанныеКОбработке = ВыбратьДанныеДляАктуализацииЭД(Параметры.ОбъектУчета);
	
	Пока ЗначениеЗаполнено(ДанныеКОбработке) Цикл
		
		Замер = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(
				"ОбщийМодуль.ИнтеграцияЭДО.ЭлектронныйДокументАктуален"); 
		
		Для Каждого СтрокаДанных Из ДанныеКОбработке Цикл
			
			ЭлектронныйДокументАктуален = ЭлектронныеДокументыЭДО.ВнутреннийДокументАктуален(СтрокаДанных.ОбъектУчета, 
																		СтрокаДанных.ВидЭлектронногоДокумента, 
																		СтрокаДанных.ЭлектронныйДокумент);
																		
			НаборЗаписей = РегистрыСведений.АктуальныеДокументыЭДО.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ОбъектУчета.Установить(СтрокаДанных.ОбъектУчета);
			НаборЗаписей.Отбор.ВидЭлектронногоДокумента.Установить(СтрокаДанных.ВидЭлектронногоДокумента);
			НаборЗаписей.Прочитать();
			
			Если ЭлектронныйДокументАктуален Тогда
				Для Каждого Запись Из НаборЗаписей Цикл
					Запись.ТребуетсяПересчетАктуальности = Ложь;
				КонецЦикла;
				
				УстановитьПривилегированныйРежим(Истина);
				НаборЗаписей.Записать(Истина);
				УстановитьПривилегированныйРежим(Ложь);
				
			Иначе
				
				НаборЗаписей.Очистить();
				
				УстановитьПривилегированныйРежим(Истина);
				НаборЗаписей.Записать(Истина);
				УстановитьПривилегированныйРежим(Ложь);

				ПричинаЗакрытия = НСтр("ru='Закрыт автоматически при изменении учетного документа.'");
				ЭлектронныеДокументы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаДанных.ЭлектронныйДокумент);

				ПараметрыВыполненияДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
				ДополнительныеДанныеДействия = ЭлектронныеДокументыЭДОКлиентСервер.НовыеДополнительныеПараметрыДействия();
				ДополнительныеДанныеДействия.Комментарий = ПричинаЗакрытия;
				
				НаборДействий = Новый Соответствие;	
				ДополнительныеДанныеОбъектов = Новый Соответствие;
				ДополнительныеДанныеОбъектов.Вставить(СтрокаДанных.ЭлектронныйДокумент, ПричинаЗакрытия);
				ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
					"Перечисление.ДействияПоЭДО.ЗакрытьПринудительно"));
				ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;
				ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ЭлектронныеДокументы = ЭлектронныеДокументы;
				ПараметрыВыполненияДействийПоЭДО.ДополнительныеПараметрыДействий.Вставить(ПредопределенноеЗначение(
					"Перечисление.ДействияПоЭДО.ЗакрытьПринудительно"), ДополнительныеДанныеДействия);
				
				ЭлектронныеДокументыЭДО.ВыполнитьДействияПоЭДО(ПараметрыВыполненияДействийПоЭДО);				
				
				ОчиститьАктуальностьЭлектронногоДокумента(СтрокаДанных.ЭлектронныйДокумент);	
				СброситьСостояниеЭлектронногоДокументаОбъектаУчета(СтрокаДанных.ОбъектУчета);
				
				Ответственный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДанных.ЭлектронныйДокумент, "Ответственный");
				ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ответственный, "ИдентификаторПользователяИБ");
				
				ПараметрыПредставления = ЭлектронныеДокументыЭДО.НовыеСвойстваПредставленияДокумента();
				
				//""""\
				ПараметрыПредставления.ВидДокумента = СтрокаДанных.ЭлектронныйДокумент.ВидДокумента;
				ПараметрыПредставления.НомерДокумента = СтрокаДанных.ЭлектронныйДокумент.НомерДокумента;
				ПараметрыПредставления.ДатаДокумента = СтрокаДанных.ЭлектронныйДокумент.ДатаДокумента;
				
				ТекстСообщения = НСтр("ru = 'Электронный документ потерял актуальность'");
				Действия = Новый СписокЗначений;
				Действия.Добавить("ОткрытьЭД", "" + ЭлектронныеДокументыЭДО.ПредставлениеДокументаПоСвойствам(ПараметрыПредставления));
				Данные = ПолучитьНавигационнуюСсылку(СтрокаДанных.ЭлектронныйДокумент);
				
				Попытка
					ОповещенияОСобытияхЭДО.ОтправитьСообщениеСистемыВзаимодействия(ИдентификаторПользователяИБ, ТекстСообщения, Действия, Данные);
				Исключение
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка сообщения системы взаимодействия'", ОбщегоНазначения.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(Замер, ДанныеКОбработке.Количество());
		
		ДанныеКОбработке = ВыбратьДанныеДляАктуализацииЭД();
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ОчередьЗаданийПересчетаАктуальностиПуста()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	РегистрСведений.АктуальныеДокументыЭДО КАК АктуальныеДокументыЭДО
	|ГДЕ
	|	АктуальныеДокументыЭДО.ТребуетсяПересчетАктуальности = ИСТИНА");
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура ОжидатьЗавершениеЗаписиДанныхАктуальности(ОбъектУчета)
	
	Если ЗначениеЗаполнено(ОбъектУчета) Тогда
		
		НачатьТранзакцию();
		Попытка
			
			ОбъектМетаданных = "РегистрСведений.АктуальныеДокументыЭДО";
			
			БлокировкаДанных = Новый БлокировкаДанных;
			
			Если ТипЗнч(ОбъектУчета) <> Тип("Массив") Тогда
				БлокировкаДанных.Добавить(ОбъектМетаданных).УстановитьЗначение("ОбъектУчета", ОбъектУчета);
			Иначе
				Для Каждого ЭлементБлокировки Из ОбъектУчета Цикл
					БлокировкаДанных.Добавить(ОбъектМетаданных).УстановитьЗначение("ОбъектУчета", ЭлементБлокировки);
				КонецЦикла;
			КонецЕсли;
			
			БлокировкаДанных.Заблокировать();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Пересчет актуальности электронных документов'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.РегистрыСведений.АктуальныеДокументыЭДО,
				,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВыбратьДанныеДляАктуализацииЭД(ОбъектУчета = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АктуальныеДокументыЭДО.ОбъектУчета КАК ОбъектУчета,
		|	АктуальныеДокументыЭДО.ВидЭлектронногоДокумента КАК ВидЭлектронногоДокумента,
		|	АктуальныеДокументыЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент
		|ИЗ
		|	РегистрСведений.АктуальныеДокументыЭДО КАК АктуальныеДокументыЭДО
		|ГДЕ
		|	АктуальныеДокументыЭДО.ТребуетсяПересчетАктуальности = ИСТИНА";
	
	Если ЗначениеЗаполнено(ОбъектУчета) Тогда
		Запрос.Текст = Запрос.Текст + " И АктуальныеДокументыЭДО.ОбъектУчета = &ОбъектУчета";
		Запрос.Параметры.Вставить("ОбъектУчета", ОбъектУчета); 
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

#КонецОбласти

#КонецОбласти
