
#Область СлужебныеПроцедурыИФункции

Функция ДанныеКонтактнойИнформацииПоПредставлению(Знач Представление, Знач ОжидаемыйТипВид) Экспорт
	
	Данные = Новый Структура;
	Данные.Вставить("Значение", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Представление, ОжидаемыйТипВид));
	Данные.Вставить("ПараметрыВида", УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(ОжидаемыйТипВид));
	
	Возврат Данные;
	
КонецФункции

Функция СвойстваСертификата(АдресДанныхСертификата) Экспорт
	
	ДвоичныеДанныеСертификата = ПолучитьИзВременногоХранилища(АдресДанныхСертификата);
	
	ВыбранныйСертификат = Новый СертификатКриптографии(ДвоичныеДанныеСертификата);
	Если ВыбранныйСертификат=Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураСертификата = ЭлектроннаяПодпись.СвойстваСертификата(ВыбранныйСертификат);
	
	Возврат СтруктураСертификата;
	
КонецФункции

#КонецОбласти