#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ПолучитьТаблицуПримененияФорматов() Экспорт 
	Результат = Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюТаблицуПримененияФорматов();
	
	Стр = Результат.Добавить();
	Стр.ИмяФормы = "Форма2020_1";
	Стр.КНД = "1125315";
	Стр.ВерсияФормата = "5.02";
	
	Возврат Результат;
КонецФункции

Функция ДанноеУведомлениеДоступноДляОрганизации() Экспорт 
	Возврат Истина;
КонецФункции

Функция ДанноеУведомлениеДоступноДляИП() Экспорт 
	Возврат Ложь;
КонецФункции

Функция ПолучитьОсновнуюФорму() Экспорт 
	Возврат "";
КонецФункции

Функция ПолучитьФормуПоУмолчанию() Экспорт 
	Возврат "";
КонецФункции

Функция ПолучитьТаблицуФорм() Экспорт 
	Результат = Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюТаблицуФормУведомления();
	
	Стр = Результат.Добавить();
	Стр.ИмяФормы = "Форма2020_1";
	Стр.ОписаниеФормы = "Форма информации об организации системы внутреннего контроля";
	Стр.ДатаНачала = '20201001';
	Стр.ДатаКонца = '20991231';
	
	Возврат Результат;
КонецФункции

Функция ЭлектронноеПредставление(Объект, ИмяФормы, УникальныйИдентификатор) Экспорт
	Если ИмяФормы = "Форма2020_1" Тогда
		Возврат ЭлектронноеПредставление_Форма2020_1(Объект, УникальныйИдентификатор);
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ПроверитьДокумент(Объект, ИмяФормы, УникальныйИдентификатор) Экспорт
	Если ИмяФормы = "Форма2020_1" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Электронный формат для данной формы не опубликован'"));
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция СформироватьСписокЛистов(Объект) Экспорт
	Если Объект.ИмяФормы = "Форма2020_1" Тогда 
		Возврат СформироватьСписокЛистовФорма2020_1(Объект);
	КонецЕсли;
КонецФункции

Функция ПроверитьДокументСВыводомВТаблицу(Объект, ИмяФормы, УникальныйИдентификатор) Экспорт 
	Если ИмяФормы = "Форма2020_1" Тогда 
		Данные = Объект.ДанныеУведомления.Получить();
		Данные.Вставить("Организация", Объект.Организация);
		Данные.Вставить("ПодписантФамилия", Объект.ПодписантФамилия);
		Данные.Вставить("ПодписантИмя", Объект.ПодписантИмя);
		Данные.Вставить("Организация", Объект.Организация);
		Возврат ПроверитьДокументСВыводомВТаблицу_Форма2020_1(Данные, УникальныйИдентификатор);
	КонецЕсли;
КонецФункции

Функция ИдентификаторФайлаЭлектронногоПредставления_Форма2020_1(СведенияОтправки)
	Префикс = "ON_SRSVKNALMON";
	Возврат Документы.УведомлениеОСпецрежимахНалогообложения.ИдентификаторФайлаЭлектронногоПредставления(Префикс, СведенияОтправки);
КонецФункции

Процедура Проверить_КонтрСреда(КонтрСреда, ТаблицаОшибок)

	Если КонтрСреда["ПрофСтдНаличДок"] <> "0" И КонтрСреда["ПрофСтдНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Профессиональные стандарты)"
				, "КонтрСреда", "ПрофСтдНаличДок"));
	ИначеЕсли КонтрСреда["ПрофСтдНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(КонтрСреда["ПрофСтдНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Профессиональные стандарты)"
				, "КонтрСреда", "ПрофСтдНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["ПрофСтдДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Профессиональные стандарты)"
				, "КонтрСреда", "ПрофСтдДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["ПрофСтдНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Профессиональные стандарты)"
				, "КонтрСреда", "ПрофСтдНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если КонтрСреда["ЭтичСтдНаличДок"] <> "0" И КонтрСреда["ЭтичСтдНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Этнические стандарты)"
				, "КонтрСреда", "ЭтичСтдНаличДок"));
	ИначеЕсли КонтрСреда["ЭтичСтдНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(КонтрСреда["ЭтичСтдНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Этнические стандарты)"
				, "КонтрСреда", "ЭтичСтдНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["ЭтичСтдДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Этнические стандарты)"
				, "КонтрСреда", "ЭтичСтдДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["ЭтичСтдНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Этнические стандарты)"
				, "КонтрСреда", "ЭтичСтдНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если КонтрСреда["ПоведСтдНаличДок"] <> "0" И КонтрСреда["ПоведСтдНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Поведенческие стандарты)"
				, "КонтрСреда", "ПоведСтдНаличДок"));
	ИначеЕсли КонтрСреда["ПоведСтдНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(КонтрСреда["ПоведСтдНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Поведенческие стандарты)"
				, "КонтрСреда", "ПоведСтдНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["ПоведСтдДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Поведенческие стандарты)"
				, "КонтрСреда", "ПоведСтдДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["ПоведСтдНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Поведенческие стандарты)"
				, "КонтрСреда", "ПоведСтдНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если КонтрСреда["СтдНаймНаличДок"] <> "0" И КонтрСреда["СтдНаймНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Стандарт найма)"
				, "КонтрСреда", "СтдНаймНаличДок"));
	ИначеЕсли КонтрСреда["СтдНаймНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(КонтрСреда["СтдНаймНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Стандарт найма)"
				, "КонтрСреда", "СтдНаймНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["СтдНаймДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Стандарт найма)"
				, "КонтрСреда", "СтдНаймДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["СтдНаймНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Стандарт найма)"
				, "КонтрСреда", "СтдНаймНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если КонтрСреда["СтдМотивНаличДок"] <> "0" И КонтрСреда["СтдМотивНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Стандарт мотивации)"
				, "КонтрСреда", "СтдМотивНаличДок"));
	ИначеЕсли КонтрСреда["СтдМотивНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(КонтрСреда["СтдМотивНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Стандарт мотивации)"
				, "КонтрСреда", "СтдМотивНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["СтдМотивДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Стандарт мотивации)"
				, "КонтрСреда", "СтдМотивДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["СтдМотивНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Стандарт мотивации)"
				, "КонтрСреда", "СтдМотивНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если КонтрСреда["СтдОценНаличДок"] <> "0" И КонтрСреда["СтдОценНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Стандарт оценки)"
				, "КонтрСреда", "СтдОценНаличДок"));
	ИначеЕсли КонтрСреда["СтдОценНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(КонтрСреда["СтдОценНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Стандарт оценки)"
				, "КонтрСреда", "СтдОценНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["СтдОценДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Стандарт оценки)"
				, "КонтрСреда", "СтдОценДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["СтдОценНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Стандарт оценки)"
				, "КонтрСреда", "СтдОценНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если КонтрСреда["СтдПродвНаличДок"] <> "0" И КонтрСреда["СтдПродвНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Стандарт продвижения)"
				, "КонтрСреда", "СтдПродвНаличДок"));
	ИначеЕсли КонтрСреда["СтдПродвНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(КонтрСреда["СтдПродвНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Стандарт продвижения)"
				, "КонтрСреда", "СтдПродвНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["СтдПродвДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Стандарт продвижения)"
				, "КонтрСреда", "СтдПродвДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["СтдПродвНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Стандарт продвижения)"
				, "КонтрСреда", "СтдПродвНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если КонтрСреда["СтдУволНаличДок"] <> "0" И КонтрСреда["СтдУволНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Стандарт увольнения)"
				, "КонтрСреда", "СтдУволНаличДок"));
	ИначеЕсли КонтрСреда["СтдУволНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(КонтрСреда["СтдУволНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Стандарт увольнения)"
				, "КонтрСреда", "СтдУволНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["СтдУволДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Стандарт увольнения)"
				, "КонтрСреда", "СтдУволДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["СтдУволНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Стандарт увольнения)"
				, "КонтрСреда", "СтдУволНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если КонтрСреда["ОбразСотрНаличДок"] <> "0" И КонтрСреда["ОбразСотрНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Образование сотрудников)"
				, "КонтрСреда", "ОбразСотрНаличДок"));
	ИначеЕсли КонтрСреда["ОбразСотрНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(КонтрСреда["ОбразСотрНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Образование сотрудников)"
				, "КонтрСреда", "ОбразСотрНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["ОбразСотрДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Образование сотрудников)"
				, "КонтрСреда", "ОбразСотрДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["ОбразСотрНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Образование сотрудников)"
				, "КонтрСреда", "ОбразСотрНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если КонтрСреда["ОпытРабНаличДок"] <> "0" И КонтрСреда["ОпытРабНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Опыт работы)"
				, "КонтрСреда", "ОпытРабНаличДок"));
	ИначеЕсли КонтрСреда["ОпытРабНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(КонтрСреда["ОпытРабНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Опыт работы)"
				, "КонтрСреда", "ОпытРабНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["ОпытРабДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Опыт работы)"
				, "КонтрСреда", "ОпытРабДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["ОпытРабНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Опыт работы)"
				, "КонтрСреда", "ОпытРабНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если КонтрСреда["ДостиженНаличДок"] <> "0" И КонтрСреда["ДостиженНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Достижения)"
				, "КонтрСреда", "ДостиженНаличДок"));
	ИначеЕсли КонтрСреда["ДостиженНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(КонтрСреда["ДостиженНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Достижения)"
				, "КонтрСреда", "ДостиженНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["ДостиженДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Достижения)"
				, "КонтрСреда", "ДостиженДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["ДостиженНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Достижения)"
				, "КонтрСреда", "ДостиженНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если КонтрСреда["ДобросовНаличДок"] <> "0" И КонтрСреда["ДобросовНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Добросовестность)"
				, "КонтрСреда", "ДобросовНаличДок"));
	ИначеЕсли КонтрСреда["ДобросовНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(КонтрСреда["ДобросовНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Добросовестность)"
				, "КонтрСреда", "ДобросовНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["ДобросовДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Добросовестность)"
				, "КонтрСреда", "ДобросовДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["ДобросовНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Добросовестность)"
				, "КонтрСреда", "ДобросовНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если КонтрСреда["ЭтПоведНаличДок"] <> "0" И КонтрСреда["ЭтПоведНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Этическое поведение)"
				, "КонтрСреда", "ЭтПоведНаличДок"));
	ИначеЕсли КонтрСреда["ЭтПоведНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(КонтрСреда["ЭтПоведНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Этическое поведение)"
				, "КонтрСреда", "ЭтПоведНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["ЭтПоведДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Этическое поведение)"
				, "КонтрСреда", "ЭтПоведДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["ЭтПоведНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Этическое поведение)"
				, "КонтрСреда", "ЭтПоведНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если КонтрСреда["ПрогрПодготНаличДок"] <> "0" И КонтрСреда["ПрогрПодготНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Наличие программ подготовки специалистов)"
				, "КонтрСреда", "ПрогрПодготНаличДок"));
	ИначеЕсли КонтрСреда["ПрогрПодготНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(КонтрСреда["ПрогрПодготНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Наличие программ подготовки специалистов)"
				, "КонтрСреда", "ПрогрПодготНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["ПрогрПодготДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Наличие программ подготовки специалистов)"
				, "КонтрСреда", "ПрогрПодготДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["ПрогрПодготНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Наличие программ подготовки специалистов)"
				, "КонтрСреда", "ПрогрПодготНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если КонтрСреда["УчастРукОценНаличДок"] <> "0" И КонтрСреда["УчастРукОценНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Участие руководителя в процессе оценки результатов функционирования СВК)"
				, "КонтрСреда", "УчастРукОценНаличДок"));
	ИначеЕсли КонтрСреда["УчастРукОценНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(КонтрСреда["УчастРукОценНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Участие руководителя в процессе оценки результатов функционирования СВК)"
				, "КонтрСреда", "УчастРукОценНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["УчастРукОценДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Участие руководителя в процессе оценки результатов функционирования СВК)"
				, "КонтрСреда", "УчастРукОценДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["УчастРукОценНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Участие руководителя в процессе оценки результатов функционирования СВК)"
				, "КонтрСреда", "УчастРукОценНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если КонтрСреда["УтвРезРукНаличДок"] <> "0" И КонтрСреда["УтвРезРукНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Закрепление за руководителем функций"
				+" рассмотрения и утверждения оценки результатов мониторинга и оценки СВК)"
				, "КонтрСреда", "УтвРезРукНаличДок"));
	ИначеЕсли КонтрСреда["УтвРезРукНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(КонтрСреда["УтвРезРукНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Закрепление за руководителем функций"
				+" рассмотрения и утверждения оценки результатов мониторинга и оценки СВК)"
				, "КонтрСреда", "УтвРезРукНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["УтвРезРукДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Закрепление за руководителем функций"
				+" рассмотрения и утверждения оценки результатов мониторинга и оценки СВК)"
				, "КонтрСреда", "УтвРезРукДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["УтвРезРукНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Закрепление за руководителем функций"
				+" рассмотрения и утверждения оценки результатов мониторинга и оценки СВК)"
				, "КонтрСреда", "УтвРезРукНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если КонтрСреда["УчетПолномНаличДок"] <> "0" И КонтрСреда["УчетПолномНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Распределение (разграничение) полномочий и обязанностей, закрепленное"
				+" в организационной структуре, реализующей надлежащий учет ключевых сфер полномочий,"
				+" обязанностей и определенного порядка подчиненности сотрудников)"
				, "КонтрСреда", "УчетПолномНаличДок"));
	ИначеЕсли КонтрСреда["УчетПолномНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(КонтрСреда["УчетПолномНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Распределение (разграничение) полномочий и обязанностей,"
				+" закрепленное в организационной структуре, реализующей надлежащий учет ключевых сфер полномочий,"
				+" обязанностей и определенного порядка подчиненности сотрудников)"
				, "КонтрСреда", "УчетПолномНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["УчетПолномДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Распределение (разграничение) полномочий и обязанностей,"
				+" закрепленное в организационной структуре, реализующей надлежащий учет ключевых сфер полномочий,"
				+" обязанностей и определенного порядка подчиненности сотрудников)"
				, "КонтрСреда", "УчетПолномДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонтрСреда["УчетПолномНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Распределение (разграничение) полномочий и обязанностей,"
				+" закрепленное в организационной структуре, реализующей надлежащий учет ключевых сфер полномочий,"
				+" обязанностей и определенного порядка подчиненности сотрудников)"
				, "КонтрСреда", "УчетПолномНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура Проверить_СистУпрРиск(СистУпрРиск, ТаблицаОшибок)

	Если СистУпрРиск["СтрУправРискНаличДок"] <> "0" И СистУпрРиск["СтрУправРискНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Стратегия управления рисками)"
				, "СистУпрРиск", "СтрУправРискНаличДок"));
	ИначеЕсли СистУпрРиск["СтрУправРискНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(СистУпрРиск["СтрУправРискНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Стратегия управления рисками)"
				, "СистУпрРиск", "СтрУправРискНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СистУпрРиск["СтрУправРискДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Стратегия управления рисками)"
				, "СистУпрРиск", "СтрУправРискДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СистУпрРиск["СтрУправРискНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Стратегия управления рисками)"
				, "СистУпрРиск", "СтрУправРискНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если СистУпрРиск["МатМетодНаличДок"] <> "0" И СистУпрРиск["МатМетодНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Математический метод)"
				, "СистУпрРиск", "МатМетодНаличДок"));
	ИначеЕсли СистУпрРиск["МатМетодНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(СистУпрРиск["МатМетодНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Математический метод)"
				, "СистУпрРиск", "МатМетодНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СистУпрРиск["МатМетодДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Математический метод)"
				, "СистУпрРиск", "МатМетодДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СистУпрРиск["МатМетодНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Математический метод)"
				, "СистУпрРиск", "МатМетодНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если СистУпрРиск["МетодЭкспОценНаличДок"] <> "0" И СистУпрРиск["МетодЭкспОценНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Метод экспертных оценок)"
				, "СистУпрРиск", "МетодЭкспОценНаличДок"));
	ИначеЕсли СистУпрРиск["МетодЭкспОценНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(СистУпрРиск["МетодЭкспОценНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Метод экспертных оценок)"
				, "СистУпрРиск", "МетодЭкспОценНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СистУпрРиск["МетодЭкспОценДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Метод экспертных оценок)"
				, "СистУпрРиск", "МетодЭкспОценДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СистУпрРиск["МетодЭкспОценНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Метод экспертных оценок)"
				, "СистУпрРиск", "МетодЭкспОценНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если СистУпрРиск["АнализПрошлНаличДок"] <> "0" И СистУпрРиск["АнализПрошлНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Анализ прошлых событий)"
				, "СистУпрРиск", "АнализПрошлНаличДок"));
	ИначеЕсли СистУпрРиск["АнализПрошлНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(СистУпрРиск["АнализПрошлНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Анализ прошлых событий)"
				, "СистУпрРиск", "АнализПрошлНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СистУпрРиск["АнализПрошлДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Анализ прошлых событий)"
				, "СистУпрРиск", "АнализПрошлДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СистУпрРиск["АнализПрошлНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Анализ прошлых событий)"
				, "СистУпрРиск", "АнализПрошлНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если СистУпрРиск["АнализКонтрНаличДок"] <> "0" И СистУпрРиск["АнализКонтрНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Анализ контрольных процедур)"
				, "СистУпрРиск", "АнализКонтрНаличДок"));
	ИначеЕсли СистУпрРиск["АнализКонтрНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(СистУпрРиск["АнализКонтрНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Анализ контрольных процедур)"
				, "СистУпрРиск", "АнализКонтрНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СистУпрРиск["АнализКонтрДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Анализ контрольных процедур)"
				, "СистУпрРиск", "АнализКонтрДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СистУпрРиск["АнализКонтрНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Анализ контрольных процедур)"
				, "СистУпрРиск", "АнализКонтрНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если СистУпрРиск["ПрочМетодНаличДок"] <> "0" И СистУпрРиск["ПрочМетодНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Прочие методы)"
				, "СистУпрРиск", "ПрочМетодНаличДок"));
	ИначеЕсли СистУпрРиск["ПрочМетодНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(СистУпрРиск["ПрочМетодНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Прочие методы)"
				, "СистУпрРиск", "ПрочМетодНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СистУпрРиск["ПрочМетодДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Прочие методы)"
				, "СистУпрРиск", "ПрочМетодДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СистУпрРиск["ПрочМетодНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Прочие методы)"
				, "СистУпрРиск", "ПрочМетодНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если СистУпрРиск["ПорРасчСущНаличДок"] <> "0" И СистУпрРиск["ПорРасчСущНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Порядок расчета уровня существенности)"
				, "СистУпрРиск", "ПорРасчСущНаличДок"));
	ИначеЕсли СистУпрРиск["ПорРасчСущНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(СистУпрРиск["ПорРасчСущНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Порядок расчета уровня существенности)"
				, "СистУпрРиск", "ПорРасчСущНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СистУпрРиск["ПорРасчСущДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Порядок расчета уровня существенности)"
				, "СистУпрРиск", "ПорРасчСущДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СистУпрРиск["ПорРасчСущНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Порядок расчета уровня существенности)"
				, "СистУпрРиск", "ПорРасчСущНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если СистУпрРиск["ПорВыявРискНаличДок"] <> "0" И СистУпрРиск["ПорВыявРискНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа"
				+ " (Порядок выявления операций, характеризующихся высоким уровнем потенциального риска)"
				, "СистУпрРиск", "ПорВыявРискНаличДок"));
	ИначеЕсли СистУпрРиск["ПорВыявРискНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(СистУпрРиск["ПорВыявРискНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить"
				+ " (Порядок выявления операций, характеризующихся высоким уровнем потенциального риска)"
				, "СистУпрРиск", "ПорВыявРискНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СистУпрРиск["ПорВыявРискДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить"
				+ " (Порядок выявления операций, характеризующихся высоким уровнем потенциального риска)"
				, "СистУпрРиск", "ПорВыявРискДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СистУпрРиск["ПорВыявРискНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить"
				+ " (Порядок выявления операций, характеризующихся высоким уровнем потенциального риска"
				, "СистУпрРиск", "ПорВыявРискНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
	Если СистУпрРиск["ОбщОписРискНаличДок"] <> "0" И СистУпрРиск["ОбщОписРискНаличДок"] <> "1" Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак наличия документа (Общее описание рисков)"
				, "СистУпрРиск", "ОбщОписРискНаличДок"));
	ИначеЕсли СистУпрРиск["ОбщОписРискНаличДок"] = "1" Тогда
		Если Не ЗначениеЗаполнено(СистУпрРиск["ОбщОписРискНомДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 номер документа необходимо заполнить (Общее описание рисков)"
				, "СистУпрРиск", "ОбщОписРискНомДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СистУпрРиск["ОбщОписРискДатаДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 дата документа необходимо заполнить (Общее описание рисков)"
				, "СистУпрРиск", "ОбщОписРискДатаДок"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СистУпрРиск["ОбщОписРискНаимДок"]) Тогда
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"При признаке 1 наименование документа необходимо заполнить (Общее описание рисков)"
				, "СистУпрРиск", "ОбщОписРискНаимДок"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьДокументСВыводомВТаблицу_Форма2020_1(Данные, УникальныйИдентификатор)
	ТаблицаОшибок = Новый СписокЗначений;
	
	Титульная = Данные.ДанныеУведомления.Титульная;
	Если Не ЗначениеЗаполнено(Титульная.КодНО) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан налоговый орган", "Титульная", "КодНО"));
	ИначеЕсли Не УведомлениеОСпецрежимахНалогообложения.СтрокаСодержитТолькоЦифры(Титульная.КодНО) Или СтрДлина(СокрЛП(Титульная.КодНО)) <> 4 Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан налоговый орган", "Титульная", "КодНО"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.ГодНМ) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан год", "Титульная", "ГодНМ"));
	ИначеЕсли Не УведомлениеОСпецрежимахНалогообложения.СтрокаСодержитТолькоЦифры(Титульная.ГодНМ) Или СтрДлина(СокрЛП(Титульная.ГодНМ)) <> 4 Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан год", "Титульная", "ГодНМ"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Титульная.Наименование) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указано наименование организации", "Титульная", "Наименование"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.ДАТА_ПОДПИСИ) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указана дата формирования документа", "Титульная", "ДАТА_ПОДПИСИ"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.ДатаИнф) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указана дата, по состоянию на которую сформирована представляемая информация", "Титульная", "ДатаИнф"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Титульная.ИНН) Или Не ЗначениеЗаполнено(Титульная.КПП) Тогда 
		Если Не ЗначениеЗаполнено(Титульная.ИНН) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан ИНН", "Титульная", "ИНН"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Титульная.КПП) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан КПП", "Титульная", "КПП"));
		КонецЕсли;
	Иначе
		Если Не РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(Титульная.ИНН, Истина, "") Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Неправильно указан ИНН", "Титульная", "ИНН"));
		КонецЕсли;
		Если Не РегламентированныеДанныеКлиентСервер.КППСоответствуетТребованиям(Титульная.КПП, "") Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Неправильно указан КПП", "Титульная", "КПП"));
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Титульная.ПРИЗНАК_НП_ПОДВАЛ) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан признак подписанта", "Титульная", "ПРИЗНАК_НП_ПОДВАЛ"));
	ИначеЕсли Не (Титульная.ПРИЗНАК_НП_ПОДВАЛ = "1" Или Титульная.ПРИЗНАК_НП_ПОДВАЛ = "2") Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Неправильно указан признак подписанта", "Титульная", "ПРИЗНАК_НП_ПОДВАЛ"));
	КонецЕсли;
	Если (Не ЗначениеЗаполнено(Данные.ПодписантФамилия) Или Не ЗначениеЗаполнено(Данные.ПодписантИмя)) Тогда 
		
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Необходимо указать подписанта", "Титульная", "ФИО_РУКОВОДИТЕЛЯ_ПРЕДСТАВИТЕЛЯ"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.Долж) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указана должность подписанта", "Титульная", "Долж"));
	КонецЕсли;
	
	Если Титульная.ПРИЗНАК_НП_ПОДВАЛ = "2" И Не ЗначениеЗаполнено(Титульная.НаимДок) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан документ подписанта", "Титульная", "НаимДок"));
	КонецЕсли;
	
	Проверить_КонтрСреда(Данные.ДанныеУведомления.КонтрСреда, ТаблицаОшибок);
	Проверить_СистУпрРиск(Данные.ДанныеУведомления.СистУпрРиск, ТаблицаОшибок);
	
	Если Истина Тогда 
		ТекСтр = Данные.ДанныеУведомления.ОбщПолож;
		ТекСтр.Вставить("УИД", Неопределено);
		Если Не УведомлениеОСпецрежимахНалогообложения.СтраницаЗаполнена(ТекСтр) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Страница не заполнена", "ОбщПолож", "ЭффектФХД", ТекСтр.УИД));
		Иначе
			СписокПроверяемыхПоказателей = Новый СписокЗначений;
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ЭффектФХД", "Упорядоченное и эффективное ведение финансово-хозяйственной деятельности"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ФинПоказат", "Достижение финансовых и операционных показателей"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "СохрАктив", "Сохранение активов"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ВыявлОшиб", "Выявление, исправление и предотвращение ошибок и искажения информации при 
				|исчислении (удержании) налогов, сборов, страховых взносов"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ПолнУплат", "Полнота и своевременность уплаты (перечисления) налогов, сборов, страховых взносов"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ПодготовНБО", "Своевременная подготовка бухгалтерской (финансовой), налоговой и иной отчетности организации"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "СоблТреб", "Соблюдение законодательных требований, нормативных актов, внутренних документов
				| организации и прочих применимых требований регуляторов"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ЗащитИнтерес", "Содействие в защите интересов акционеров, инвесторов и прочих заинтересованных лиц"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "УстрКонфликт", "Предотвращение и устранение конфликтов интересов"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ЭффектУпр", "Поддержка эффективного управления организацией и достижения стратегических целей наиболее эффективным способом"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "УслЗащРиск", "Создание условий для защиты организации от внутренних и внешних рисков"));
				
			Итер = 0;
			Для Каждого Стр Из Данные.ДанныеДопСтрокБД.МнгСтр1 Цикл 
				Итер = Итер + 1;
				
				ИтерСтр = Формат(Итер, "ЧГ=");
				Если Не ЗначениеЗаполнено(Стр["ОргДокСВКНомОргДок"]) Тогда 
					ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
						"Не указано: Номер организационно-распорядительного документа", "ОбщПолож", "ОргДокСВКНомОргДок___" + ИтерСтр));
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Стр["ОргДокСВКДатаОргДок"]) Тогда 
					ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
						"Не указано: Дата организационно-распорядительного документа", "ОбщПолож", "ОргДокСВКДатаОргДок___" + ИтерСтр));
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Стр["ОргДокСВКНаимОргДок"]) Тогда 
					ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
						"Не указано: Наименование организационно-распорядительного документа", "ОбщПолож", "ОргДокСВКНаимОргДок___" + ИтерСтр));
				КонецЕсли;
			КонецЦикла;
			
			Итер = 0;
			Для Каждого Стр Из Данные.ДанныеДопСтрокБД.МнгСтр2 Цикл 
				Итер = Итер + 1;
				
				ИтерСтр = Формат(Итер, "ЧГ=");
				Если Не ЗначениеЗаполнено(Стр["АудитСВКАудит"]) Тогда 
					ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
						"Не указано: Проведение аудита", "ОбщПолож", "АудитСВКАудит___" + ИтерСтр));
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Стр["АудитСВКВидАудит"]) Тогда 
					ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
						"Не указано: Вид аудита", "ОбщПолож", "АудитСВКВидАудит___" + ИтерСтр));
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Стр["АудитСВКОргАудит"]) Тогда 
					ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
						"Не указано: Наименование организации (структурного подразделения), осуществляющей аудит", "ОбщПолож", "АудитСВКОргАудит___" + ИтерСтр));
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Стр["АудитСВКПериодАудит"]) Тогда 
					ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
						"Не указано: Периодичность проведения аудита", "ОбщПолож", "АудитСВКПериодАудит___" + ИтерСтр));
				КонецЕсли;
			КонецЦикла;
				
			ПроверитьСписок(ТекСтр, "ОбщПолож", СписокПроверяемыхПоказателей, ТаблицаОшибок);
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Стр Из Данные.ДанныеМногостраничныхРазделов.СтрПодрСВК Цикл 
		ТекСтр = Стр.Значение;
		Если Не УведомлениеОСпецрежимахНалогообложения.СтраницаЗаполнена(ТекСтр) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Страница не заполнена", "СтрПодрСВК", "СтрПодр", ТекСтр.УИД));
		Иначе
			СписокПроверяемыхПоказателей = Новый СписокЗначений;
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "СтрПодр", "Структурное подразделение"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ФункПодр", "Функции структурного подразделения"));
				
			ПроверитьСписок(ТекСтр, "СтрПодрСВК", СписокПроверяемыхПоказателей, ТаблицаОшибок);
		КонецЕсли;
		
		Итер = 0;
		Для Каждого МнгСтр Из Данные.ДанныеДопСтрокБД.МнгСтр3 Цикл 
			Если МнгСтр.УИД <> ТекСтр.УИД Тогда 
				Продолжить;
			КонецЕсли;
			Итер = Итер + 1;
			
			Если Не ЗначениеЗаполнено(МнгСтр["КоордПодр"]) Тогда 
				ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
					"Не указан координатор", "СтрПодрСВК", "КоордПодр___" + Формат(Итер, "ЧГ=")));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого Стр Из Данные.ДанныеМногостраничныхРазделов.КонтрПроц Цикл 
		ТекСтр = Стр.Значение;
		Если Не УведомлениеОСпецрежимахНалогообложения.СтраницаЗаполнена(ТекСтр) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Страница не заполнена", "КонтрПроц", "ЧастотПров", ТекСтр.УИД));
		Иначе
			СписокПроверяемыхПоказателей = Новый СписокЗначений;
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ЧастотПров", "Частота проведения"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ВидКонтрол", "Вид контроля"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "СпособПров", "Способ проведения"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ОтвПодр", "Подразделение, ответственное за выполнение контрольной процедуры"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ОргДокКП", "Организационно-распорядительные документы, регламентирующие проведение контрольных процедур"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "УровКонтр", "Уровни контроля"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ПорОформРез", "Порядок документального оформления результатов выполнения контрольных процедур"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ПорАнализРез", "Порядок проведения анализа результатов выполнения контрольных процедур"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "НапрРиск", "Направление выявления организацией риска"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "НаимКП", "Наименование контрольной процедуры организации"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "НомерКП", "Порядковый номер контрольной процедуры"));
				
			Если СтрДлина(ТекСтр.НапрРиск) <> 4 Тогда 
				ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
					"Направление выявления организацией риска должно иметь длину 4 символа", "КонтрПроц", "НапрРиск", ТекСтр.УИД));
			КонецЕсли;
				
			Если ТекСтр.СпособПров = "2" Или ТекСтр.СпособПров = "3" Тогда 
				СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
					, "ПризДоступИС", "Признак представления налоговому органу доступа к информационной системе организации"));
				СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
					, "ВидИСОрг", "Вид информационной системы организации"));
				СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
					, "ПризНалПД", "Признак наличия в информационной системе персональных данных"));
				СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
					, "ПризНалДанДр", "Признак наличия и обработки в информационной системе данных других организаций"));
				СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
					, "ИННЮЛДост", "ИНН организации, к информационной системе которой предоставляется доступ налоговому органу"));
				СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
					, "НомерИС", "Порядковый номер информационной системы организации"));
				СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
					, "НаимИС", "Наименование информационной системы"));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекСтр.ИННЮЛДост) 
					И Не РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ТекСтр.ИННЮЛДост, Истина, "") Тогда 
					
				ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
					"ИНН не соответствует требованиям", "КонтрПроц", "ИННЮЛДост", ТекСтр.УИД));
			КонецЕсли;
				
			ПроверитьСписок(ТекСтр, "КонтрПроц", СписокПроверяемыхПоказателей, ТаблицаОшибок);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из Данные.ДанныеМногостраничныхРазделов.ИнфСистСВК Цикл 
		ТекСтр = Стр.Значение;
		Если Не УведомлениеОСпецрежимахНалогообложения.СтраницаЗаполнена(ТекСтр) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Страница не заполнена", "ИнфСистСВК", "ФункВозмИС", ТекСтр.УИД));
		Иначе
			СписокПроверяемыхПоказателей = Новый СписокЗначений;
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ФункВозмИС", "Функциональные возможности информационных систем"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ОперПровСВК", "Доля операций, проверяемых системой внутреннего контроля (в процентах)"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ОтмНалич", "Отметка о наличии"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ВнешАудитИС", "Проведение внешнего аудита информационных систем"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ВнутрАудитИС", "Проведение внутреннего аудита информационных систем"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ПризДоступИС", "Признак представления налоговому органу доступа к информационной системе организации"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ВидИСОрг", "Вид информационной системы организации"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ПризНалПД", "Признак наличия в информационной системе персональных данных"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ПризНалДанДр", "Признак наличия и обработки в информационной системе данных других организаций, в том числе организаций,
					|входящих в состав консолидированной группы налогоплательщиков"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ИННЮЛДост", "ИНН организации, к информационной системе которой предоставляется доступ налоговому органу"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "НомерИС", "Порядковый номер информационной системы организации"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "НаимИС", "Наименование информационной системы"));
			
			Если ЗначениеЗаполнено(ТекСтр.ИННЮЛДост) 
					И Не РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ТекСтр.ИННЮЛДост, Истина, "") Тогда 
					
				ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
					"ИНН не соответствует требованиям", "ИнфСистСВК", "ИННЮЛДост", ТекСтр.УИД));
			КонецЕсли;
			
			ПроверитьСписок(ТекСтр, "ИнфСистСВК", СписокПроверяемыхПоказателей, ТаблицаОшибок);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из Данные.ДанныеМногостраничныхРазделов.МонитСВК Цикл 
		ТекСтр = Стр.Значение;
		Если Не УведомлениеОСпецрежимахНалогообложения.СтраницаЗаполнена(ТекСтр) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Страница не заполнена", "МонитСВК", "ПорядОцен", ТекСтр.УИД));
		Иначе
			СписокПроверяемыхПоказателей = Новый СписокЗначений;
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ПорядОцен", "Порядок осуществления мониторинга и оценки системы внутреннего контроля"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ПорядУтв", "Порядок разработки и утверждения мероприятий по совершенствованию системы внутреннего контроля"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ПризДоступИС", "Признак представления налоговому органу доступа к информационной системе организации"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ВидИСОрг", "Вид информационной системы организации"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ПризНалПД", "Признак наличия в информационной системе персональных данных"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ПризНалДанДр", "Признак наличия и обработки в информационной системе данных других организаций, в том числе организаций,
					|входящих в состав консолидированной группы налогоплательщиков"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "ИННЮЛДост", "ИНН организации, к информационной системе которой предоставляется доступ налоговому органу"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "НомерИС", "Порядковый номер информационной системы организации"));
			СписокПроверяемыхПоказателей.Добавить(Новый Структура("Поле, Описание"
				, "НаимИС", "Наименование информационной системы"));
				
			Если ЗначениеЗаполнено(ТекСтр.ИННЮЛДост) 
					И Не РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ТекСтр.ИННЮЛДост, Истина, "") Тогда 
					
				ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
					"ИНН не соответствует требованиям", "МонитСВК", "ИННЮЛДост", ТекСтр.УИД));
			КонецЕсли;
			ПроверитьСписок(ТекСтр, "МонитСВК", СписокПроверяемыхПоказателей, ТаблицаОшибок);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаОшибок;
КонецФункции

Процедура ПроверитьСписок(ТекСтр, ИмяСтр, СписокПроверяемыхПоказателей, ТаблицаОшибок)
	Для Каждого Элт Из  СписокПроверяемыхПоказателей Цикл 
		Если Не ЗначениеЗаполнено(ТекСтр[Элт.Значение.Поле])Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не заполнено: " + Элт.Значение.Описание, ИмяСтр, Элт.Значение.Поле, ТекСтр.УИД));
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ОсновныеСведенияЭлектронногоПредставления_Форма2020_1(Объект, УникальныйИдентификатор)
	ОсновныеСведения = Новый Структура;
	Если РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Объект.Организация) Тогда 
		ОсновныеСведения.Вставить("ЭтоПБОЮЛ", Ложь);
		Документы.УведомлениеОСпецрежимахНалогообложения.ЗаполнитьДанныеНПЮЛ(Объект, ОсновныеСведения);
	Иначе
		ОсновныеСведения.Вставить("ЭтоПБОЮЛ", Истина);
		Документы.УведомлениеОСпецрежимахНалогообложения.ЗаполнитьДанныеНПФЛ(Объект, ОсновныеСведения);
	КонецЕсли;
	
	ОсновныеСведения.Вставить("ВерсПрог", РегламентированнаяОтчетность.НазваниеИВерсияПрограммы());
	ОсновныеСведения.Вставить("ДатаДок", Формат(Объект.ДатаПодписи, "ДФ=dd.MM.yyyy"));
	ОсновныеСведения.Вставить("ФамилияПодп", Объект.ПодписантФамилия);
	ОсновныеСведения.Вставить("ИмяПодп", Объект.ПодписантИмя);
	ОсновныеСведения.Вставить("ОтчествоПодп", Объект.ПодписантОтчество);
	
	Данные = Объект.ДанныеУведомления.Получить();
	ОсновныеСведения.Вставить("КодНО", Данные.ДанныеУведомления.Титульная.КодНО);
	ОсновныеСведения.Вставить("ПрПодп", Данные.ДанныеУведомления.Титульная.ПРИЗНАК_НП_ПОДВАЛ);
	ОсновныеСведения.Вставить("ИННТитул", Данные.ДанныеУведомления.Титульная.ИНН);
	ОсновныеСведения.Вставить("ИННЮЛ", Данные.ДанныеУведомления.Титульная.ИНН);
	ОсновныеСведения.Вставить("НаимДок", Данные.ДанныеУведомления.Титульная.НаимДок);
	ИдентификаторФайла = ИдентификаторФайлаЭлектронногоПредставления_Форма2020_1(ОсновныеСведения);
	ОсновныеСведения.Вставить("ИдФайл", ИдентификаторФайла);
	
	Возврат ОсновныеСведения;
КонецФункции

Функция ЭлектронноеПредставление_Форма2020_1(Объект, УникальныйИдентификатор)
	ПроизвольнаяСтрока = Новый ОписаниеТипов("Строка");
	
	СведенияЭлектронногоПредставления = Новый ТаблицаЗначений;
	СведенияЭлектронногоПредставления.Колонки.Добавить("ИмяФайла", ПроизвольнаяСтрока);
	СведенияЭлектронногоПредставления.Колонки.Добавить("ТекстФайла", ПроизвольнаяСтрока);
	СведенияЭлектронногоПредставления.Колонки.Добавить("КодировкаТекста", ПроизвольнаяСтрока);
	
	ДанныеУведомления = Объект.ДанныеУведомления.Получить();
	ДанныеУведомления.Вставить("Организация", Объект.Организация);
	ДанныеУведомления.Вставить("ПодписантФамилия", Объект.ПодписантФамилия);
	ДанныеУведомления.Вставить("ПодписантИмя", Объект.ПодписантИмя);
	ДанныеУведомления.Вставить("Организация", Объект.Организация);
	Ошибки = ПроверитьДокументСВыводомВТаблицу_Форма2020_1(ДанныеУведомления, УникальныйИдентификатор);
	Если Ошибки.Количество() > 0 Тогда 
		Если ДанныеУведомления.Свойство("РазрешитьВыгружатьСОшибками") И ДанныеУведомления.РазрешитьВыгружатьСОшибками = Ложь Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При проверке выгрузки обнаружены ошибки. Для просмотра списка ошибок перейдите в форму уведомления, меню ""Проверка"", пункт ""Проверить выгрузку""", Объект.Ссылка);
			ВызватьИсключение "";
		Иначе 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При проверке выгрузки обнаружены ошибки. Для просмотра списка ошибок перейдите в форму уведомления, меню ""Проверка"", пункт ""Проверить выгрузку""", Объект.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	ОсновныеСведения = ОсновныеСведенияЭлектронногоПредставления_Форма2020_1(Объект, УникальныйИдентификатор);
	СтруктураВыгрузки = Документы.УведомлениеОСпецрежимахНалогообложения.ИзвлечьСтруктуруXMLУведомления(Объект.ИмяОтчета, "СхемаВыгрузкиФорма2020_1");
	ЗаполнитьДанными_Форма2020_1(Объект, ОсновныеСведения, СтруктураВыгрузки);
	Текст = Документы.УведомлениеОСпецрежимахНалогообложения.ВыгрузитьДеревоВXML(СтруктураВыгрузки, ОсновныеСведения);
	
	СтрокаСведенийЭлектронногоПредставления = СведенияЭлектронногоПредставления.Добавить();
	СтрокаСведенийЭлектронногоПредставления.ИмяФайла = ОсновныеСведения.ИдФайл + ".xml";
	СтрокаСведенийЭлектронногоПредставления.ТекстФайла = Текст;
	СтрокаСведенийЭлектронногоПредставления.КодировкаТекста = "windows-1251";
	
	Если СведенияЭлектронногоПредставления.Количество() = 0 Тогда
		СведенияЭлектронногоПредставления = Неопределено;
	КонецЕсли;
	Возврат СведенияЭлектронногоПредставления;
КонецФункции

Процедура ДополнитьПараметры_2020(Параметры)
КонецПроцедуры

Процедура ЗаполнитьДанными_Форма2020_1(Объект, Параметры, ДеревоВыгрузки)
	Документы.УведомлениеОСпецрежимахНалогообложения.ОбработатьУсловныеЭлементы(Параметры, ДеревоВыгрузки);
	Документы.УведомлениеОСпецрежимахНалогообложения.ЗаполнитьПараметрыСРазделами(Параметры, ДеревоВыгрузки);
	ДанныеУведомления = Объект.ДанныеУведомления.Получить();
	ДополнитьПараметры_2020(ДанныеУведомления);
	ЗаполнитьДаннымиУзелНов(ДанныеУведомления, ДеревоВыгрузки);
	Документы.УведомлениеОСпецрежимахНалогообложения.ОтсечьНезаполненныеНеобязательныеУзлы(ДеревоВыгрузки);
КонецПроцедуры

Процедура ЗаполнитьДаннымиУзелНов(ПараметрыВыгрузки, Узел, ПараметрыТекущейСтраницы = Неопределено, УИДРодителя = Неопределено)
	СтрокиУзла = Новый Массив;
	Для Каждого Стр Из Узел.Строки Цикл
		СтрокиУзла.Добавить(Стр);
	КонецЦикла;
	
	Для Каждого Стр из СтрокиУзла Цикл
		Если Стр.Тип = "А" Или Стр.Тип = "A" Или Стр.Тип = "П" Тогда
			Если Стр.Многострочность = Истина Тогда
				Многострочность = Неопределено;
				Если ПараметрыВыгрузки.ДанныеДопСтрокБД.Свойство(Стр.Раздел, Многострочность)
					И ТипЗнч(Многострочность) = Тип("ТаблицаЗначений") Тогда
				
					Для Каждого СтрМнгч Из Многострочность Цикл
						Если ЗначениеЗаполнено(УИДРодителя)
							И УИДРодителя <> СтрМнгч.УИД Тогда 
							
							Продолжить;
						КонецЕсли;
						
						НовУзел = Документы.УведомлениеОСпецрежимахНалогообложения.НовыйУзелИзПрототипа(Стр);
						РегламентированнаяОтчетность.ВывестиПоказательСтатистикиВXML(НовУзел, СтрМнгч[НовУзел["Ключ"]]);
					КонецЦикла;
					
					РегламентированнаяОтчетность.УдалитьУзел(Стр);
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(Стр.Ключ) Тогда
				ЗначениеПоказателя = Неопределено;
				Если ПараметрыТекущейСтраницы <> Неопределено И ПараметрыТекущейСтраницы.Свойство(Стр.Ключ, ЗначениеПоказателя) Тогда 
					РегламентированнаяОтчетность.ВывестиПоказательСтатистикиВXML(Стр, ЗначениеПоказателя);
				ИначеЕсли ПараметрыТекущейСтраницы = Неопределено 
					И ЗначениеЗаполнено(Стр.Раздел)
					И ПараметрыВыгрузки.ДанныеУведомления.Свойство(Стр.Раздел, ЗначениеПоказателя) Тогда 
					Если ЗначениеПоказателя.Свойство(Стр.Ключ, ЗначениеПоказателя) Тогда
						РегламентированнаяОтчетность.ВывестиПоказательСтатистикиВXML(Стр, ЗначениеПоказателя);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Стр.Тип = "С" ИЛИ Стр.Тип = "C" Тогда
			Если Стр.Многостраничность = Истина Тогда
				Многостраничность = Неопределено;
				Если ПараметрыВыгрузки.ДанныеМногостраничныхРазделов.Свойство(Стр.Раздел, Многостраничность)
					И ТипЗнч(Многостраничность) = Тип("СписокЗначений") Тогда
				
					Для Каждого СтрМнгч Из Многостраничность Цикл 
						Если УИДРодителя = Неопределено Или СтрМнгч.Значение.УИДРодителя = УИДРодителя Тогда 
							НовУзел = Документы.УведомлениеОСпецрежимахНалогообложения.НовыйУзелИзПрототипа(Стр);
							ЗаполнитьДаннымиУзелНов(ПараметрыВыгрузки, НовУзел, СтрМнгч.Значение, СтрМнгч.Значение.УИД);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			Иначе
				
				Если Стр.Многострочность = Истина Тогда
					Многострочность = Неопределено;
					Если ПараметрыВыгрузки.ДанныеДопСтрокБД.Свойство(Стр.Раздел, Многострочность)
						И ТипЗнч(Многострочность) = Тип("ТаблицаЗначений") Тогда
					
						Для Каждого СтрМнгч Из Многострочность Цикл
							Если ЗначениеЗаполнено(УИДРодителя)
								И УИДРодителя <> СтрМнгч.УИД Тогда 
								
								Продолжить;
							КонецЕсли;
							
							НовУзел = Документы.УведомлениеОСпецрежимахНалогообложения.НовыйУзелИзПрототипа(Стр);
							ЗаполнитьДаннымиУзелНов(ПараметрыВыгрузки, НовУзел, 
								ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрМнгч));
						КонецЦикла;
						
						РегламентированнаяОтчетность.УдалитьУзел(Стр);
					КонецЕсли;
					Иначе
						ЗаполнитьДаннымиУзелНов(ПараметрыВыгрузки, Стр, ПараметрыТекущейСтраницы, УИДРодителя);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция СформироватьСписокЛистовФорма2020_1(Объект) Экспорт
	Листы = Новый СписокЗначений;
	ПечатнаяФорма = УведомлениеОСпецрежимахНалогообложения.НовыйПустойЛист();
	ПечатнаяФорма.Вывести(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьМакет("ПечатьВСледующихВерсиях"));
	УведомлениеОСпецрежимахНалогообложения.ПоложитьПФВСписокЛистов(Объект, Листы, ПечатнаяФорма, 1, Ложь);
	Возврат Листы;
КонецФункции
#КонецОбласти
#КонецЕсли
