&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Параметры = Новый Структура;
	Параметры.Вставить("ДокументОтчетности", ПараметрКоманды);
	Параметры.Вставить("ПерезаписатьСуществующий", Ложь);
	Параметры.Вставить("ВходящийДокумент", Неопределено);
	СоздатьДокументНаОсновании(Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументНаОсновании(Параметры) Экспорт
	
	РезультатСоздания = ОтчетностьВКонтролирующиеОрганыВызовСервера.СоздатьИлиОбновитьВходящийДокумент(
		Параметры.ДокументОтчетности, Параметры.ПерезаписатьСуществующий);
	
	Если РезультатСоздания.ДокументСуществует Тогда
		
		Параметры.ВходящийДокумент = РезультатСоздания.ВходящийДокумент;
		ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьДокументНаОснованииЗавершение", ЭтотОбъект, Параметры);
		ТекстВопроса = НСтр("ru = 'Входящий документ уже создан.
							|Вы хотите обновить его данными документа отчетности?'");
		ОбщегоНазначенияДокументооборотКлиент.ПоказатьВопросДаНет(
			ОписаниеОповещения,
			ТекстВопроса,
			НСтр("ru='Обновить и открыть'"),
			НСтр("ru='Открыть без обновления'"),
			КодВозвратаДиалога.Нет);
			
	ИначеЕсли ЗначениеЗаполнено(РезультатСоздания.ОписаниеОшибки) Тогда
		
		ПоказатьПредупреждение(, РезультатСоздания.ОписаниеОшибки);
		
	Иначе
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("ДокументОтчетности", Параметры.ДокументОтчетности);
		ПараметрыОповещения.Вставить("ДокументДокументооборота", РезультатСоздания.ВходящийДокумент);
		Оповестить("СозданДокументДокументооборотаНаОснованииДокументаКО", ПараметрыОповещения);
		ОповеститьОбИзменении(РезультатСоздания.ВходящийДокумент);
		ПоказатьДокумент(РезультатСоздания.ВходящийДокумент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДокумент(ВходящийДокумент)
	
	ПоказатьЗначение(, ВходящийДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументНаОснованииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ДополнительныеПараметры.ПерезаписатьСуществующий = Истина;
		СоздатьДокументНаОсновании(ДополнительныеПараметры);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ПоказатьДокумент(ДополнительныеПараметры.ВходящийДокумент);
	КонецЕсли;
	
КонецПроцедуры
