//@strict-types

#Область СлужебныйПрограммныйИнтерфейс

#Область ТекущиеДелаЭДО

Функция ПараметрыЗапускаТекущихДелЭДО() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("РежимОтображения", "");
	Результат.Вставить("Раздел", "");
	Результат.Вставить("ОтборУчетныхДокументов", Новый Массив);
	Результат.Вставить("ОтборВходящихДокументов", Новый Массив);
	Результат.Вставить("ОтборИсходящихДокументов", Новый Массив);
	Возврат Результат;
	
КонецФункции

Процедура ОткрытьТекущиеДелаЭДОКоманда(Источник = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОткрытьТекущиеДелаЭДО();
	
КонецПроцедуры

Процедура ОткрытьТекущиеДелаЭДО(ПараметрыЗапуска = Неопределено, ОповещениеОЗакрытии = Неопределено) Экспорт
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ОбщийМодуль.ИнтерфейсДокументовЭДОКлиент.ОткрытьТекущиеДелаЭДО");
	
	ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.ТекущиеДелаПоЭДО", ПараметрыЗапуска,,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

// Открывает страницу опроса на сайте ИТС
//
Процедура ОткрытьСтраницуОпроса() Экспорт
	
	ПараметрыЕстьИдея = ИнтерфейсДокументовЭДОВызовСервера.ПараметрыОткрытияСтраницыОпроса();
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("http://its.1c.ru/survey/service1cedo" + ПараметрыЕстьИдея);
	
КонецПроцедуры

Процедура ОткрытьНастройкиСпискаТекущиехДел(Оповещение, Форма, КомпоновщикНастроек) Экспорт

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Настройка списка'"));
	ПараметрыФормы.Вставить("ИсточникДоступныхНастроек", КомпоновщикНастроек.ПолучитьИсточникДоступныхНастроек());
	ПараметрыФормы.Вставить("Настройки", КомпоновщикНастроек.Настройки);
	ПараметрыФормы.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки);
	ПараметрыФормы.Вставить("ФиксированныеНастройки", КомпоновщикНастроек.ФиксированныеНастройки);

	ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.ТекущиеДелаПоЭДОНастройкаСписка", ПараметрыФормы, ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

Процедура ВыборРежимаПросмотраТекущихДел(Оповещение, Форма, РежимОтображения, ПакетноеОтображение) Экспорт

	ПараметрыФормы = Новый Структура("РежимОтображения, ПакетноеОтображение", РежимОтображения, ПакетноеОтображение);
	
	ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.ТекущиеДелаПоЭДОВыборРежимаПросмотра", ПараметрыФормы, Форма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

Процедура ОткрытьВводРеквизитовПроизвольногоДокумента(Оповещение, Форма, ОписаниеФайла = Неопределено) Экспорт

	Если ЗначениеЗаполнено(ОписаниеФайла) Тогда
		Параметры = Новый Структура("ОписаниеФайла", ОписаниеФайла);
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.ЗаполнениеРеквизитовПроизвольногоДокумента", Параметры, Форма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

Процедура ОткрытьАрхивЭДО() Экспорт

	ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.АрхивЭлектронныхДокументов");

КонецПроцедуры

Процедура ОткрытьФормуВыгрузкиЭлектронныхДокументовДляФНС(Форма, НаправлениеЭДО) Экспорт

	СтруктураПараметров = Новый Структура("НаправлениеЭД, ВерсияВызова", НаправлениеЭДО, 1);
	ОткрытьФорму("Обработка.ИнтеграцияБРО_ЭДО.Форма.ВыгрузкаЭлектронныхДокументовДляФНС",
		СтруктураПараметров, Форма, Форма.УникальныйИдентификатор);

КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаВызрузкаЭлектронныхДокументов

#Область ФормированиеКаталогаТоваров	

Процедура СформироватьКаталогТоваров(ОбъектУчета, ИдентификаторФормы) Экспорт
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики();
	Контекст = Новый Структура;
	Контекст.Вставить("ОбъектУчета", ОбъектУчета);
	Контекст.Вставить("ИдентификаторФормы", ИдентификаторФормы);
	Контекст.Вставить("КонтекстДиагностики", КонтекстДиагностики);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьКаталогТоваровПослеПодбора", ЭтотОбъект, Контекст);
	ИнтеграцияЭДОКлиент.ОткрытьФормуПодбораТоваров(ИдентификаторФормы, ОписаниеОповещения);
	
КонецПроцедуры

Процедура ОтправитьКаталогТоваровПослеПодбора(Результат, Контекст) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ИнтерфейсДокументовЭДОКлиент.СформироваКаталогТоваров(Контекст.ОбъектУчета, Результат);
	КонецЕсли;
	
КонецПроцедуры	
	
Процедура СформироваКаталогТоваров(ОбъектУчета, ДанныеКаталога) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДанныеКаталога", ДанныеКаталога);
	
	ОткрытьЭлектронныйДокументОбъектаУчета(ОбъектУчета, ДополнительныеПараметры);
	
КонецПроцедуры
	
#КонецОбласти

Функция НовыеПараметрыФормыПросмотраЗагрузкиЭлектронныхДокументов() Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресХранилищаФайла");
	СтруктураПараметров.Вставить("АдресХранилищаПакета");
	СтруктураПараметров.Вставить("ФайлАрхива", Истина);
	СтруктураПараметров.Вставить("ИмяФайла");
	СтруктураПараметров.Вставить("НаправлениеЭД");
	СтруктураПараметров.Вставить("Контрагент");
	СтруктураПараметров.Вставить("УникальныйИдентификатор");
	СтруктураПараметров.Вставить("ВладелецЭД");

	Возврат СтруктураПараметров;

КонецФункции

Процедура ОткрытьФормуПросмотраЗагрузкиЭлектронногоДокумента(Параметры) Экспорт

	ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.ЗагрузкаПросмотрЭлектронногоДокумента",
		Новый Структура("СтруктураЭД", Параметры), ЭтотОбъект, Параметры.УникальныйИдентификатор);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПодключаемыхКоманд

// Обработчик команды отправки печатной формы по ЭДО.
//
// Параметры:
//  ПараметрКоманды - Ссылка - ссылка на объект ИБ, электронные документы которого надо отправить,
//  ПараметрыВыполненияКоманды - Структура - дополнительные параметры просмотра.
//
Процедура ОтправитьПечатнуюФормуПоЭДОКоманда(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СуществуютЭД = ИнтеграцияЭДОВызовСервера.ЭлектронныеДокументыОбъектовУчета(ПараметрКоманды).Количество() > 0;
	
	Если СуществуютЭД Тогда 
		ПараметрыФормы = Новый Структура("ДокументОснование", ПараметрКоманды);
		ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.СписокСформированныхДокументов", ПараметрыФормы, 
		ПараметрКоманды,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;
	КонецЕсли;
	
	ОтправитьПечатнуюФормуПоЭДО(ПараметрКоманды);
	
КонецПроцедуры

Процедура ВыгрузитьДанныеВФайл(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
		
	МассивСсылок = ОбщегоНазначенияБЭДКлиент.МассивПараметров(ПараметрКоманды);
	Если МассивСсылок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура("СтруктураЭД", МассивСсылок);
	ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.ВыгрузкаЭлектронныхДокументовВФайл", Параметры, ПараметрыВыполненияКоманды.Источник);
	
КонецПроцедуры

Процедура ОткрытьВыгрузкуДокументовВФайл(ОбъектыУчета) Экспорт
	
	Параметры = Новый Структура("СтруктураЭД", ОбъектыУчета);
	ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.ВыгрузкаЭлектронныхДокументовВФайл", Параметры);
	
КонецПроцедуры

Процедура ПерезаполнитьДокумент(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт	
	
	ИнтеграцияЭДОКлиент.ПерезаполнитьДокумент(ПараметрКоманды);	
	
КонецПроцедуры

Процедура ЗагрузитьДанныеИзФайла(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	Файл = Неопределено;
	АдресВХранилище = Неопределено;
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
	
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СсылкаНаДокумент", ПараметрКоманды);
	ДополнительныеПараметры.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	
	Обработчик = Новый ОписаниеОповещения("ЗагрузитьДанныеИзФайлаОбработатьРезультатПомещенияФайла", ЭтотОбъект, ДополнительныеПараметры);
	НачатьПомещениеФайла(Обработчик, АдресВХранилище, Файл, Истина, УникальныйИдентификатор);
		
КонецПроцедуры

Процедура ОткрытьНастройкиОтправкиДокументовПоДоговору(Договор, ДополнительныеПараметры) Экспорт
	
	НастройкиЭДОКлиент.ОткрытьНастройкиОтправкиПоДоговору(Договор);
	
КонецПроцедуры

Процедура ПригласитьКОбменуЭДО(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	Параметры = СинхронизацияЭДОКлиент.НовыеПараметрыОткрытияПомощникаОтправкиПриглашения();
	Параметры.Контрагент = ИнтерфейсДокументовЭДОВызовСервера.КонтрагентыДляОтправкиПриглашений(ПараметрКоманды);
	СинхронизацияЭДОКлиент.ОткрытьПомощникОтправкиПриглашения(Параметры);
	
КонецПроцедуры

Процедура ОткрытьНастройкиОтраженияВУчете(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	НастройкиЭДОКлиент.ОткрытьНастройкиОтраженияВУчете(ПараметрКоманды);
			
КонецПроцедуры
	
Процедура ОткрытьНастройкиОтправкиДокументовКонтрагента(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт

	НастройкиЭДОКлиент.ОткрытьНастройкиОтправки(ПараметрКоманды);	
		
КонецПроцедуры
	
Процедура ПодключитьКЭДО(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт

	ПараметрыСоздания = СинхронизацияЭДОКлиент.НовыеПараметрыСозданияУчетнойЗаписи();
	ПараметрыСоздания.Организация = ПараметрКоманды;
	СинхронизацияЭДОКлиент.СоздатьУчетнуюЗапись(ПараметрыСоздания);
		
КонецПроцедуры
	
Процедура ОткрытьСписокУчетныхЗаписей(Организация, ПараметрыВыполненияКоманды) Экспорт
	
	СинхронизацияЭДОКлиент.ОткрытьСписокУчетныхЗаписей(Организация);
	
КонецПроцедуры
	
Процедура НастройкиОтправкиДокументовИнтеркампани(Организация, ДополнительныеПараметры) Экспорт

	НастройкиЭДОКлиент.ОткрытьНастройкиИнтеркампани(Организация);
		
КонецПроцедуры

Процедура СформироватьПодписатьОтправитьЭД(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Источник", ПараметрыВыполненияКоманды.Источник);

	ОбработчикОповещения = Новый ОписаниеОповещения("СформироватьПодписатьОтправитьЭДЗавершить", ЭтотОбъект, ДополнительныеПараметры);
	
	Если ПараметрКоманды.Количество() > 1 Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрКоманды", ПараметрКоманды);
		ДополнительныеПараметры.Вставить("Обработчик", ОбработчикОповещения);

		Оповещение = Новый ОписаниеОповещения("ПроверитьПроведениеПослеВопросаПользователю", ЭтотОбъект, ДополнительныеПараметры);
		
		ТекстВопроса = НСтр("ru = 'Отправить электронные документы выделенных элементов?
			|Если электронных документов нет, они будут созданы автоматически.'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		
		ИнтеграцияЭДОКлиент.ПодготовитьКДокументообороту(ПараметрКоманды, ОбработчикОповещения);
	
	КонецЕсли;
			
КонецПроцедуры
	
Процедура ПроверитьПроведениеПослеВопросаПользователю(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда

		ИнтеграцияЭДОКлиент.ПодготовитьКДокументообороту(ДополнительныеПараметры.ПараметрКоманды,
			ДополнительныеПараметры.Обработчик);

	КонецЕсли; 
	
КонецПроцедуры

Процедура СформироватьПодписатьОтправитьЭДЗавершить(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Сформировать"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Подписать"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ПодготовитьКОтправке"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Отправить"));
	
	ПараметрыВыполненияДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ОбъектыУчета = ПараметрКоманды;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ОбъектыУчета", ПараметрКоманды);
	ПараметрыОповещения.Вставить("ПараметрыВыполненияДействийПоЭДО", ПараметрыВыполненияДействийПоЭДО);
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, ПараметрыОповещения);
	
	ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(Оповещение, ПараметрыВыполненияДействийПоЭДО);
		
КонецПроцедуры
	
Процедура ОткрытьНастройкиВнутреннегоЭДО(Организация, ПараметрыВыполненияКоманды) Экспорт

	НастройкиЭДОКлиент.ОткрытьНастройкиВнутреннегоЭлектронногоДокументооборота(Организация);
		
КонецПроцедуры
	
Процедура ОткрытьЭлектронныйДокументОбъектаУчетаКоманда(ОбъектУчета, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОткрытьЭлектронныйДокументОбъектаУчета(ОбъектУчета);
	
КонецПроцедуры	

#КонецОбласти

#Область ИнтеграцияСИнтерфейсомУчетныхДокументов

// Функция - Параметры "ПриОткрытии" формы.
// 
// Возвращаемое значение:
//  Структура - параметры, которые необходимо передать в метод ОбменСКонтрагентамиКлиент.ПриОткрытии.
//    * Форма - УправляемаяФорма - форма справочника или документа.
//    * МестоРазмещенияКоманд - ЭлементФормы - элемент формы "группа", в котором должны отображаться команды ЭДО, необязательный параметр.
//    * ЕстьОбработчикОбновитьКомандыЭДО - Булево - нужно устанавливать в Истина в форме прикладного справочника организаций.
//
Функция ПараметрыПриОткрытииФормы() Экспорт

	ПараметрыОповещения = Новый Структура;

	ПараметрыОповещения.Вставить("Форма");
	ПараметрыОповещения.Вставить("МестоРазмещенияКоманд");
	ПараметрыОповещения.Вставить("ЕстьОбработчикОбновитьКомандыЭДО", Ложь);
	
	Возврат ПараметрыОповещения;


КонецФункции

// Вызывается из обработчика события "ПриОткрытии" формы списка и формы документа.
// Параметры:
//  Параметры -  УправляемаяФорма - Форма документа или форма списков документов (вариант передачи параметра устарел).
//            -  Структура - см. ИнтеграцияЭДОКлиент.ПараметрыПриОткрытииФормы. 
//
Процедура ПриОткрытииФормы(Параметры) Экспорт
	
	Если ТипЗнч(Параметры) = Тип("ФормаКлиентскогоПриложения") Тогда
		ПараметрыПриОткрытии = ПараметрыПриОткрытииФормы();
		ПараметрыПриОткрытии.Форма = Параметры;
	Иначе 
		ПараметрыПриОткрытии = Параметры;
	КонецЕсли;
	
	ПараметрыПриОткрытии.Форма.ПодключитьОбработчикОжидания("Подключаемый_ОбработчикОжиданияЭДО", 1000, Истина);
	
	Если ПараметрыПриОткрытии.ЕстьОбработчикОбновитьКомандыЭДО Тогда
		ПараметрыПриОткрытии.Форма.ОтключитьОбработчикОжидания("Подключаемый_ОбновитьКомандыЭДО");
		ПараметрыПриОткрытии.Форма.ПодключитьОбработчикОжидания("Подключаемый_ОбновитьКомандыЭДО", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьПиктограммуОповещенияЭДО(Форма, МестоРазмещенияКоманд = Неопределено)
	
	КартинкаПодменюЭДО = БиблиотекаКартинок.ЭмблемаСервиса1СЭДО;
	Если СинхронизацияЭДОВызовСервера.ЕстьСобытияЭДО() Тогда
		КартинкаПодменюЭДО = БиблиотекаКартинок.ВосклицательныйЗнакКрасный;
	КонецЕсли;
	ОбновитьОтображениеНовыхЭД(Форма, КартинкаПодменюЭДО, МестоРазмещенияКоманд);

КонецПроцедуры

// Обновление отображения новых электронных документов.
//
// Параметры:
//  Форма					 - Форма - форма отображения.
//  КартинкаЭДО				 - Картинка - изображение оповещения.
//  МестоРазмещенияКоманд	 - Массив, ЭлементФормы - место размещения команд.
//
Процедура ОбновитьОтображениеНовыхЭД(Форма, КартинкаЭДО, МестоРазмещенияКоманд)
	
	Если Не МестоРазмещенияКоманд = Неопределено Тогда
		
		Если ТипЗнч(МестоРазмещенияКоманд) = Тип("Массив") Тогда
			Для Каждого ЭлементМассива Из МестоРазмещенияКоманд Цикл
				ОбновитьКартинкуЭДО(Форма, КартинкаЭДО, ЭлементМассива);
			КонецЦикла;
			
		Иначе
			ОбновитьКартинкуЭДО(Форма, КартинкаЭДО, МестоРазмещенияКоманд);
			
		КонецЕсли;
		
	Иначе
		
		Элементы = Форма.Элементы;
		
		ПодменюЭДО = ПодменюЭДОФормы(Элементы);
		Если ПодменюЭДО = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ОбновитьКартинкуЭДО(Форма, КартинкаЭДО, ПодменюЭДО);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПодменюЭДОФормы(ЭлементыФормы)
	
	КомандыЭДО = ЭлементыФормы.Найти("ФормаКоманднаяПанельКомандыЭДО");
	
	Возврат КомандыЭДО;
	
КонецФункции

Процедура ОбновитьКартинкуЭДО(Форма, КартинкаЭДО, МестоРазмещенияКоманд)
	
	ПодменюЭДО = МестоРазмещенияКоманд;
	Если ПодменюЭДО.Вид = ВидГруппыФормы.ГруппаКнопок Или ПодменюЭДО.Картинка = КартинкаЭДО Тогда
		Возврат;
	КонецЕсли;
	
	ПодменюЭДО.Картинка = КартинкаЭДО;
	Если Не КартинкаЭДО = БиблиотекаКартинок.ЭмблемаСервиса1СЭДО Тогда
		ПодменюЭДО.Подсказка = НСтр("ru = 'В сервисе 1С-ЭДО есть новые документы'");
	Иначе
		ПодменюЭДО.Подсказка = НСтр("ru = 'Команды ЭДО'");
	КонецЕсли;
	
КонецПроцедуры

// Параметры ожидания ЭДО.
//
// Возвращаемое значение:
//  Структура - параметры обработки ожидания ЭДО.
//    * МестоРазмещенияКоманд - ЭлементФормы, Массив - подменю в котором отображаются команды ЭДО.
//
Функция ПараметрыОжиданияЭДО() Экспорт
	
	ПараметрыОжиданияЭДО = Новый Структура;
	
	ПараметрыОжиданияЭДО.Вставить("МестоРазмещенияКоманд");
	
	Возврат ПараметрыОжиданияЭДО;

	
КонецФункции

// Обработчик ожидания событий ЭДО.
//
// Параметры:
//  Форма - УправляемаяФорма - форма, к которой подключается обработчик;
//  ПараметрыОжиданияЭДО - см. ИнтеграцияДокументовЭДО.ПараметрыОжиданияЭДО
//
Процедура ОбработчикОжиданияЭДО(Форма, ПараметрыОжиданияЭДО = Неопределено) Экспорт
	
	МестоРазмещенияКоманд = Неопределено;
	Если Не ПараметрыОжиданияЭДО = Неопределено Тогда
		МестоРазмещенияКоманд = ПараметрыОжиданияЭДО.МестоРазмещенияКоманд;
	КонецЕсли;
	
	ОбновитьПиктограммуОповещенияЭДО(Форма, МестоРазмещенияКоманд);
	
	Форма.ПодключитьОбработчикОжидания("Подключаемый_ОбработчикОжиданияЭДО", 1000, Истина);
	
КонецПроцедуры

#Область ФормаСписка

// Получение параметров оповещения для формы списка.
//
// Возвращаемое значение:
//  Структура - параметры, которые нужно передавать в метод ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента.
//    * Форма - УправляемаяФорма - форма документа.
//    * ИмяДинамическогоСписка - Строка - Наименование динамического списка формы, отображающего "СостояниеЭД".
//                               Возможно указание нескольких списков через ("СписокИсходящий, СписокВходящий").
//    * МестоРазмещенияКоманд - ЭлементФормы, Массив - подменю, в котором отображаются команды ЭДО.
//    * ЕстьОбработчикОбновитьКомандыЭДО - Булево - нужно устанавливать в Истина в форме прикладного справочника организаций.
//    * ЕстьОбработчикОбновленияВидимостиСостоянияЭДО - Булево - нужно устанавливать в Истина в формах списка внутрених документов ЭДО.
//
Функция ПараметрыОповещенияЭДО_ФормаСписка() Экспорт
	
	ПараметрыОповещения = Новый Структура;
	
	ПараметрыОповещения.Вставить("Форма");
	ПараметрыОповещения.Вставить("ИмяДинамическогоСписка", "");
	ПараметрыОповещения.Вставить("МестоРазмещенияКоманд");
	ПараметрыОповещения.Вставить("ЕстьОбработчикОбновитьКомандыЭДО", Ложь);
	ПараметрыОповещения.Вставить("ЕстьОбработчикОбновленияВидимостиСостоянияЭДО", Ложь);
		
	Возврат ПараметрыОповещения;
	
КонецФункции

// Обработчик события "ОбработкаОповещения" формы списка документов.
//
// Параметры:
//  ИмяСобытия - Строка - имя события.
//  Параметр - Произвольный - параметр сообщения, могут быть переданы любые необходимые данные.
//  Источник - Произвольный - источник события. Например, в качестве источника может быть указана другая форма.
//  ПараметрыОповещения - Структура - см. ИнтеграцияЭДОКлиент.ПараметрыОповещенияЭДО_ФормаСписка.
//
Процедура ОбработкаОповещения_ФормаСписка(ИмяСобытия, Параметр, Источник, ПараметрыОповещения) Экспорт
	
	
 	Если ИмяСобытия = "ОбновитьСостояниеЭД"
		Или ИмяСобытия = "ОбновленСписокУчетныхЗаписей1СЭДО" Тогда
		
		ИмяДинамическогоСписка = ПараметрыОповещения.ИмяДинамическогоСписка;
		Форма = ПараметрыОповещения.Форма;
		
		МассивСписков = СтрРазделить(ИмяДинамическогоСписка, ", ", Ложь);
		Для Каждого ИмяРеквизита Из МассивСписков Цикл
			Форма.Элементы[ИмяРеквизита].Обновить();
		КонецЦикла;
		Если ПараметрыОповещения.ЕстьОбработчикОбновитьКомандыЭДО Тогда
			Форма.ОтключитьОбработчикОжидания("Подключаемый_ОбновитьКомандыЭДО");
			Форма.ПодключитьОбработчикОжидания("Подключаемый_ОбновитьКомандыЭДО", 0.2, Истина);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ОбновитьНаличиеЭДО" Тогда
		
		МестоРазмещенияКоманд = ПараметрыОповещения.МестоРазмещенияКоманд;
		Форма = ПараметрыОповещения.Форма;
		ОбновитьПиктограммуОповещенияЭДО(Форма, МестоРазмещенияКоманд);
		
	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант"
				И Источник = "ИспользоватьВнутренниеДокументыЭДО" Тогда
				
		Если ПараметрыОповещения.ЕстьОбработчикОбновленияВидимостиСостоянияЭДО Тогда 
			Форма = ПараметрыОповещения.Форма;
			Форма.ОтключитьОбработчикОжидания("Подключаемый_ОбновитьВидимостьСостоянияЭДО");
			Форма.ПодключитьОбработчикОжидания("Подключаемый_ОбновитьВидимостьСостоянияЭДО", 0.2, Истина);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Обработка нажатия на гиперссылку "СостояниеЭДО" в форме списка
//
// Параметры:
//  ОбъектУчетаСсылка - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - ссылка на объект учета.
//  СтандартнаяОбработка - Булево - признак стандартной обработки нажатия на гиперссылку (устанавливается в Ложь).
//
Процедура ДекорацияСостояниеЭДОФормаСпискаНажатие(ОбъектУчетаСсылка, СтандартнаяОбработка = Ложь) Экспорт
	
	Если ОбъектУчетаСсылка <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Не ИнтерфейсДокументовЭДОВызовСервера.СостояниеОбъектаУчетаУстановлено(ОбъектУчетаСсылка) Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыОбъекта = НовыеПараметрыОбъектаУчетаДляПросмотраСтатусовДокументов();
		ПараметрыОбъекта.ОбъектУчета = ОбъектУчетаСсылка;
		ОткрытьФормуПросмотраСтатусовДокументов(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыОбъекта));
			
	КонецЕсли;

КонецПроцедуры

Процедура ПриАктивизацииСтроки_ФормаСписка(Форма) Экспорт
	
	Форма.ОтключитьОбработчикОжидания("Подключаемый_ОбновитьКомандыЭДО");
	Форма.ПодключитьОбработчикОжидания("Подключаемый_ОбновитьКомандыЭДО", 0.2, Истина);

КонецПроцедуры

// Возвращает параметры просмотра статусов электронных документов
//
// Параметры:
//  ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - ссылка на объект учета.
//  Организация - ОпределяемыйТип.Организация - организация.
//  ВидДокумента - СправочникСсылка.ВидоДокументовЭДО - вид документа.
//
Функция НовыеПараметрыОбъектаУчетаДляПросмотраСтатусовДокументов() Экспорт
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("ОбъектУчета");
	Параметры.Вставить("Организация");
	Параметры.Вставить("ВидДокумента");
	
	Возврат Параметры;
	
КонецФункции

// См. ОбменСКонтрагентамиКлиент.ОбработчикОбновленияВидимостьСостоянияЭДО
Процедура ОбработчикОбновленияВидимостьСостоянияЭДО(Форма, КолонкаСостояния) Экспорт
	
	Если КолонкаСостояния <> Неопределено Тогда
		КолонкаСостояния.Видимость = ИнтерфейсДокументовЭДОВызовСервера.ИспользуетсяЭДОИВнутреннийЭДО();
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти

#Область ФормаДокумента
	
// Получение параметров оповещения для формы документ.
//
// Возвращаемое значение:
//  Структура - параметры, которые нужно передавать в метод ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента:
//    * Форма - УправляемаяФорма - форма документа.
//    * ДокументСсылка - ДокументСсылка - Ссылка на документ.
//    * КонтроллерСостояниеЭДО - ЭлементФормы - элемент формы "декорация", "поле надписи", в заголовке которого будет отображаться состояние ЭДО.
//    * ГруппаСостояниеЭДО - ЭлементФормы - элемент формы "группа", которому может принадлежать КонтроллерСостояниеЭДО, необязательный параметр.
//    * МестоРазмещенияКоманд - ЭлементФормы, Массив - подменю, в котором отображаются команды ЭДО.
//
Функция ПараметрыОповещенияЭДО_ФормаДокумента() Экспорт
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Форма");
	ПараметрыОповещения.Вставить("ДокументСсылка");
	ПараметрыОповещения.Вставить("КонтроллерСостояниеЭДО");
	ПараметрыОповещения.Вставить("ГруппаСостояниеЭДО");
	ПараметрыОповещения.Вставить("МестоРазмещенияКоманд");
	Возврат ПараметрыОповещения;
	
КонецФункции

// Обработчик события "ОбработкаОповещения" формы документа.
//
// Параметры:
//  ИмяСобытия - Строка - Имя события.
//  Параметр - Произвольный - Параметр сообщения. Могут быть переданы любые необходимые данные.
//  Источник - Произвольный - Источник события. Например, в качестве источника может быть указана другая форма.
//  ПараметрыОповещения - Структура - см. ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента.
//  РезультатыОбработкиОповещения - Структура - Выходной параметр. Содержит ключи:
//    * ИзменилосьСостояниеЭДО - Булево - Истина, если произошло изменение состояния ЭДО объекта учета, отображаемого 
//                                        в вызывающей форме.
//
Процедура ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения,
	РезультатыОбработкиОповещения = Неопределено) Экспорт

	РезультатыОбработкиОповещения = Новый Структура;
	РезультатыОбработкиОповещения.Вставить("ИзменилосьСостояниеЭДО", Ложь);
	
	Если ИмяСобытия = "ОбновитьСостояниеЭД"
		ИЛИ ИмяСобытия = "ОбновитьСостояниеПриглашений" Тогда
		
		ДокументСсылка = ПараметрыОповещения.ДокументСсылка;
		Форма = ПараметрыОповещения.Форма;
		
		Если ТипЗнч(Параметр) = Тип("Структура")
			И Параметр.Свойство("ДокументыУчета")
			И ТипЗнч(Параметр.ДокументыУчета) = Тип("Массив")
			И Параметр.ДокументыУчета.Найти(ДокументСсылка) = Неопределено Тогда
				
			Возврат;
				
		КонецЕсли;
		
		ИнтерфейсДокументовЭДОКлиентСервер.ЗаполнитьСостояниеЭДО_ФормаДокумента(ПараметрыОповещения);
		
		РезультатыОбработкиОповещения.ИзменилосьСостояниеЭДО = Истина;
		
	ИначеЕсли ИмяСобытия = "ОбновитьНаличиеЭДО" Тогда
		
		Форма = ПараметрыОповещения.Форма;
		МестоРазмещенияКоманд = ПараметрыОповещения.МестоРазмещенияКоманд;
		ОбновитьПиктограммуОповещенияЭДО(Форма, МестоРазмещенияКоманд);
		
	КонецЕсли;
	
КонецПроцедуры

// Обработка нажатия на гиперссылку "СостояниеЭДО" в форме документа
//
// Параметры:
//  Форма - УправляемаяФорма - Форма учетного документа.
//  СтандартнаяОбработка - Булево - Признак стандартной обработки нажатия на гиперссылку (устанавливается в Ложь).
//
Процедура КонтроллерСостояниеЭДОНажатие(Форма, СтандартнаяОбработка = Ложь) Экспорт
	
	СтандартнаяОбработка = Ложь;

	ПараметрыОбменаСКонтрагентами = Форма.ПараметрыОбменаСКонтрагентами;
	ДанныеСостоянияЭДО = ПараметрыОбменаСКонтрагентами.ДанныеСостоянияЭДОТекущие;
				
	Если ДанныеСостоянияЭДО.СуществуетАктуальныйДокумент Тогда

		ПараметрыОбъекта = НовыеПараметрыОбъектаУчетаДляПросмотраСтатусовДокументов();
		ПараметрыОбъекта.ОбъектУчета = Форма.Объект.Ссылка;
		ОткрытьФормуПросмотраСтатусовДокументов(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыОбъекта));
		
	ИначеЕсли Не ДанныеСостоянияЭДО.ЕстьПравоНастройки И ДанныеСостоянияЭДО.НеобходимаНастройка Тогда
		ПоказатьПредупреждение(, НСтр("ru='Необходима настройка электронного документооборота. Обратитесь к администратору.'"))
	Иначе
		Если Форма.Модифицированность Тогда
			Если ДанныеСостоянияЭДО.НеобходимаНастройка Тогда
				ТекстВопроса = НСтр("ru='Для того чтобы настроить ЭДО, нужно записать документ. Записать?'");			
			Иначе
				ТекстВопроса = НСтр("ru='Для того чтобы начать ЭДО, нужно записать документ. Записать?'");			
			КонецЕсли;
				
			ПараметрыОповещения = Новый Структура;
			ПараметрыОповещения.Вставить("Форма", Форма);
			Оповещение = Новый ОписаниеОповещения("КонтроллерСостояниеЭДОНажатиеПродолжить", ИнтерфейсДокументовЭДОКлиент, ПараметрыОповещения);
			
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, ,
				КодВозвратаДиалога.Отмена, НСтр("ru='Необходимо записать документ'"));
		
		Иначе
			ПараметрыОбъекта = НовыеПараметрыОбъектаУчетаДляПросмотраСтатусовДокументов();
			ПараметрыОбъекта.ОбъектУчета = Форма.Объект.Ссылка;
			ОткрытьФормуПросмотраСтатусовДокументов(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыОбъекта));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Описание оповещения для процедуры КонтроллерСостояниеЭДОНажатие
//
// Параметры:
//  Результат - КодВозвратаДиалога.ОК, КодВозвратаДиалога.Отмена - результат диалога с пользователем.
//  Параметры - Структура - дополнительные параметры.
//    * Форма - ФормаКлиентскогоПриложения - Форма учетного документа, из которого вызван диалог.
//
Процедура КонтроллерСостояниеЭДОНажатиеПродолжить(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Параметры.Форма.Записать();
		ОткрытьЭлектронныйДокументОбъектаУчета(Параметры.Форма.Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗаписи_ФормаДокумента(Форма, ПараметрыЗаписи) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыОбменаСКонтрагентами")
		И Форма.ПараметрыОбменаСКонтрагентами.КонтекстОперации <> Неопределено Тогда
		ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(Форма.ПараметрыОбменаСКонтрагентами.КонтекстОперации);
	КонецЕсли;
	
	Оповестить("ОбновитьТекущиеДелаЭДО");
	
КонецПроцедуры

#КонецОбласти

#Область ФормаСправочника

Функция ПараметрыОповещенияЭДО_ФормаСправочника() Экспорт
	
	ПараметрыОповещения = Новый Структура("Форма, МестоРазмещенияКоманд");
	ПараметрыОповещения.Вставить("ЕстьОбработчикОбновитьКомандыЭДО", Ложь);
	
	Возврат ПараметрыОповещения;
	
КонецФункции

Процедура ОбработкаОповещения_ФормаСправочника(ИмяСобытия, Параметр, Источник, ПараметрыОповещения) Экспорт
	
	Если ИмяСобытия = "ОбновленСписокУчетныхЗаписей1СЭДО" Тогда
		
		Форма = ПараметрыОповещения.Форма;
		Если ПараметрыОповещения.ЕстьОбработчикОбновитьКомандыЭДО Тогда
			Форма.ОтключитьОбработчикОжидания("Подключаемый_ОбновитьКомандыЭДО");
			Форма.ПодключитьОбработчикОжидания("Подключаемый_ОбновитьКомандыЭДО", 0.2, Истина);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ОбновитьНаличиеЭДО" Тогда
		
		МестоРазмещенияКоманд = ПараметрыОповещения.МестоРазмещенияКоманд;
		Форма = ПараметрыОповещения.Форма;
		ОбновитьПиктограммуОповещенияЭДО(Форма, МестоРазмещенияКоманд);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПечатьДокументов

Процедура ПечатьЭлектронногоДокумента(Сообщение, СообщениеОтвета = Неопределено) Экспорт
	
	ПредставлениеЭлектронногоДокумента = ИнтерфейсДокументовЭДОВызовСервера.ПредставлениеСообщения(Сообщение, СообщениеОтвета);
	
	Если ПредставлениеЭлектронногоДокумента <> Неопределено Тогда
		
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЭлектронныйДокумент,КарточкаДокумента");
	
		ОписаниеПечатнойФормы = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "ЭлектронныйДокумент"); 
		ОписаниеПечатнойФормы.ТабличныйДокумент = ИнтерфейсДокументовЭДОВызовСервера.ПредставлениеСообщения(Сообщение, СообщениеОтвета);
		ОписаниеПечатнойФормы.СинонимМакета = НСтр("ru = 'Электронный документ'");
		
	Иначе
		
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("КарточкаДокумента");
	
	КонецЕсли;
	
	ОписаниеПечатнойФормы = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "КарточкаДокумента"); 
	ОписаниеПечатнойФормы.ТабличныйДокумент = ИнтерфейсДокументовЭДОВызовСервера.ПредставлениеКарточкиСообщения(Сообщение, СообщениеОтвета);
	ОписаниеПечатнойФормы.СинонимМакета = НСтр("ru = 'Карточка электронного документа'");
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);

КонецПроцедуры

#КонецОбласти

#Область ОтражениеВУчете

// Показывает окно для ввод (выбора) значения учетного документа.
// Выбранное значение передается в оповещение о выборе.
//
// Параметры:
//  Настройки - Структура - настройки подбора учетного документа.
//   * ИмяОбъектаМетаданных - Строка - полное имя объекта метаданных для выбора.
//   * ИмяТипаСсылки - Строка - имя типа ссылки для выбора. Например, "ДокументСсылка.ПоступлениеТоваровУслуг".
//   * Контрагент - ОпределяемыйТип.УчастникЭДО - контрагент по электронному документу.
//   * Организация - ОпределяемыйТип.Организация - организация по электронному документу.
//  ОповещениеОВыборе - ОписаниеОповещения - оповещение, которое выполняется при вводе (выборе) значения.
//
Процедура ПоказатьПодборУчетногоДокумента(Знач Настройки, Знач ОповещениеОВыборе) Экспорт
	
	СтандартнаяОбработка = Истина;
	ОбменСКонтрагентамиКлиентПереопределяемый.ПриПодбореУчетногоДокумента(Настройки, ОповещениеОВыборе, СтандартнаяОбработка);
	
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	Подсказка = НСтр("ru = 'Укажите документ отражения в учете'");
	ПоказатьВводЗначения(ОповещениеОВыборе,, Подсказка, Новый ОписаниеТипов(Настройки.ИмяТипаСсылки));
	
КонецПроцедуры

#КонецОбласти

#Область ПереопределениеМеханизмаПечатиБСП

// См. УправлениеПечатьюКлиентПереопределяемый.ПечатьДокументовОбработкаНавигационнойСсылки
Процедура ПечатьДокументовОбработкаНавигационнойСсылки(Форма, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ОбъектыУчета = Форма.Параметры.ПараметрКоманды;
	
	Если Не ЗначениеЗаполнено(ОбъектыУчета) Тогда 
		 Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ОбъектыУчета) <> Тип("Массив") Тогда
		 ОбъектыУчета = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектыУчета);
	КонецЕсли;  
		
	Команда = ИнтерфейсДокументовЭДОВызовСервера.КомандаПечатиОбъекта(ОбъектыУчета[0], Форма.НастройкиПечатныхФорм[0].ИмяМакета);
	
	Если Не ЗначениеЗаполнено(Команда) Тогда
		Возврат;	
	КонецЕсли;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ВнутреннийЭДОПрогрессПодписания" Тогда
		
		Если ОбъектыУчета.Количество() = 1 Тогда 
			
			ОбъектУчета = ОбъектыУчета[0];
			
			ВидВнутреннегоДокумента = ИнтерфейсДокументовЭДОВызовСервера.НайтиСоздатьВидВнутреннегоДокумента(ОбъектУчета, Команда);
			АктуальныйЭлектронныйДокумент = ИнтеграцияЭДОВызовСервера.АктуальныйЭлектронныйДокументОбъектаУчета(ОбъектУчета, ВидВнутреннегоДокумента);		
			
			Если ЗначениеЗаполнено(АктуальныйЭлектронныйДокумент) Тогда 
				ОткрытьЭлектронныйДокумент(АктуальныйЭлектронныйДокумент);
			КонецЕсли;	
				
		Иначе
			
			МассивПараметров = Новый Массив;	
			
			Для Каждого ОбъектУчета Из ОбъектыУчета Цикл
				
				ПараметрыЭД = ИнтеграцияЭДОВызовСервера.ОписаниеОбъектаУчета(ОбъектУчета);
				ВидВнутреннегоДокумента = ИнтерфейсДокументовЭДОВызовСервера.НайтиСоздатьВидВнутреннегоДокумента(ОбъектУчета, Команда);

				ПараметрыОбъекта = ИнтерфейсДокументовЭДОКлиент.НовыеПараметрыОбъектаУчетаДляПросмотраСтатусовДокументов();
				ПараметрыОбъекта.ОбъектУчета = ОбъектУчета;
				ПараметрыОбъекта.Организация = ПараметрыЭД.Организация;
				ПараметрыОбъекта.ВидДокумента = ВидВнутреннегоДокумента;
				
				МассивПараметров.Добавить(ПараметрыОбъекта);
				
			КонецЦикла;
			
			ОткрытьФормуПросмотраСтатусовДокументов(МассивПараметров);
			
		КонецЕсли;
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "Реклама1СЭДОВнутренний" Тогда
		
		ЕстьПравоНастройкиОбмена = ИнтерфейсДокументовЭДОВызовСервера.ЕстьПравоНастройкиОбмена();

		Если ЕстьПравоНастройкиОбмена Тогда
			ПараметрыЭД = ИнтеграцияЭДОВызовСервера.ОписаниеОбъектаУчета(ОбъектыУчета[0]);
	
			Оповещение = Новый ОписаниеОповещения("ЗавершениеРаботыМастераНастроекВнутреннегоЭДОСобытие", ЭтотОбъект);
			
			Организация = ПараметрыЭД.Организация;
			ВидДокумента = ИнтерфейсДокументовЭДОВызовСервера.НайтиСоздатьВидВнутреннегоДокумента(ОбъектыУчета[0], Команда);
			
			НастройкиЭДОКлиент.НастроитьВнутреннийЭлектронныйДокументооборот(Организация, ВидДокумента, Оповещение);
		Иначе 
			КонтекстОперации = ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики();
			ВидОперации = НСтр("ru = 'Формирование внутреннего электронного документа'");
			ВидОшибки = ИнтерфейсДокументовЭДОКлиентСервер.ВидОшибкиНетПравДляНастройкиЭДО();
			ТекстОшибки = НСтр("ru = 'Не настроен внутренний документооборот'");
			Ошибка = ОбработкаНеисправностейБЭДКлиент.НоваяОшибка(ВидОперации, ВидОшибки, ТекстОшибки, ТекстОшибки);
			ОбработкаНеисправностейБЭДКлиент.ДобавитьОшибку(КонтекстОперации, Ошибка,
				ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ОбменСКонтрагентами, Ложь);
			ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(КонтекстОперации);
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// См. УправлениеПечатьюКлиентПереопределяемый.ПечатьДокументовВыполнитьКоманду
Процедура ПечатьДокументовВыполнитьКоманду(Форма, Команда, ПродолжитьВыполнениеНаСервере, ДополнительныеПараметры) Экспорт
	
	Если Команда.Имя = "ВнутреннийЭДООтправитьНаПодпись" Тогда
		
		ОбъектыПечати = Форма.ОбъектыПечати.ВыгрузитьЗначения();
		
		ПараметрыЭД = ИнтеграцияЭДОВызовСервера.ОписаниеОбъектаУчета(ОбъектыПечати[0]);	
		Команда = ИнтерфейсДокументовЭДОВызовСервера.КомандаПечатиОбъекта(ОбъектыПечати[0], Форма.НастройкиПечатныхФорм[0].ИмяМакета);
		
		Если Не ЗначениеЗаполнено(Команда) Тогда
			Возврат;
		КонецЕсли;
		
		ВидВнутреннегоДокумента = ИнтерфейсДокументовЭДОВызовСервера.НайтиСоздатьВидВнутреннегоДокумента(ОбъектыПечати[0], Команда);
		
		КлючНастройки = Новый Структура;
		КлючНастройки.Вставить("Организация", ПараметрыЭД.Организация);
		КлючНастройки.Вставить("ВидВнутреннегоДокумента", ВидВнутреннегоДокумента);

		Параметр = Новый Структура;
		Параметр.Вставить("КлючНастройки", КлючНастройки);
		
		СформироватьЭДИзФормыПечатиБСП(Форма, Параметр);  
		
	ИначеЕсли Команда.Имя = "ЭДОСформироватьПроизвольныйДокумент" Тогда
		
		ОбъектыПечати = Форма.Параметры.ПараметрКоманды;

		ПараметрыФормы = Новый Структура;

		НастройкиПечатныхФорм = Форма.НастройкиПечатныхФорм.НайтиСтроки(Новый Структура("Печатать", Истина));
		
		Если НастройкиПечатныхФорм.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОбъектыПечати) И ТипЗнч(ОбъектыПечати) = Тип("Массив") Тогда
			СуществуютЭД = ИнтеграцияЭДОВызовСервера.ЭлектронныеДокументыОбъектовУчета(ОбъектыПечати[0]).Количество() <> 0;
			
			Если СуществуютЭД Тогда 
				ПараметрыФормы = Новый Структура("ДокументОснование", ОбъектыПечати[0]);
				ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.СписокСформированныхДокументов", ПараметрыФормы, 
					Форма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НастройкиПечатныхФорм.Количество() = 1 Тогда
			
			ПараметрыДокумента = Новый Структура;
			ТабличныйДокумент = Форма[Форма.НастройкиПечатныхФорм[0].ИмяРеквизита];
			
			ПараметрыФормы.Вставить("ТабличныйДокумент", ТабличныйДокумент);
			ПараметрыФормы.Вставить("НаименованиеФайла", НастройкиПечатныхФорм[0].Название);
			ПараметрыФормы.Вставить("Расширение", "pdf");
			
			Если ЗначениеЗаполнено(ОбъектыПечати) И ТипЗнч(ОбъектыПечати) = Тип("Массив") Тогда
				ПараметрыФормы.Вставить("Основание", ОбъектыПечати[0]); 
			КонецЕсли;
			
			ОткрытьФормуЭлектронногоДокумента(ПараметрыФормы); 
			
		Иначе
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Основание", ОбъектыПечати[0]);
			ДанныеДокументов = Новый Массив;
		
			Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
				
				ТабличныйДокумент = Форма[НастройкаПечатнойФормы.ИмяРеквизита];
				
				ПараметрыДокумента.Вставить("ТабличныйДокумент", ТабличныйДокумент);
				ПараметрыДокумента.Вставить("НаименованиеФайла",НастройкаПечатнойФормы.Название);
				ПараметрыДокумента.Вставить("Расширение", "pdf"); 
				
				ДанныеДокументов.Добавить(ПараметрыДокумента);
				
			КонецЦикла;
			
			ДополнительныеПараметры.Вставить("ДанныеДокументов", ДанныеДокументов);
			
			ШаблонВопроса = НСтр("ru='Будет сформировано %1 электронных документа. Продолжить?'");
			ТекстВопроса = СтрШаблон(ШаблонВопроса, НастройкиПечатныхФорм.Количество());
			
			Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОФормированииДокументов", ЭтотОбъект, ДополнительныеПараметры);
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, НСтр("ru='Формирование документов'"));
		КонецЕсли;	  
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеОтветаНаВопросОФормированииДокументов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Для Каждого Документ Из ДополнительныеПараметры.ДанныеДокументов Цикл
			
			ПараметрыФормы = Новый Структура;
			
			ПараметрыФормы.Вставить("ДвоичныеДанныеФайла", Документ.ДвоичныеДанныеФайла);
			ПараметрыФормы.Вставить("НаименованиеФайла", Документ.НаименованиеФайла);
			ПараметрыФормы.Вставить("Расширение", Документ.Расширение);
			Если ЗначениеЗаполнено(ДополнительныеПараметры.ДокументОснование) Тогда
				ПараметрыФормы.Вставить("Основание", ДополнительныеПараметры.ДокументОснование); 
			КонецЕсли;
			
			ОткрытьФормуЭлектронногоДокумента(ПараметрыФормы); 
			
		КонецЦикла;
		
	КонецЕсли;
	
Конецпроцедуры

// См. УправлениеПечатьюКлиентПереопределяемый.ПечатьДокументовОбработкаОповещения
Процедура ПечатьДокументовОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	
	Если ИмяСобытия = "ВнутреннийЭДО_ОбновлениеСостоянияФормыПечатиБСП" Тогда
		
		ИнтерфейсДокументовЭДОКлиентСервер.ОбновитьФормуПечатиДокументовБСП(Форма);
		Форма.ПодключитьОбработчикОжидания("ОбновитьТекущуюПечатнуюФорму",0.1,Истина);
		
	ИначеЕсли ИмяСобытия = "ЗавершениеРаботыМастераНастроекВнутреннегоЭДО" Тогда
		
		Оповестить("ВнутреннийЭДО_ОбновлениеСостоянияФормыПечатиБСП");
		СформироватьЭДИзФормыПечатиБСП(Форма, Параметр);
				
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьЭДИзФормыПечатиБСП(Форма, Параметры = Неопределено) Экспорт
	
	ОбъектыПечати = Форма.ОбъектыПечати.ВыгрузитьЗначения();

	Команда = ИнтерфейсДокументовЭДОВызовСервера.КомандаПечатиОбъекта(ОбъектыПечати[0], Форма.НастройкиПечатныхФорм[0].ИмяМакета);
	ВидВнутреннегоДокумента = ИнтерфейсДокументовЭДОВызовСервера.НайтиСоздатьВидВнутреннегоДокумента(ОбъектыПечати[0], Команда);
	
	Если Не ЗначениеЗаполнено(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыполненияДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	
	Если ЗначениеЗаполнено(Параметры) Тогда
		
		КлючиНастроекОбъектов = Новый Соответствие;
		КлючНастройки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "КлючНастройки");
		
		ПодписантыОбъектов = Новый Соответствие;
		Подписанты = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Подписанты");
		
		МаршрутыПодписанияОбъектов = Новый Соответствие;
		МаршрутПодписания = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Маршрут");
		
		Для Каждого ОбъектПечати Из ОбъектыПечати Цикл
			
			Если ЗначениеЗаполнено(КлючНастройки) Тогда
				МассивКлючейНастроек = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КлючНастройки);
				КлючиНастроекОбъектов.Вставить(ОбъектПечати, МассивКлючейНастроек);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Подписанты) Тогда
				ПодписантыОбъектов = Новый Соответствие;
				ПодписантыОбъектов.Вставить(ОбъектПечати, Подписанты);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(МаршрутПодписания) Тогда
				МаршрутыПодписанияОбъектов = Новый Соответствие;
				МаршрутыПодписанияОбъектов.Вставить(ОбъектПечати, МаршрутПодписания);
			КонецЕсли;
			
		КонецЦикла;		
		
	КонецЕсли;
	
	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Сформировать"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Подписать"));				
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ПодготовитьКОтправке"));
		
	ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ОбъектыУчета = ОбъектыПечати;
	ПараметрыВыполненияДействийПоЭДО.МаршрутыПодписанияОбъектов = МаршрутыПодписанияОбъектов;
	ПараметрыВыполненияДействийПоЭДО.ПодписантыОбъектов = ПодписантыОбъектов;
	ПараметрыВыполненияДействийПоЭДО.КлючиНастроекОбъектов = КлючиНастроекОбъектов;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ОбъектыУчета", ОбъектыПечати);
	ПараметрыОповещения.Вставить("ПараметрыВыполненияДействийПоЭДО", ПараметрыВыполненияДействийПоЭДО);	
	ПараметрыОповещения.Вставить("ОповещениеУспешногоЗавершения",
		Новый ОписаниеОповещения("ЗавершениеФормированияЭлектронныхДокументовСобытие", ЭтотОбъект));

	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, ПараметрыОповещения);
	
	ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(Оповещение, ПараметрыВыполненияДействийПоЭДО);

КонецПроцедуры

Процедура ЗавершениеФормированияЭлектронныхДокументовСобытие(Результат, ДополнительныеПараметры) Экспорт
	Оповестить("ВнутреннийЭДО_ОбновлениеСостоянияФормыПечатиБСП");
КонецПроцедуры

Процедура ЗавершениеРаботыМастераНастроекВнутреннегоЭДОСобытие(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Оповестить("ЗавершениеРаботыМастераНастроекВнутреннегоЭДО", Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаНавигационнойСсылкиВФормеПечатиБСП(НавигационнаяСсылка, Параметры = Неопределено) Экспорт
	
	Если НавигационнаяСсылка = "Реклама1СЭДО" Тогда
		МассивСсылок = Параметры;
		Если ЗначениеЗаполнено(МассивСсылок) Тогда
			ОткрытьЭлектронныйДокументОбъектаУчета(МассивСсылок[0]);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеДокументовИзПечатныхФорм

Процедура ОтправитьПечатнуюФормуПоЭДО(ПараметрКоманды) Экспорт

	СписокКоманд = Новый СписокЗначений;
	КомандыПечати = ИнтерфейсДокументовЭДОВызовСервера.ДоступныеКомандыПечатиОбъекта(ПараметрКоманды);
	
	Для Каждого КомандаПечати Из КомандыПечати Цикл
		СписокКоманд.Добавить(КомандаПечати, КомандаПечати.Представление);
	КонецЦикла;
	
	Если СписокКоманд.Количество() = 1 Тогда
		
		 ПослеВыбораПечатнойФормы(СписокКоманд[0], ПараметрКоманды);
		
	Иначе
	
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораПечатнойФормы", ЭтотОбъект, ПараметрКоманды);
		СписокКоманд.ПоказатьВыборЭлемента(Оповещение, НСтр("ru = 'Выберите печатную форму для формирования'"));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеВыбораПечатнойФормы(Результат, ОбъектПечати) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	РезультатПечати = ИнтерфейсДокументовЭДОВызовСервера.ПечатныеФормыДокументов(Результат.Значение, 
	ОбъектПечати, ТипФайлаТабличногоДокумента.PDF);
	
	Если РезультатПечати.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатПечати.Количество() = 1 Тогда
		
		ПараметрыФормы = Новый Структура;   
		ПараметрыФормы.Вставить("ДвоичныеДанныеФайла", РезультатПечати[0].ДвоичныеДанные);
		ПараметрыФормы.Вставить("НаименованиеФайла", СтрЗаменить(РезультатПечати[0].ИмяФайла, ".pdf", ""));
		ПараметрыФормы.Вставить("Расширение", "pdf");
		
		Если ЗначениеЗаполнено(ОбъектПечати) Тогда
			ПараметрыФормы.Вставить("Основание", ОбъектПечати); 
		КонецЕсли;
		
		ОткрытьФормуЭлектронногоДокумента(ПараметрыФормы); 
	Иначе
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Основание", ОбъектПечати);
		ДанныеДокументов = Новый Массив;
		
		Для Каждого ПечатныйДокумент Из РезультатПечати Цикл
			
			ПараметрыДокумента = Новый Структура;
			
			ПараметрыДокумента.Вставить("ДвоичныеДанныеФайла", ПечатныйДокумент.ДвоичныеДанные);
			ПараметрыДокумента.Вставить("НаименованиеФайла", СтрЗаменить(ПечатныйДокумент.ИмяФайла, ".pdf", ""));
			ПараметрыДокумента.Вставить("Расширение", "pdf");  	
			
			ДанныеДокументов.Добавить(ПараметрыДокумента);
			
		КонецЦикла;
		
		ДополнительныеПараметры.Вставить("ДанныеДокументов", ДанныеДокументов);
		
		ШаблонВопроса = НСтр("ru='Будет сформировано %1 электронных документа. Продолжить?'");
		ТекстВопроса = СтрШаблон(ШаблонВопроса, РезультатПечати.Количество());
		
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОФормированииДокументов", 
			ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, НСтр("ru='Формирование документов'"));
		
	КонецЕсли;

КонецПроцедуры    

#КонецОбласти

#Область ОбработкаЭлектронныхДокуметновОбъектовУчета

// Создает, утверждает, подписывает и отправляет электронный документ. Выполняются только те действия,
// которые действительно требуются для электронного документа (еще не были выполнены и допустимы). Используется как для
// исходящих, так и для входящих документов.
//
// Параметры:
//  ОбъектыУчета       - Массив Из ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - ссылка на объект учета, электронные 
//                       документы которого нужно обработать.
//  ОписаниеОповещения - ОписаниеОповещения - обработчик оповещения, который вызывается по окончании операции.
//						 В качестве результата возвращается ЭлектронныеДокументыЭДОКлиентСервер.НовыйИтогВыполненияДействийПоЭДО().
Процедура ВыполнитьКомплекснуюОбработкуАктуальныхЭлектронныхДокументовОбъектовУчета(ОбъектыУчета, ОписаниеОповещения = Неопределено) Экспорт
	
	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Сформировать"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Утвердить"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.СформироватьОтвет"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Подписать"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.ПодготовитьКОтправке"));
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Отправить"));
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ОбъектыУчета", ОбъектыУчета);
	ПараметрыОповещения.Вставить("ОповещениеУспешногоЗавершения", ОписаниеОповещения);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, ПараметрыОповещения);
	
	ПараметрыВыполненияДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполненияДействийПоЭДО.НаборДействий = НаборДействий;
	ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ОбъектыУчета = ОбъектыУчета;
	
	ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(Оповещение, ПараметрыВыполненияДействийПоЭДО);
	
КонецПроцедуры

// Отклоняет актуальный для переданного учетного объекта электронный документ. Если в процессе выполнения метода 
// возникают ошибки, они обрабатываются библиотекой, вызывающей стороне не возвращаются.
//
// Параметры:
//  ОбъектыУчета       - Массив Из ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - ссылка на объект учета. Имеет смысл 
//  					 передавать только входящие документы.
//  ОписаниеОповещения - ОписаниеОповещения - оповещение вызывается по окончании выполнения операции. В качестве результата
//                       возвращается ЭлектронныеДокументыЭДОКлиентСервер.НовыйИтогВыполненияДействийПоЭДО().
//
Процедура ОтклонитьАктуальныеЭлектронныеДокументыОбъектовУчета(ОбъектыУчета, ОписаниеОповещения) Экспорт
	
	НаборДействий = Новый Соответствие;	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Отклонить"));
		
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОбъектыУчета", ОбъектыУчета);
	ДополнительныеПараметры.Вставить("НаборДействий", НаборДействий);
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения", ОписаниеОповещения);

	Обработчик = Новый ОписаниеОповещения("ВыполнитьДействияПоЭДОПослеВводаСтроки", ЭтотОбъект, ДополнительныеПараметры);
	
	ДополнительныеПараметры = ОбщегоНазначенияБЭДКлиент.ПараметрыВводаСтроки();
	ДополнительныеПараметры.ЗаголовокФормы = НСтр("ru = 'Укажите причины отклонения документа'");
	ДополнительныеПараметры.НазваниеКнопкиПоУмолчанию = НСтр("ru = 'Отклонить'");
	ДополнительныеПараметры.Многострочность = Истина;
	ДополнительныеПараметры.Обязательность = Истина;
	ДополнительныеПараметры.КомментарийОбязательностиВвода =
		НСтр("ru = 'Для отклонения документа необходимо указать причину.'");
	ОбщегоНазначенияБЭДКлиент.ПоказатьВводСтрокиБЭД(Обработчик, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область СоставПакета

Процедура ЭлементУправленияПакета_ОбработкаНавигационнойСсылки(Форма, Элемент, НавигационнаяСсылка, СтандартнаяОбработка) Экспорт
			
	СтандартнаяОбработка = Ложь;
	
	Если СтрНайти(НавигационнаяСсылка, "Open_") > 0 Тогда
		Форма.Подключаемый_СоставПакета_ОбработкаНавигационнойСсылкиНаСервере(НавигационнаяСсылка);
		Форма.Прочитать();
	ИначеЕсли НавигационнаяСсылка = "Show" Тогда
		
		СоставМеню = Новый СписокЗначений;		

		ГраницыВывода = ИнтерфейсДокументовЭДОКлиентСервер.ГраницыВыводаДокументовПакета(Форма.СоставПакета,
			Форма.Объект.Ссылка, Форма.КоличествоОтображаемыхДокументовПакета);
		
		ИндексДокумента = 0;		
		
		Для Каждого Документ Из Форма.СоставПакета Цикл
			ИндексДокумента = ИндексДокумента + 1;
			Если ИндексДокумента >= ГраницыВывода.ИндексНачалоВыводаЭлементов 
				И ИндексДокумента <= ГраницыВывода.ИндексКонцаВыводаЭлементов  Тогда
				Продолжить;
			КонецЕсли;
			Представление = ИнтерфейсДокументовЭДОВызовСервера.ПредставлениеДокумента(Документ.Значение);
			СоставМеню.Добавить(Документ.Значение, Представление);	
		КонецЦикла;	
		
		ДополнительныеПараметры = новый Структура("ИдентификаторПакета", Форма.ИдентификаторПакета);
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПослеВыбораДокументаПакетаИзМенюЕще", ЭтотОбъект, ДополнительныеПараметры);
			
		Форма.ПоказатьВыборИзМеню(ОписаниеОповещенияОЗавершении, СоставМеню, Элемент);		
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЭлементУправленияПакета_Нажатие(Форма, Элемент, СтандартнаяОбработка) Экспорт

	Если Элемент = Форма.Элементы["ЭлементУправленияПакета_ЭлементУправленияПакета_ДобавитьДокумент"] Тогда
		
		СписокПунктовМеню = Новый СписокЗначений;
		СписокПунктовМеню.Добавить("ДобавитьВПакетФайлСКомпьютера" , НСтр("ru = 'Файл с компьютера'"));
		СписокПунктовМеню.Добавить("ДобавитьВПакетПрисоединенныйФайл" , НСтр("ru = 'Файл из хранилища'"));
		СписокПунктовМеню.Добавить("ДобавитьВПакетДокументИнформационнойБазы" , НСтр("ru = 'Документ информационной базы'"));
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИдентификаторПакета", Форма.ИдентификаторПакета);
		ДополнительныеПараметры.Вставить("ЭлектронныйДокумент", Форма.Объект.Ссылка);
		ДополнительныеПараметры.Вставить("Отправитель", Форма.Объект.Организация);
		ДополнительныеПараметры.Вставить("Получатель", Форма.Объект.Контрагент);
		ДополнительныеПараметры.Вставить("Договор", Форма.Объект.ДоговорКонтрагента);
		ДополнительныеПараметры.Вставить("ОбъектыУчета", Новый Массив);
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПослеВыбораСпособаДобавленияДокументаВПакет",
			ЭтотОбъект, ДополнительныеПараметры);
			
		Форма.ПоказатьВыборИзМеню(ОписаниеОповещенияОЗавершении, СписокПунктовМеню, Элемент);
		
	ИначеЕсли СтрНайти(Элемент.Имя, "ЭлементУправленияПакета_УдалитьДокумент_") > 0 Тогда
		ИндексДокумента = Число(СтрЗаменить(Элемент.Имя, "ЭлементУправленияПакета_УдалитьДокумент_", "")); 
		ДокументКУдалениюИзПакета = Форма.ОтображаемыеДокументыПакета[ИндексДокумента - 1].Значение;
		
		КонтекстДиагностики = ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики();
		ИнтерфейсДокументовЭДОВызовСервера.УдалитьДокументИзПакета(Форма.ИдентификаторПакета,
			ДокументКУдалениюИзПакета, КонтекстДиагностики);
			
		Если ОбработкаНеисправностейБЭДКлиентСервер.ЕстьОшибки(КонтекстДиагностики) Тогда
			ПоказатьПредставлениеОшибокКонтекстаДиагностики(КонтекстДиагностики);
		Иначе		
			Оповестить("УдалениеДокументаИзПакета", ДокументКУдалениюИзПакета, Форма.ИдентификаторПакета);	
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПоказатьПредставлениеОшибокКонтекстаДиагностики(КонтекстДиагностики) Экспорт
	
	Ошибки = ОбработкаНеисправностейБЭДКлиентСервер.ПолучитьОшибки(КонтекстДиагностики);
	
	МассивПредставленийОшибок = Новый Массив;
	
	Для Каждого Ошибка Из Ошибки Цикл
		МассивПредставленийОшибок.Добавить(Ошибка.ПодробноеПредставлениеОшибки);	
	КонецЦикла;		
	
	ТекстОшибки = СтрСоединить(МассивПредставленийОшибок, Символы.ПС);
	
	ПоказатьПредупреждение( ,ТекстОшибки, 0, НСтр("ru = 'Ошибка"));
	
КонецПроцедуры

Процедура ПослеВыбораДокументаПакетаИзМенюЕще(Документ, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Документ <> Неопределено Тогда		
		Оповестить("ВыборТекущегоДокументаПакета", Документ.Значение, ДополнительныеПараметры.ИдентификаторПакета);
	КонецЕсли;		
	
КонецПроцедуры

Процедура ПослеВыбораСпособаДобавленияДокументаВПакет(СпособДобавления, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если СпособДобавления = Неопределено Тогда		
		Возврат;
	ИначеЕсли ТипЗнч(СпособДобавления) = Тип("ЭлементСпискаЗначений") Тогда
		СпособДобавления = СпособДобавления.Значение;
	КонецЕсли;	
	
	Если СпособДобавления = "ДобавитьВПакетФайлСКомпьютера" Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьДокументВПакетИзФайлаНаДискеЗавершениеВыбораФайла",
			ЭтотОбъект, ДополнительныеПараметры);
		НачатьПомещениеФайла(ОписаниеОповещения,,,, Новый УникальныйИдентификатор());
		
	ИначеЕсли СпособДобавления = "ДобавитьВПакетПрисоединенныйФайл" Тогда
		
		Параметры = ИнтеграцияБСПБЭДКлиент.НовыеПараметрыВыбораФайловИзОбщегоХранилища();
		Параметры.ЗакрыватьПриВыборе = Истина;
		Параметры.МножественныйВыбор = Ложь;		
		
		Оповещение = Новый ОписаниеОповещения("ДобавитьДокументВПакетИзПрисоединенногоФайлаЗавершениеВыбора",
			ЭтотОбъект, ДополнительныеПараметры);
	
		ИнтеграцияБСПБЭДКлиент.ОткрытьФормуВыбораФайловИзОбщегоХранилища(Параметры, Оповещение);
		
	ИначеЕсли СпособДобавления = "ДобавитьВПакетДокументИнформационнойБазы" Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьВПакетДокументИнформационнойБазыЗавершениеВыбора",
			ЭтотОбъект, ДополнительныеПараметры);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИдентификаторПакета", ДополнительныеПараметры.ИдентификаторПакета);
		ПараметрыФормы.Вставить("ЭлектронныйДокумент", ДополнительныеПараметры.ЭлектронныйДокумент);
		ПараметрыФормы.Вставить("Организация", ДополнительныеПараметры.Отправитель);
		ПараметрыФормы.Вставить("Контрагент", ДополнительныеПараметры.Получатель);
		ПараметрыФормы.Вставить("Договор", ДополнительныеПараметры.Договор);
			
		ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.ДобавлениеДокументовВПакет", ПараметрыФормы, , , , ,
			Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьДокументВПакетИзФайлаНаДискеЗавершениеВыбораФайла(ФайлПомещен, АдресВХранилище, ВыбранныйФайл, ДополнительныеПараметры) Экспорт
	
	Если ФайлПомещен Тогда
		
		Файл = Новый Файл(ВыбранныйФайл);
		
		ПараметрыФайла = Новый Структура;		
		ПараметрыФайла.Вставить("ИмяФайла", Файл.Имя);
		ПараметрыФайла.Вставить("АдресХранилища", АдресВХранилище);
		
		СформироватьИДобавитьПроизвольныйДокументВПакетПолучитьРеквизиты(ДополнительныеПараметры, ПараметрыФайла);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьДокументВПакетИзПрисоединенногоФайлаЗавершениеВыбора(ВыбранноеЗначение, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(ВыбранноеЗначение, Новый УникальныйИдентификатор, Истина);
		
		ПараметрыФайла = Новый Структура;		
		ПараметрыФайла.Вставить("ИмяФайла", ДанныеФайла.ИмяФайла);
		ПараметрыФайла.Вставить("АдресХранилища", ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
		
		СформироватьИДобавитьПроизвольныйДокументВПакетПолучитьРеквизиты(ДополнительныеПараметры, ПараметрыФайла);
	
	КонецЕсли;
	
КонецПроцедуры


Процедура СформироватьИДобавитьПроизвольныйДокументВПакетПолучитьРеквизиты(ДополнительныеПараметры, ПараметрыФайла)

	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	ПараметрыОповещения.Вставить("ПараметрыФайла", ПараметрыФайла);
	
	Оповещение = Новый ОписаниеОповещения("СформироватьИДобавитьПроизвольныйДокументВПакетПолучитьРеквизитыЗавершение",
		ИнтерфейсДокументовЭДОКлиент, ПараметрыОповещения);
	
	ОписаниеФайла = РаботаСФайламиБЭДКлиентСервер.НовоеОписаниеФайла();
	ОписаниеФайла.ИмяФайла = ПараметрыФайла.ИмяФайла;
	ОписаниеФайла.ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПараметрыФайла.АдресХранилища);
	
	ОткрытьВводРеквизитовПроизвольногоДокумента(Оповещение, ПараметрыОповещения, ОписаниеФайла);

КонецПроцедуры

Процедура СформироватьИДобавитьПроизвольныйДокументВПакетПолучитьРеквизитыЗавершение(Результат, Параметры) Экспорт

	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.ДополнительныеПараметры.Вставить("Номер", Результат.Номер);
	Параметры.ДополнительныеПараметры.Вставить("Дата", Результат.Дата);
	Параметры.ДополнительныеПараметры.Вставить("Сумма", Результат.Сумма);
	Параметры.ДополнительныеПараметры.Вставить("ВидДокумента", Результат.ВидДокумента);
	
	СформироватьИДобавитьПроизвольныйДокументВПакет(Параметры.ДополнительныеПараметры, Параметры.ПараметрыФайла)

КонецПроцедуры

Процедура СформироватьИДобавитьПроизвольныйДокументВПакет(ДополнительныеПараметры, ПараметрыФайла)

	ПараметрыФормирования = Новый Структура;
	
	ПараметрыФормирования.Вставить("Организация", ДополнительныеПараметры.Отправитель);
	ПараметрыФормирования.Вставить("Контрагент", ДополнительныеПараметры.Получатель);
	ПараметрыФормирования.Вставить("Договор", ДополнительныеПараметры.Договор);
	ПараметрыФормирования.Вставить("Номер", ДополнительныеПараметры.Номер);
	ПараметрыФормирования.Вставить("Дата", ДополнительныеПараметры.Дата);
	ПараметрыФормирования.Вставить("Сумма", ДополнительныеПараметры.Сумма);
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры.ВидДокумента) Тогда
		ПараметрыФормирования.Вставить("ВидДокумента", ДополнительныеПараметры.ВидДокумента);
	КонецЕсли;
	
	ПараметрыФормирования.Вставить("ОбъектыУчета", Новый Массив);
	
	ИдентификаторПакета = ДополнительныеПараметры.ИдентификаторПакета;
	НовыйДокумент = ИнтерфейсДокументовЭДОВызовСервера.СоздатьПроизвольныйДокумент(ПараметрыФормирования, ПараметрыФайла);
	
	Если Не ЗначениеЗаполнено(НовыйДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыПакета = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НовыйДокумент);		
	ДокументыПакета.Добавить(ДополнительныеПараметры.ЭлектронныйДокумент);
		
	Если ЗначениеЗаполнено(ИдентификаторПакета) Тогда
		ИнтерфейсДокументовЭДОВызовСервера.ДобавитьДокументВПакет(ИдентификаторПакета, НовыйДокумент);
	Иначе
		ИдентификаторПакета = ИнтерфейсДокументовЭДОВызовСервера.СоздатьПакетДокументов(ДокументыПакета);
	КонецЕсли;
	Оповестить("ДобавлениеДокументаВПакет", ДокументыПакета, ИдентификаторПакета);
	
КонецПроцедуры

Процедура ДобавитьВПакетДокументИнформационнойБазыЗавершениеВыбора(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат <> Неопределено Тогда
		Оповестить("ВыборТекущегоДокументаПакета", ДополнительныеПараметры.ЭлектронныйДокумент, ДополнительныеПараметры.ИдентификаторПакета);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура НачатьОтправкуПолучениеДокументов(Форма, ОповещениеЗавершения = Неопределено) Экспорт
	
	ПраметрыОжидания = ОжиданиеОперацийБЭДКлиент.НовыеПараметры();
	ПраметрыОжидания.Заголовок = НСтр("ru = 'Выполняется обмен электронными документами'");
	
	КонтекстОжиданияОперации = ОжиданиеОперацийБЭДКлиент.НовыйКонтекст(ПраметрыОжидания);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("КонтекстОжиданияОперации", КонтекстОжиданияОперации);
	ПараметрыОповещения.Вставить("ОповещениеЗавершения", ОповещениеЗавершения);
	
	Оповещение = Новый ОписаниеОповещения("ОтправкаПолучениеЭДЗавершение", ИнтерфейсДокументовЭДОКлиент, ПараметрыОповещения);
	
	СинхронизацияЭДОКлиент.ВыполнитьОбменЭлектроннымиДокументами(Форма, КонтекстОжиданияОперации, Оповещение);
	
	#Если Не МобильныйКлиент Тогда
		Если ОжиданиеОперацийБЭДКлиент.ОперацияВыполняется(КонтекстОжиданияОперации) Тогда
			ОжиданиеОперацийБЭДКлиент.ОткрытьФормуОжидания(Форма, КонтекстОжиданияОперации);	
		КонецЕсли;
	#КонецЕсли	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаПолучениеЭДЗавершение(Результат, Параметры) Экспорт

	ОжиданиеОперацийБЭДКлиент.ЗакрытьФормуОжидания(Параметры.КонтекстОжиданияОперации);

	Оповестить("ОбновитьСостояниеЭД");
	
	Если Параметры.ОповещениеЗавершения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(Параметры.ОповещениеЗавершения);
	КонецЕсли;

КонецПроцедуры

Процедура ОткрытьФормуПросмотраСтатусовДокументов(ПараметрыОбъектовУчета)
	
	ПараметрыПросмотра = ИнтерфейсДокументовЭДОВызовСервера.ПараметрыПросмотраСтатусовЭлектронныхДокументов(ПараметрыОбъектовУчета);
	
	Если ПараметрыПросмотра.РежимПросмотра = "Документ" Тогда
		ИнтерфейсДокументовЭДОКлиент.ОткрытьЭлектронныйДокументОбъектаУчета(ПараметрыОбъектовУчета[0].ОбъектУчета);
	Иначе
		ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.СтатусыЭлектронныхДокументов",
			ПараметрыПросмотра,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОткрытьДокументыНаПодпись(Параметры) Экспорт
	
	ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.ДокументыНаПодпись", , Параметры.Источник,
		Параметры.Уникальность, Параметры.Окно);
	
КонецПроцедуры

// Открывает форму просмотра электронного документа.
// 
// Параметры:
// 	Сообщение - ДокументСсылка.СообщениеЭДО
Процедура ОткрытьЭлектронныйДокументСообщенияЭДО(Сообщение) Экспорт
	
	Если ТипЗнч(Сообщение) <> Тип("ДокументСсылка.СообщениеЭДО") Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныйДокумент = ИнтерфейсДокументовЭДОВызовСервера.ЭлектронныйДокументСообщенияЭДО(Сообщение);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ЭлектронныйДокумент);
	ПараметрыФормы.Вставить("Сообщение", Сообщение);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Ложь);
	
	ОткрытьФормуЭлектронногоДокумента(ПараметрыФормы);
	
КонецПроцедуры

// Открывает форму просмотра дерева электронных документов по указанному объекту.
// 
// Параметры:
// 	ОбъектУчетаСсылка - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - параметры объекта учета.
Процедура ОткрытьДеревоЭлектронныхДокументов(ОбъектУчета, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ИнтерфейсДокументовЭДОВызовСервера.ЕстьПравоЧтенияДокументов() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ОбъектУчета", ОбъектУчета);
	Если ДополнительныеПараметры = Неопределено Тогда
		ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.ДеревоЭлектронныхДокументов", ПараметрыФормы, , ОбъектУчета.УникальныйИдентификатор());
	Иначе
		Окно = Неопределено;
		Если ТипЗнч(ДополнительныеПараметры) = Тип("ПараметрыВыполненияКоманды")
			ИЛИ ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
			И ДополнительныеПараметры.Свойство("Окно") И ТипЗнч(ДополнительныеПараметры.Окно) = Тип("ОкноКлиентскогоПриложения") Тогда
			
			Окно = ДополнительныеПараметры.Окно;
		КонецЕсли;		

		ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.ДеревоЭлектронныхДокументов", ПараметрыФормы,
			ОбъектУчета, ОбъектУчета.УникальныйИдентификатор(), Окно);
		
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму просмотра электронного документа по указанному объекту учета.
// 
// Параметры:
// 	ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - параметры объекта учета.
Процедура ОткрытьЭлектронныйДокументОбъектаУчета(ОбъектУчета, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры <> Неопределено И
		ДополнительныеПараметры.Свойство("АдресФайла") Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("АдресФайла", ДополнительныеПараметры.АдресФайла);
		ПараметрыФормы.Вставить("Основание", ОбъектУчета); 
			
		ОткрытьФормуЭлектронногоДокумента(ПараметрыФормы); 
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОбъектаУчета = ИнтеграцияЭДОВызовСервера.ОписаниеОбъектаУчета(ОбъектУчета);
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОткрытьЭлектронныйДокументОбъектаУчетаЗавершение", ЭтотОбъект,
			ДополнительныеПараметры);
	
	Если ОписаниеОбъектаУчета.Направление = ПредопределенноеЗначение("Перечисление.НаправленияЭДО.Входящий") Тогда
		
		ОписаниеОбъектаУчета.Направление = ПредопределенноеЗначение("Перечисление.НаправленияЭДО.Исходящий");
		
		КлючНастроек = ИнтерфейсДокументовЭДОВызовСервера.КлючНастроекОтправкиОбъектаУчета(ОписаниеОбъектаУчета);
		НастройкиОтправки = ИнтерфейсДокументовЭДОВызовСервера.НастройкиОтправки(КлючНастроек);
		
		Если ЗначениеЗаполнено(НастройкиОтправки) Тогда
			ВыполнитьОбработкуОповещения(ОбработчикОповещения, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектУчета));
		Иначе
			НастройкиЭДОКлиент.НастроитьОбменСКонтрагентом(КлючНастроек);
		КонецЕсли;
	Иначе
		
		НаборОбъектовУчета = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектУчета);	
		ИнтеграцияЭДОКлиент.ПодготовитьКДокументообороту(НаборОбъектовУчета, ОбработчикОповещения);	
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму просмотра электронного документа по указанному объекту учета.
// 
// Параметры:
// 	НаборОбъектовУчета - Массив Из ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - объекты учета после проверки.
Процедура ОткрытьЭлектронныйДокументОбъектаУчетаЗавершение(НаборОбъектовУчета, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(НаборОбъектовУчета) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектУчета = НаборОбъектовУчета[0];
	
	ПараметрыПросмотра = ИнтерфейсДокументовЭДОВызовСервера.ПараметрыПросмотраЭлектронногоДокументаОбъектаУчета(ОбъектУчета, ДополнительныеПараметры);
	
	Если ЗначениеЗаполнено(ПараметрыПросмотра.ЭлектронныйДокумент) Тогда
		ОткрытьЭлектронныйДокумент(ПараметрыПросмотра.ЭлектронныйДокумент);
		Возврат;
	КонецЕсли;
	
	ПредварительныйПросмотр = Неопределено;
	Если Не ПараметрыПросмотра.Свойство("ПредварительныйПросмотр", ПредварительныйПросмотр) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПредварительныйПросмотр.РезультатПроверкиГотовности.Успех Тогда 
		Возврат;
	КонецЕсли;	
	
	Если Не ПредварительныйПросмотр.РезультатПоискаНастроек.Успех Тогда
		ПараметрыПоиска = ПредварительныйПросмотр.РезультатПоискаНастроек.ПараметрыПоиска;

		Оповещение = Новый ОписаниеОповещения("ОткрытьЭлектронныйДокументПослеСозданияНастроек", ЭтотОбъект, ПараметрыПоиска);
		Если ПараметрыПоиска.Направление =  ПредопределенноеЗначение("Перечисление.НаправленияЭДО.Внутренний") Тогда
			ОписаниеВида = НастройкиЭДОКлиент.НовоеОписаниеВидаВнутреннегоДокумента();
			ОписаниеВида.ОбъектУчета = ПараметрыПоиска.КлючОсновнойНастройкиВнутреннегоЭДО.ОбъектУчета;
			НеЗаданОсновнойВид = ПредварительныйПросмотр.РезультатПоискаНастроек.НеУказанОсновнойВидДокумента;
			Если НеЗаданОсновнойВид Тогда
				Параметры = ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыПроблемПриОбработкеДокументов();
				ОписаниеОбъектаУчета = ПредварительныйПросмотр.РезультатПоискаНастроек.ОписаниеОбъектаУчета;
				СтруктураОшибки = Новый Структура("ОписаниеОбъектаУчета, ОсновнойВидНеУстановлен", ОписаниеОбъектаУчета, Истина);
				ОшибкиФормирования = Новый Массив;
				ОшибкиФормирования.Добавить(СтруктураОшибки);
				
				Параметры.АдресСведенийОбОшибках = ПоместитьВоВременноеХранилище(ОшибкиФормирования);
				Параметры.СписокДокументовКОтправке.Добавить(ОбъектУчета);
				
				Оповещение = Новый ОписаниеОповещения("ОткрытьЭлектронныйДокументПослеРедактированияНастроек",
					ЭтотОбъект, ОбъектУчета);
				ПоказатьПроблемыПриОбработкеДокументов(Оповещение, Параметры);
				Возврат;
			КонецЕсли;
			
			Если ПредварительныйПросмотр.РезультатПоискаНастроек.ФормированиеЗапрещено Тогда
				Параметры = ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыПроблемПриОбработкеДокументов();
				ОписаниеОбъектаУчета = ПредварительныйПросмотр.РезультатПоискаНастроек.ОписаниеОбъектаУчета;
				СтруктураОшибки = Новый Структура("ОписаниеОбъектаУчета, ФормированиеЗапрещено", ОписаниеОбъектаУчета, Истина);
				ОшибкиФормирования = Новый Массив;
				ОшибкиФормирования.Добавить(СтруктураОшибки);
				
				Параметры.АдресСведенийОбОшибках = ПоместитьВоВременноеХранилище(ОшибкиФормирования);
				Параметры.СписокДокументовКОтправке.Добавить(ОбъектУчета);
				
				Оповещение = Новый ОписаниеОповещения("ОткрытьЭлектронныйДокументПослеРедактированияНастроек",
					ЭтотОбъект, ОбъектУчета);
				ПоказатьПроблемыПриОбработкеДокументов(Оповещение, Параметры);
				Возврат;
			КонецЕсли;
			НастройкиЭДОКлиент.НастроитьВнутреннийЭлектронныйДокументооборот(
				ПараметрыПоиска.КлючОсновнойНастройкиВнутреннегоЭДО.Организация, ОписаниеВида, Оповещение);
			
		ИначеЕсли ПараметрыПоиска.Направление = ПредопределенноеЗначение("Перечисление.НаправленияЭДО.Интеркампани") Тогда
			НастройкиЭДОКлиент.ОткрытьНастройкиИнтеркампани(ПараметрыПоиска.КлючНастроекИнтеркампани.Организация);
		Иначе
			Если ПредварительныйПросмотр.РезультатПоискаНастроек.ФормированиеЗапрещено Тогда
				Параметры = ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыПроблемПриОбработкеДокументов();
				ОписаниеОбъектаУчета = ПредварительныйПросмотр.РезультатПоискаНастроек.ОписаниеОбъектаУчета;
				СтруктураОшибки = Новый Структура("ОписаниеОбъектаУчета, ФормированиеЗапрещено", ОписаниеОбъектаУчета, Истина);
				ОшибкиФормирования = Новый Массив;
				ОшибкиФормирования.Добавить(СтруктураОшибки);
				
				Параметры.АдресСведенийОбОшибках = ПоместитьВоВременноеХранилище(ОшибкиФормирования);
				Параметры.СписокДокументовКОтправке.Добавить(ОбъектУчета);
				
				Оповещение = Новый ОписаниеОповещения("ОткрытьЭлектронныйДокументПослеРедактированияНастроек",
					ЭтотОбъект, ОбъектУчета);
				ПоказатьПроблемыПриОбработкеДокументов(Оповещение, Параметры);
			Иначе
				НастройкиЭДОКлиент.НастроитьОбменСКонтрагентом(ПараметрыПоиска.КлючНастроекОтправки, Оповещение);
			КонецЕсли;
		КонецЕсли;
		Возврат;
	Иначе
		ПараметрыПоиска = ПредварительныйПросмотр.РезультатПоискаНастроек.ПараметрыПоиска;
		Если ПараметрыПоиска.Направление = ПредопределенноеЗначение("Перечисление.НаправленияЭДО.Исходящий") Тогда
			Настройка = ПредварительныйПросмотр.РезультатПоискаНастроек.Настройки.НастройкиОтправки;
			
			Если Не Настройка.ГотовностьКОбмену 
				И Настройка.СпособОбмена <> ПредопределенноеЗначение("Перечисление.СпособыОбменаЭД.ЧерезКаталог")
				И Настройка.СпособОбмена <> ПредопределенноеЗначение("Перечисление.СпособыОбменаЭД.ЧерезFTP")
				И Настройка.СпособОбмена <> ПредопределенноеЗначение("Перечисление.СпособыОбменаЭД.ЧерезЭлектроннуюПочту") Тогда
				
				ПараметрыПоиска = ПредварительныйПросмотр.РезультатПоискаНастроек.ПараметрыПоиска;
	
				Оповещение = Новый ОписаниеОповещения("ОткрытьЭлектронныйДокументПослеСозданияНастроек", ЭтотОбъект, ПараметрыПоиска);
				НастройкиЭДОКлиент.НастроитьОбменСКонтрагентом(ПараметрыПоиска.КлючНастроекОтправки, Оповещение);
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	ОбработатьРезультатПодготовкиДанныхДляПросмотра(ПредварительныйПросмотр.РезультатПодготовкиДанных,
		ОбъектУчета, ПредварительныйПросмотр.РезультатПоискаНастроек.Настройки);
	
КонецПроцедуры

Процедура ОткрытьПодборОбъектовУчетаЭлектронногоДокумента(ПараметрыФормы, Оповещение = Неопределено) Экспорт
	
	ИмяФормы = "Документ.ЭлектронныйДокументИсходящийЭДО.Форма.ПодборДокументовУчета";
	Если ТипЗнч(ПараметрыФормы.ЭлектронныйДокумент) = Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО") Тогда
		ИмяФормы = "Документ.ЭлектронныйДокументВходящийЭДО.Форма.ПодборДокументовУчета";	
	КонецЕсли;	
		
	ОткрытьФорму(ИмяФормы, ПараметрыФормы,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ПеренаправитьЭлектронныеДокументы(ЭлектронныеДокументы, ОписаниеОповещения = Неопределено) Экспорт

	Если Не ИнтерфейсДокументовЭДОВызовСервера.ЕстьПравоОбработкиДокументов() Тогда
		Возврат; 
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЭлектронныеДокументы", ЭлектронныеДокументы);
	
	ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.ПеренаправлениеЭлектронныхДокументов", ПараметрыФормы, , , , , ОписаниеОповещения);
	
КонецПроцедуры

Процедура СозранитьЭлектронныйДокументВФайл(ПрисоединенныхФайл, УникальныйИдентификатор) Экспорт

	Если ЗначениеЗаполнено(ПрисоединенныхФайл) Тогда
		РаботаСФайламиКлиент.СохранитьВместеСЭП(ПрисоединенныхФайл, УникальныйИдентификатор);
	Иначе
		ТекстСообщения = НСтр("ru = 'Электронный документ не сформирован. Работа с ним невозможна.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьКарточкуЭлектронногоДокумента(ЭлектронныйДокумент) Экспорт
	
	ПараметрыФормы = Новый Структура("Ключ", ЭлектронныйДокумент);
	Если ТипЗнч(ЭлектронныйДокумент) = Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО") Тогда
		ОткрытьФорму("Документ.ЭлектронныйДокументВходящийЭДО.Форма.ФормаДокумента", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	Иначе
		ОткрытьФорму("Документ.ЭлектронныйДокументИсходящийЭДО.Форма.ФормаДокумента", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповеститьОбИзмененииДокумента(ЭлектронныйДокумент) Экспорт
	
	Параметр = НовыйПараметрыОповещения();
	Параметр.ЭлектронныеДокументы.Добавить(ЭлектронныйДокумент);
	
	Оповестить("ОбновитьСостояниеЭД", Параметр);
	
КонецПроцедуры

Процедура ОповеститьОбИзмененииСообщения(Сообщение) Экспорт
	
	Параметр = НовыйПараметрыОповещения();
	Параметр.Сообщения.Добавить(Сообщение);
	
	Оповестить("ОбновитьСостояниеЭД", Параметр);
	
КонецПроцедуры

Функция НовыеДанныеПроверкиОповещения() Экспорт
	
	ДанныеПроверки = Новый Структура;
	ДанныеПроверки.Вставить("Сообщение");
	ДанныеПроверки.Вставить("ЭлектронныйДокумент");
	
	Возврат ДанныеПроверки;
	
КонецФункции

Функция НовыйПараметрыОповещения() Экспорт
	
	ДанныеПроверки = Новый Структура;
	ДанныеПроверки.Вставить("Сообщения", Новый Массив);
	ДанныеПроверки.Вставить("ЭлектронныеДокументы", Новый Массив);
	
	Возврат ДанныеПроверки;
	
КонецФункции

// Вызывается из формы просмотра электронного документа.
// Проверяет совпадение переданных в оповещение параметров свойствам формы.
// 
// Параметры:
//  ДанныеПроверки - Структура - данные для проверки необходимости обработки оповещения:
//  	* Сообщение - ДокументСсылка.СообщениеЭДО - электронный документ. 
//  	* ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО, 
//  						ДокументСсылка.ЭлектронныйДокументВходящийЭДО - ссылка на электронный документ. 
//  Параметр - Структура - параметр передаваемый в обработку оповещение формы.
//  ОбработатьОповещение - Булево - признак выхода из обработки оповещения формы.
//
Процедура ПриОбработкеОповещенияФормыПросмотраЭД(ДанныеПроверки, Параметр, ОбработатьОповещение) Экспорт
	
	Если ТипЗнч(Параметр) = Тип("Структура") Тогда
		
		ФлагВыхода = Ложь;
		Если Параметр.Свойство("Сообщения") Тогда
			ФлагВыхода = Истина;
			Если ТипЗнч(Параметр.Сообщения) = Тип("Массив")
				И Параметр.Сообщения.Найти(ДанныеПроверки.Сообщение) <> Неопределено Тогда
				ФлагВыхода = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		ФлагВыхода2 = Ложь;
		Если Параметр.Свойство("ЭлектронныеДокументы") Тогда
			ФлагВыхода2 = Истина;
			Если ТипЗнч(Параметр.ЭлектронныеДокументы) = Тип("Массив")
				И Параметр.ЭлектронныеДокументы.Найти(ДанныеПроверки.ЭлектронныйДокумент) <> Неопределено Тогда
					ФлагВыхода2 = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если ФлагВыхода И ФлагВыхода2 Тогда
			ОбработатьОповещение = Ложь;
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

// Возвращает праметры открытия формы выбора видов электронного документа.
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * ДляПроизвольногоФормата - Булево - признак отбора видов документов доступных для выбора при ручном формировании.
Функция НовыеПараметрыФормыВыбораВидовДокументов() Экспорт
	Параметры = Новый Структура;
	Параметры.Вставить("ДляПроизвольногоФормата", Истина);
	Возврат Параметры;
КонецФункции

// Открывает форму выбора видов электронного документа.
// 
// Параметры:
// 	ПараметрыФормы - См. НовыеПараметрыФормыВыбораВидовДокументов
// 	Владелец - ФормаКлиентскогоПриложения, ПолеФормы - Владелец формы выбора.
// 	Оповещение - ОписаниеОповещения - Описание процедуры, которая будет вызвана при закрытии формы.
Процедура ОткрытьФормуВыбораВидовДокументов(ПараметрыФормы, Владелец, Оповещение = Неопределено) Экспорт
	
	ОткрытьФорму("Справочник.ВидыДокументовЭДО.ФормаВыбора", ПараметрыФормы, Владелец,,,,Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПросмотрЭлектронногоДокумента

#Область ПросмотрЭлектронногоДокументаОбработчикиСобытий

Процедура ПросмотрЭлектронногоДокументаОбработкаНавигационнойСсылки(Форма, Элемент, НавигационнаяСсылка, СтандартнаяОбработка) Экспорт
	
	Если НавигационнаяСсылка = "ПерейтиНаСайтЭДО" Тогда
		СтандартнаяОбработка = Ложь;
		СинхронизацияЭДОКлиент.ОткрытьСайтСервиса1СЭДО();		
	ИначеЕсли НавигационнаяСсылка = "ПерейтиНаСайтБизнесСеть" Тогда
		СтандартнаяОбработка = Ложь;
		СинхронизацияЭДОКлиент.ОткрытьСайтСервисаБизнесСеть();		
	ИначеЕсли НавигационнаяСсылка = "ПоказатьПредупреждения" Тогда
		СтандартнаяОбработка = Ложь;
		Параметры = ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыПроблемПриОбработкеДокументов();
		Параметры.Предупреждения = ПолучитьИзВременногоХранилища(Форма.АдресХранилищаПредупреждений);
		
		ПоказатьПроблемыПриОбработкеДокументов(Новый ОписаниеОповещения, Параметры)
	ИначеЕсли НавигационнаяСсылка = "СделатьАктуальнымЭлектронныйДокумент" Тогда
		СтандартнаяОбработка = Ложь;
		ЭлектронныйДокумент = Форма.Объект.Ссылка;
		НаборОбъектовУчета = Форма.Основания.ВыгрузитьЗначения();
		ВидДокумента =  Форма.Объект.ВидДокумента;	
		
		ИнтеграцияЭДОКлиент.УстановитьАктуальныйЭлектронныйДокумент(НаборОбъектовУчета, ЭлектронныйДокумент, ВидДокумента);
		
		Форма.Элементы["ГруппПредупрежденияОНеактуальномЭлектронномДокументе"].Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаСобытийВыполненияДейсвийПоЭДО

Процедура ВыполнитьДействияПоЭДОПослеВводаСтроки(Комментарий, ДополнительныеПараметры) Экспорт
	
	Если Комментарий = Неопределено Тогда
		Возврат; 
	КонецЕсли;
		
	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, ДополнительныеПараметры);

	ПараметрыВыполненияДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполненияДействийПоЭДО.НаборДействий = ДополнительныеПараметры.НаборДействий;
	
	Если ДополнительныеПараметры.Свойство("ОбъектыУчета")
		И ЗначениеЗаполнено(ДополнительныеПараметры.ОбъектыУчета) Тогда
		ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ОбъектыУчета = ДополнительныеПараметры.ОбъектыУчета;	
		
	ИначеЕсли ДополнительныеПараметры.Свойство("ЭлектронныеДокументы") 
		И ЗначениеЗаполнено(ДополнительныеПараметры.ЭлектронныеДокументы) Тогда
		ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ЭлектронныеДокументы = ДополнительныеПараметры.ЭлектронныеДокументы;
		
	ИначеЕсли ДополнительныеПараметры.Свойство("ПакетыДокументов")
		И ЗначениеЗаполнено(ДополнительныеПараметры.ПакетыДокументов) Тогда
		ПараметрыВыполненияДействийПоЭДО.ОбъектыДействий.ПакетыДокументов = ДополнительныеПараметры.ПакетыДокументов;
		
	КонецЕсли;
		
	ПараметрыДействия = ЭлектронныеДокументыЭДОКлиентСервер.НовыеДополнительныеПараметрыДействия();
	ПараметрыДействия.Комментарий = Комментарий; 
				
	ПараметрыВыполненияДействийПоЭДО.ДополнительныеПараметрыДействий.Вставить(ДополнительныеПараметры.ОсновноеДействие,
		ПараметрыДействия);
	
	ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(Оповещение, ПараметрыВыполненияДействийПоЭДО);
		
КонецПроцедуры

Процедура ПослеВыполненияДействийПоЭДО(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("ОшибкиФормирования") И Результат.ОшибкиФормирования.Количество() Тогда
		
		ОшибкаНастройкиСОднимКлючем = Ложь;
		ТекущееОписание = Результат.ОшибкиФормирования[0].ОписаниеОбъектаУчета; 
		ОшибкаНастройкиСОднимКлючем = Результат.ОшибкиФормирования[0].ОтсутствуютНастройки;
		
		Если ОшибкаНастройкиСОднимКлючем Тогда
			Для Каждого Ошибка Из Результат.ОшибкиФормирования Цикл
				Описание = Ошибка.ОписаниеОбъектаУчета;
				Если ТекущееОписание.Организация <> Описание.Организация
					Или ТекущееОписание.Контрагент <> Описание.Контрагент
					Или ТекущееОписание.ТипДокумента <> Описание.ТипДокумента
					Или ТекущееОписание.Направление <> Описание.Направление 
					Или Не Ошибка.ОтсутствуютНастройки Тогда
				
					ОшибкаНастройкиСОднимКлючем = Ложь;
				КонецЕсли;	 
			КонецЦикла;
		КонецЕсли;
				
		Если ОшибкаНастройкиСОднимКлючем Тогда
			
			Оповещение = Новый ОписаниеОповещения("ЗавершениеРаботыМастераНастроекПродолжитьВыполнениеДействий",
				ЭтотОбъект, ПараметрыОповещения);

			Если ТекущееОписание.Направление = ПредопределенноеЗначение("Перечисление.НаправленияЭДО.Внутренний") Тогда
				
				ОписаниеВидаВнутреннегоДокумента = НастройкиЭДОКлиент.НовоеОписаниеВидаВнутреннегоДокумента();
				ОписаниеВидаВнутреннегоДокумента.ОбъектУчета = ТекущееОписание.ОбъектУчета;			
			
				НастройкиЭДОКлиент.НастроитьВнутреннийЭлектронныйДокументооборот(ТекущееОписание.Организация,
					ОписаниеВидаВнутреннегоДокумента, Оповещение);
				
			Иначе
				КлючНастроек = ИнтерфейсДокументовЭДОВызовСервера.КлючНастроекОтправкиОбъектаУчета(ТекущееОписание);
				НастройкиЭДОКлиент.НастроитьОбменСКонтрагентом(КлючНастроек, Оповещение);				
			КонецЕсли;
			
		Иначе
	
			Параметры = ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыПроблемПриОбработкеДокументов();
			Параметры.АдресСведенийОбОшибках = ПоместитьВоВременноеХранилище(Результат.ОшибкиФормирования);
			Если ТипЗнч(ПараметрыОповещения) = Тип("Структура")
				И ПараметрыОповещения.Свойство("ОбъектыУчета") Тогда
				Параметры.СписокДокументовКОтправке = ПараметрыОповещения.ОбъектыУчета;
			КонецЕсли;
			Если ТипЗнч(ПараметрыОповещения) = Тип("Структура")
				И ПараметрыОповещения.Свойство("ИсправляемыйДокумент") Тогда
				Параметры.ИсправляемыйДокумент = ПараметрыОповещения.ИсправляемыйДокумент;
			КонецЕсли;
			Если ТипЗнч(ПараметрыОповещения) = Тип("Структура")
				И ПараметрыОповещения.Свойство("ПараметрыВыполненияДействийПоЭДО")
				И ПараметрыОповещения.ПараметрыВыполненияДействийПоЭДО.НаборДействий.Получить(ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.Подписать")) = Истина Тогда
			
				Параметры.РежимПодписатьОтправить = Истина;
			КонецЕсли;
			
			Оповещение = Новый ОписаниеОповещения("ПослеЗавершенияРаботыПомощникаФормирования", ЭтотОбъект, ПараметрыОповещения);
			
			Если ПараметрыОповещения.Свойство("ПараметрыВыполненияДействийПоЭДО") Тогда
				ПоказатьПроблемыПриОбработкеДокументов(Оповещение, Параметры, ПараметрыОповещения.ПараметрыВыполненияДействийПоЭДО);
			Иначе
				ПоказатьПроблемыПриОбработкеДокументов(Оповещение, Параметры);
			КонецЕсли;
			
		КонецЕсли;
		Возврат;
		
	ИначеЕсли Результат.Свойство("КонтекстДиагностики") И 
		ОбработкаНеисправностейБЭДКлиентСервер.ЕстьОшибки(Результат.КонтекстДиагностики) Тогда
		
		ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(Результат.КонтекстДиагностики);
		Возврат;
			
	КонецЕсли;
	
	Если ПараметрыОповещения <> Неопределено 
		И ПараметрыОповещения.Свойство("ОповещениеУспешногоЗавершения") Тогда			
			
		ВыполнитьОбработкуОповещения(ПараметрыОповещения.ОповещениеУспешногоЗавершения, Результат.Итог);
		
	КонецЕсли;	
		
	Оповестить("ОбновитьТекущиеДелаЭДО");
	Оповестить("ОбновитьСостояниеЭД");

КонецПроцедуры

Процедура ПослеЗавершенияРаботыПомощникаФормирования(Результат, ДополнительныеПараметры) Экспорт	
	
	Если Результат <> Неопределено Тогда
		ОповещениеЗавершения = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, ДополнительныеПараметры);
		ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(ОповещениеЗавершения, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗавершениеРаботыМастераНастроекПродолжитьВыполнениеДействий(Результат, ДополнительныеПараметры) Экспорт	
	
	Если Результат <> Неопределено Тогда
		ОповещениеЗавершения = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтотОбъект, ДополнительныеПараметры);
		ПараметрыВыполненияДействийПоЭДО = ДополнительныеПараметры.ПараметрыВыполненияДействийПоЭДО;
		ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(ОповещениеЗавершения, ПараметрыВыполненияДействийПоЭДО);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Описание
// 
// Параметры:
// 	МассивОбъектовУчета - Массив из Структура - объекты учета готовые к документообороту.
// 	Контекст - Структура, Неопределено -
Процедура ОткрытьЭлектронныйДокументПослеПодготовкиОбъектовУчета(МассивОбъектовУчета, Контекст) Экспорт
	
	Если ЗначениеЗаполнено(МассивОбъектовУчета) Тогда
		ОткрытьЭлектронныйДокументОбъектаУчета(МассивОбъектовУчета[0]);
	КонецЕсли;
	
КонецПроцедуры

// Описание
// 
// Параметры:
// 	НастройкиОтправки - Структура -
// 	Параметры - Структура - 
Процедура ОткрытьЭлектронныйДокументПослеСозданияНастроек(НастройкиОтправки, Параметры) Экспорт
	
	Если Не ЗначениеЗаполнено(НастройкиОтправки) Тогда
		Возврат;
	КонецЕсли;	
	
	НастройкиФормирования = ИнтерфейсДокументовЭДОКлиентСервер.НовыеНастройкиФормированияЭлектронногоДокументаОбъектаУчета();
	НастройкиФормирования.Направление = Параметры.Направление;
	
	Если Параметры.Направление = ПредопределенноеЗначение("Перечисление.НаправленияЭДО.Внутренний") Тогда

		Настройки = Новый Структура;
		Настройки.Вставить("Организация", НастройкиОтправки.КлючНастройки.Организация);
		Настройки.Вставить("ВидДокумента", НастройкиОтправки.КлючНастройки.ВидВнутреннегоДокумента);
		Настройки.Вставить("ВидПодписи", НастройкиОтправки.ВидЭлектроннойПодписи);
		Настройки.Вставить("МаршрутПодписания", НастройкиОтправки.Маршрут);
		Настройки.Вставить("Подписанты", НастройкиОтправки.Подписанты);

		НастройкиФормирования.НастройкиВнутреннегоЭДО = Настройки;
		
	Иначе
		НастройкиФормирования.НастройкиОтправки = НастройкиОтправки;
	КонецЕсли;	
	
	РезультатПодготовкиДанных = ИнтерфейсДокументовЭДОВызовСервера.ПодготовитьДанныеДляПросмотра(
		Параметры.ОбъектУчета, НастройкиФормирования);
	
	ОбработатьРезультатПодготовкиДанныхДляПросмотра(РезультатПодготовкиДанных, Параметры.ОбъектУчета, НастройкиФормирования);
	
КонецПроцедуры

Процедура ОткрытьЭлектронныйДокументПослеРедактированияНастроек(Результат, ОбъектУчета) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ОткрытьЭлектронныйДокументОбъектаУчета(ОбъектУчета);
	
КонецПроцедуры

Процедура ОткрытьЭлектронныйДокументПослеОбработкиПроблемПриФормировании(Результат, Контекст) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектУчета = Результат.ОбъектыДействий.ОбъектыУчета[0];
	ДополнительныеДанные = Результат.ДополнительныеДанныеОбъектов[ОбъектУчета];	
	
	Если Не ЗначениеЗаполнено(ОбъектУчета) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПодготовкиДанных = ИнтерфейсДокументовЭДОВызовСервера.ПодготовитьДанныеДляПросмотра(
		ОбъектУчета, Контекст.НастройкиФормирования, ДополнительныеДанные);
	
	ОбработатьРезультатПодготовкиДанныхДляПросмотра(РезультатПодготовкиДанных, ОбъектУчета, Контекст.НастройкиФормирования);
	
КонецПроцедуры

Процедура ОбработатьРезультатПодготовкиДанныхДляПросмотра(РезультатПодготовкиДанных, ОбъектУчета, НастройкиФормирования)
	
	Если РезультатПодготовкиДанных.Ошибка Тогда
		Контекст = Новый Структура("НастройкиФормирования", НастройкиФормирования);
		Оповещение = Новый ОписаниеОповещения("ОткрытьЭлектронныйДокументПослеОбработкиПроблемПриФормировании", ЭтотОбъект, Контекст);
		
		Параметры = ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыПроблемПриОбработкеДокументов();
		Параметры.АдресСведенийОбОшибках = РезультатПодготовкиДанных.АдресСведенийОбОшибках;
		Параметры.СписокДокументовКОтправке = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектУчета);
		
		ПоказатьПроблемыПриОбработкеДокументов(Оповещение, Параметры);
		
		Возврат;
	КонецЕсли;
	
	ОткрытьНовыйЭлектронныйДокументОбъектаУчета(ОбъектУчета, НастройкиФормирования, РезультатПодготовкиДанных);
	
КонецПроцедуры

// Открывает форму просмотра электронного документа.
// 
// Параметры:
// 	ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО, ДокументСсылка.ЭлектронныйДокументВходящийЭДО - ссылка на ЭлектронныйДокумент.
Процедура ОткрытьЭлектронныйДокумент(ЭлектронныйДокумент, ТолькоПросмотр = Ложь) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ЭлектронныйДокумент);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);

	ОткрытьФормуЭлектронногоДокумента(ПараметрыФормы);
	
КонецПроцедуры

// Открывает форму исходящего электронного документа в режиме предварительного просмотра.
// 
// Параметры:
// 	ОбъектУчета - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
// 	НастройкиФормирования - см. ИнтерфейсДокументовЭДО.НастройкиФормированияДокументооборотаОбъектаУчета
// 	АдресДанныхДокумента - Строка - адрес данных документа во временном хранилище.
Процедура ОткрытьНовыйЭлектронныйДокументОбъектаУчета(ОбъектУчета, НастройкиФормирования, РезультатПодготовкиДанных)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектУчета", ОбъектУчета);
	ПараметрыФормы.Вставить("НастройкиФормирования", НастройкиФормирования);
	ПараметрыФормы.Вставить("РезультатПодготовкиДанных", РезультатПодготовкиДанных);
	ОткрытьФормуЭлектронногоДокумента(ПараметрыФормы);
	
КонецПроцедуры

// Открывает форму исходящего произвольного электронного документа на основании объекта учета.
// 
// Параметры:
// 	Основание - основание ЭД
Процедура ОткрытьНовыйПроизвольныйЭлектронныйДокументНаОсновании(Основание, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Основание);
	ОткрытьФормуЭлектронногоДокумента(ПараметрыФормы);
	
КонецПроцедуры

Процедура ОткрытьНовыйЭлектронныйДокумент(ЭлектронныйДокументДляКопирования = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(ЭлектронныйДокументДляКопирования) Тогда
		ПараметрыФормы.Вставить("ЗначениеКопирования", ЭлектронныйДокументДляКопирования);
	КонецЕсли;
	ОткрытьФормуЭлектронногоДокумента(ПараметрыФормы);
	
КонецПроцедуры

Процедура ОткрытьФормуЭлектронногоДокумента(ПараметрыФормы)
		
	ЭтоМобильныйКлиент = Ложь;
	
	#Если МобильныйКлиент Тогда
		ЭтоМобильныйКлиент = Истина;
	#КонецЕсли
	
	Если ЭтоМобильныйКлиент Тогда
		ИмяФормы = "Документ.ЭлектронныйДокументИсходящийЭДО.Форма.ФормаПросмотраМК";
	Иначе
		ИмяФормы = "Документ.ЭлектронныйДокументИсходящийЭДО.Форма.ФормаПросмотра";
	КонецЕсли;
	
	Если ПараметрыФормы.Свойство("Ключ")
		И ТипЗнч(ПараметрыФормы.Ключ) = Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО") Тогда
		Если ЭтоМобильныйКлиент Тогда
			ИмяФормы = "Документ.ЭлектронныйДокументВходящийЭДО.Форма.ФормаПросмотраМК";
		Иначе
			ИмяФормы = "Документ.ЭлектронныйДокументВходящийЭДО.Форма.ФормаПросмотра";
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыФормы.Свойство("ОбъектУчета") Тогда
		ОткрытьФорму(ИмяФормы, ПараметрыФормы,, ПараметрыФормы.ОбъектУчета);
	Иначе
		ОткрытьФорму(ИмяФормы, ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьПроблемыПриОбработкеДокументов(Оповещение, Параметры, ПараметрыВыполненияДействийПоЭДО = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура("СписокДокументовКОтправке, 
	|АдресСведенийОбОшибках,
	|РежимПодписатьОтправить,
	|ИсправляемыйДокумент,
	|Предупреждения,
	|ПараметрыВыполненияДействийПоЭДО");
	
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, Параметры);
	ПараметрыФормы.ПараметрыВыполненияДействийПоЭДО = ПараметрыВыполненияДействийПоЭДО;
	
	ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.ПомощникФормированияДокументов", ПараметрыФормы, Параметры.ФормаВладелец,,,,
		Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОповеститьПользователяОСменеОтветственного(Ответственный, КоличествоВсего, КоличествоОбработанных) Экспорт
	
	Если КоличествоОбработанных > 0 Тогда
			
		ТекстСообщения = НСтр("ru = 'Для %КоличествоОбработанных% из %КоличествоВсего% выделенных эл.документов
							|установлен ответственный ""%Ответственный%""'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КоличествоОбработанных%", КоличествоОбработанных);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КоличествоВсего%",        КоличествоВсего);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ответственный%",          Ответственный);
		ТекстЗаголовка = НСтр("ru='Ответственный ""%Ответственный%"" установлен'");
		ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%Ответственный%", Ответственный);
		ПоказатьОповещениеПользователя(ТекстЗаголовка, , ТекстСообщения, БиблиотекаКартинок.Информация32);
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Ответственный ""%Ответственный%"" не установлен ни для одного эл.документа.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ответственный%", Ответственный);
		ТекстЗаголовка = НСтр("ru = 'Ответственный ""%Ответственный%"" не установлен'");
		ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%Ответственный%", Ответственный);
		ПоказатьОповещениеПользователя(ТекстЗаголовка,, ТекстСообщения, БиблиотекаКартинок.Информация32);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Переформирование

Процедура ПереформироватьДокумент(ОповещениеОЗавершении, Параметры) Экспорт
	
	Если Параметры.Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Параметры.ПричинаОтказа);
		Возврат;
	КонецЕсли;
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	Контекст.Вставить("Параметры", Параметры);
	Контекст.Вставить("ПараметрыДействийПоЭДО", Параметры.ПараметрыДействийПоЭДО);
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики();
	ПараметрыПереформирования = Новый Структура;
	ПараметрыПереформирования.Вставить("КонтекстДиагностики", КонтекстДиагностики);	
	ПараметрыПереформирования.Вставить("Контекст", Контекст);
		
	НачатьПереформированиеДокумента(ПараметрыПереформирования);	
	
КонецПроцедуры

Процедура НачатьПереформированиеДокумента(ПараметрыПереформирования) Экспорт
	 
	РезультатПереформирования = ИнтерфейсДокументовЭДОВызовСервера.ПереформироватьДокумент(ПараметрыПереформирования.Контекст.Параметры, ПараметрыПереформирования.КонтекстДиагностики);

	Если РезультатПереформирования <> Неопределено Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеПолученияДопДанныхПриПереформировании", ЭтотОбъект, ПараметрыПереформирования);
		ПолучитьДопДанныеОбъектаУчета(Оповещение, РезультатПереформирования, ПараметрыПереформирования.Контекст.Параметры.ОбъектУчета);
	Иначе
		ПослеПереформирования(Неопределено, ПараметрыПереформирования);
	КонецЕсли;

КонецПроцедуры

Процедура ПолучитьДопДанныеОбъектаУчета(Оповещение, РезультатПереформирования, ОбъектУчета)
	
	ПараметрыОткрытия = ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыПроблемПриОбработкеДокументов();
	ПараметрыОткрытия.АдресСведенийОбОшибках = ПоместитьВоВременноеХранилище(РезультатПереформирования.ОшибкиФормирования);
	ПараметрыОткрытия.СписокДокументовКОтправке.Добавить(ОбъектУчета); 
	
	ИнтерфейсДокументовЭДОКлиент.ПоказатьПроблемыПриОбработкеДокументов(Оповещение, ПараметрыОткрытия);
		
КонецПроцедуры

Процедура ПослеПолученияДопДанныхПриПереформировании(ДопДанные, Результат) Экспорт

	Если ДопДанные <> Неопределено Тогда
		Результат.Контекст.Параметры.Вставить("ДопДанные", ДопДанные.ДополнительныеДанныеОбъектов.Получить(Результат.Контекст.Параметры.ОбъектУчета));	
	Иначе
		Возврат;
	КонецЕсли;
	 
	РезультатПереформирования = ИнтерфейсДокументовЭДОВызовСервера.ПереформироватьДокумент(Результат.Контекст.Параметры, Результат.КонтекстДиагностики);
	
	Если РезультатПереформирования <> Неопределено Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеПолученияДопДанныхПриПереформировании", ЭтотОбъект, Результат);
		ПолучитьДопДанныеОбъектаУчета(Оповещение, РезультатПереформирования, Результат.Контекст.Параметры.ОбъектУчета);
	Иначе
		ПослеПереформирования(Неопределено, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеПереформирования(ДопДанные, Результат)

	Если Результат.Контекст.Параметры.ПараметрыДействийПоЭДО.НаборДействий.Получить(ПредопределенноеЗначение(
		"Перечисление.ДействияПоЭДО.Аннулировать")) <> Неопределено Тогда
		Результат.Контекст.Параметры.ПараметрыДействийПоЭДО.НаборДействий.Вставить(ПредопределенноеЗначение(
			"Перечисление.ДействияПоЭДО.Подписать"), Истина);
		Результат.Контекст.Параметры.ПараметрыДействийПоЭДО.НаборДействий.Вставить(ПредопределенноеЗначение(
			"Перечисление.ДействияПоЭДО.ПодготовитьКОтправке"), Истина);
		Результат.Контекст.Параметры.ПараметрыДействийПоЭДО.НаборДействий.Вставить(ПредопределенноеЗначение(
			"Перечисление.ДействияПоЭДО.Отправить"), Истина);
		Результат.Контекст.Параметры.ПараметрыДействийПоЭДО.ОбъектыДействий.ЭлектронныеДокументы.Добавить(Результат.Контекст.Параметры.ЭлектронныйДокумент);
		
		ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(Неопределено, Результат.Контекст.Параметры.ПараметрыДействийПоЭДО);
	КонецЕсли;
	
	Результат.Вставить("Переформирован", Истина);						
	ВыполнитьОбработкуОповещения(Результат.Контекст.ОповещениеОЗавершении, Результат);
	
КонецПроцедуры

#КонецОбласти

// Обработка результата помещения файла.
//
// Параметры:
//  ВыборВыполнен			 - Булево - результат выполнения выбора.
//  АдресФайла				 - Строка - адрес хранилища.
//  ВыбранноеИмяФайла		 - Строка - имя файла.
//  ДополнительныеПараметры	 - Структура - дополнительные параметры.
//
Процедура ЗагрузитьДанныеИзФайлаОбработатьРезультатПомещенияФайла(ВыборВыполнен, АдресФайла, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Не ВыборВыполнен Тогда
		Возврат;
	КонецЕсли;
	
	Расширение = Прав(ВыбранноеИмяФайла, 3);
	СсылкаНаДокумент = ДополнительныеПараметры.СсылкаНаДокумент;
	УникальныйИдентификатор = ДополнительныеПараметры.УникальныйИдентификатор;
	
	Если ВРег(Расширение) <> ВРег("zip")
			И ВРег(Расширение) <> ВРег("xml") Тогда
		ТекстСообщения = НСтр("ru = 'Некорректный формат файла.
									|Выберите файл с расширением ""zip"" или ""xml"".'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	СтруктураОбмена = Новый Структура();
	СтруктураОбмена.Вставить("НаправлениеЭД",           ПредопределенноеЗначение("Перечисление.НаправленияЭДО.Входящий"));
	СтруктураОбмена.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	СтруктураОбмена.Вставить("ИмяФайла",     ВыбранноеИмяФайла);
	СтруктураОбмена.Вставить("АдресХранилищаФайла",     АдресФайла);
	СтруктураОбмена.Вставить("АдресХранилищаФайлаДопДанных", "");
	СтруктураОбмена.Вставить("АдресХранилищаФайлаКартинок",  "");
	СтруктураОбмена.Вставить("СсылкаНаДокумент",        СсылкаНаДокумент);
	СтруктураОбмена.Вставить("ИмяФайла",                ВыбранноеИмяФайла);
	
	Если ВРег(Расширение) = ВРег("zip") Тогда
		
		ОписаниеФайла = Новый Структура;

		ОписаниеФайла.Вставить("ИмяФайла", ВыбранноеИмяФайла);
		ОписаниеФайла.Вставить("ДвоичныеДанные", ПолучитьИзВременногоХранилища(АдресФайла));
		
		ОписаниеФайловДокументаПакета = ИнтерфейсДокументовЭДОВызовСервера.ОписаниеФайловДокументаПакета(ОписаниеФайла);
		
		Если ЗначениеЗаполнено(ОписаниеФайловДокументаПакета) Тогда
			СтруктураОбмена.Вставить("АдресХранилищаФайла", ПоместитьВоВременноеХранилище(
				ОписаниеФайловДокументаПакета.ДанныеОсновногоФайла.ДвоичныеДанные, УникальныйИдентификатор));
			СтруктураОбмена.Вставить("ИмяФайла", ОписаниеФайловДокументаПакета.ДанныеОсновногоФайла.ИмяФайла);	
			СтруктураОбмена.Вставить("АдресХранилищаФайлаДопДанных", ПоместитьВоВременноеХранилище(
				ОписаниеФайловДокументаПакета.ДанныеФайлаДопДанных.ДвоичныеДанные, УникальныйИдентификатор));
			Если ЗначениеЗаполнено(ОписаниеФайловДокументаПакета.ДанныеФайлаКартинок) Тогда
				СтруктураОбмена.Вставить("АдресХранилищаФайлаКартинок", ПоместитьВоВременноеХранилище(
					ОписаниеФайловДокументаПакета.ДанныеФайлаКартинок.ДвоичныеДанные, УникальныйИдентификатор));
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
	Параметры = Новый Структура("СтруктураЭД", СтруктураОбмена);
	
	ОткрытьФорму("Обработка.ИнтерфейсДокументовЭДО.Форма.ЗагрузкаПросмотрЭлектронногоДокумента", Параметры, ,
		СтруктураОбмена.УникальныйИдентификатор);
	
	
КонецПроцедуры

#КонецОбласти