
#Область СлужебныйПрограммныйИнтерфейс

#Область ПроверкаПрав

// Возвращает признак наличия прав на чтение электронных документов.
// 
// Возвращаемое значение:
// 	Булево - признак наличия прав на чтение электронных документов.
Функция ЕстьПравоЧтенияДокументов() Экспорт
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЕстьПраво = Истина;
		
	// Основные объекты метаданных, доступ к которым определяет доступ к элементарной функции.
	ОбъектыЭлементарнойФункции = Новый Массив;
	ОбъектыЭлементарнойФункции.Добавить(Метаданные.Документы.СообщениеЭДО);
	
	Для каждого Объект Из ОбъектыЭлементарнойФункции Цикл
		
		Если Не ПравоДоступа("Чтение", Объект) Тогда
			ЕстьПраво = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат ЕстьПраво;
	
КонецФункции

// Возвращает признак наличия прав на обработку электронных документов.
// 
// Параметры:
// 	КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
// Возвращаемое значение:
// 	Булево - признак наличия прав на обработку электронных документов.
Функция ЕстьПравоОбработкиДокументов(КонтекстДиагностики = Неопределено) Экспорт
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЕстьПраво = Истина;
	
	// Основные объекты метаданных, доступ к которым определяет доступ к элементарной функции.
	ОбъектыЭлементарнойФункции = Новый Массив;
	ОбъектыЭлементарнойФункции.Добавить(Метаданные.Документы.СообщениеЭДО);
	
	Для каждого Объект Из ОбъектыЭлементарнойФункции Цикл
		
		Если Не ПравоДоступа("Изменение", Объект) Тогда
			ЕстьПраво = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЕстьПраво И КонтекстДиагностики <> Неопределено Тогда
		ТекстСообщения = ОбработкаНеисправностейБЭДКлиентСервер.ТекстСообщенияОНарушенииПравДоступа();
		Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(НСтр("ru = 'Выполнение действий по электронным документам'"),
			ВидОшибкиНетПравНаОбработкуДокументов(), ТекстСообщения, ТекстСообщения);
		ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
		ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	КонецЕсли;
	
	Возврат ЕстьПраво;
	
КонецФункции

#КонецОбласти

#Область Форматы

// Возвращает структуру отбора сведений по форматам электронных документов.
// 
// Возвращаемое значение:
// 	См. _ФорматыЭДО.НовыйОтборФорматовЭлектронныхДокументов
Функция НовыйОтборФорматовЭлектронныхДокументов() Экспорт
	Возврат ФорматыЭДО.НовыйОтборФорматовЭлектронныхДокументов();
КонецФункции

// Возвращает сведения о форматах электронных документов.
// 
// Параметры:
// 	ВидыДокументов - См. НовыйОтборФорматовЭлектронныхДокументов
// Возвращаемое значение:
// 	См. _ФорматыЭДО.ФорматыЭлектронныхДокументов
Функция ФорматыЭлектронныхДокументов(Отбор = Неопределено) Экспорт
	Возврат ФорматыЭДО.ФорматыЭлектронныхДокументов(Отбор);
КонецФункции

// Возвращает описание запроса актуальных форматов.
// 
// Параметры:
// 	ИмяВременнойТаблицы - Строка - имя временной таблице для обращения в основном запросе.
// Возвращаемое значение:
// 	См. ФорматыЭДО.ЗапросАктуальныхФорматов
Функция ЗапросАктуальныхФорматов(ИмяВременнойТаблицы) Экспорт
	Возврат ФорматыЭДО.ЗапросАктуальныхФорматов(ИмяВременнойТаблицы);
КонецФункции

// Возвращает описание запроса форматов электронных документов.
// 
// Параметры:
// 	ИмяВременнойТаблицы - Строка - имя временной таблице для обращения в основном запросе.
// Возвращаемое значение:
// 	См. ФорматыЭДО.ЗапросФорматовЭлектронныхДокументов
Функция ЗапросФорматовЭлектронныхДокументов(ИмяВременнойТаблицы) Экспорт
	Возврат ФорматыЭДО.ЗапросФорматовЭлектронныхДокументов(ИмяВременнойТаблицы);
КонецФункции

// Обновляет форматы электронных документов по предоставленным данным.
// 
// Параметры:
// 	Форматы - ТаблицаЗначений -
// 	ДатаИзменения - Дата -
Процедура ОбновитьФорматыЭлектронныхДокументов(Форматы, ДатаИзменения) Экспорт
	ФорматыЭДО.ОбновитьФорматыЭлектронныхДокументов(Форматы, ДатаИзменения);
КонецПроцедуры

// Обновляет связи видов и форматов электронных документов по предоставленным данным.
// 
// Параметры:
// 	СвязьВидовИФорматов - ТаблицаЗначений -
// 	ДатаИзменения - Дата -
Процедура ОбновитьСвязьВидовИФорматовЭлектронныхДокументов(СвязьВидовИФорматов, ДатаИзменения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьЗаписи
	|ИЗ
	|	РегистрСведений.СвязьВидовИФорматовДокументовЭДО КАК СвязьВидовИФорматовДокументовЭДО";
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	ЕстьЗаписи = Не РезультатЗапроса.Пустой();
	
	Если СвязьВидовИФорматов.ДатаПоследнегоИзменения <> ДатаИзменения ИЛИ Не ЕстьЗаписи Тогда
		
		ЗагрузитьСвязьВидовИФорматовЭлектронныхДокументов(СвязьВидовИФорматов);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьСвязьВидовИФорматовЭлектронныхДокументов(СвязьВидовИФорматов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокСвязейСервиса.ВидЭлектронногоДокумента КАК ВидДокумента,
	|	СписокСвязейСервиса.ФорматЭлектронногоДокумента КАК Формат,
	|	СписокСвязейСервиса.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ СписокСвязейСервиса
	|ИЗ
	|	&СписокСвязейСервиса КАК СписокСвязейСервиса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокСвязейСервиса.ВидДокумента КАК ВидДокумента,
	|	ФорматыЭлектронныхДокументов.Формат КАК Формат,
	|	СписокСвязейСервиса.Приоритет КАК Приоритет
	|ИЗ
	|	СписокСвязейСервиса КАК СписокСвязейСервиса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФорматыЭлектронныхДокументов КАК ФорматыЭлектронныхДокументов
	|		ПО ((ВЫРАЗИТЬ(СписокСвязейСервиса.Формат КАК СТРОКА(50))) = ФорматыЭлектронныхДокументов.ИдентификаторСервиса)";
	
	Запрос.УстановитьПараметр("СписокСвязейСервиса", СвязьВидовИФорматов.СвязьВидовИФорматовЭД);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	Набор = РегистрыСведений.СвязьВидовИФорматовДокументовЭДО.СоздатьНаборЗаписей();
	Набор.Загрузить(РезультатЗапроса.Выгрузить());
	
	Набор.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Возвращает таблицу с данными для расшифровки формата и вида ЭД в Формат.
//
// Возвращаемое значение:
//  ТаблицаЗначений - См. ФорматыЭДО.РасшифровкаВариантовЗаполненияФорматовЭДО.
//
Функция РасшифровкаВариантовЗаполненияФорматовЭДО() Экспорт
	
	Возврат ФорматыЭДО.РасшифровкаВариантовЗаполненияФорматовЭДО();
	
КонецФункции

// Возвращает формат по умолчанию для указанного вида электронного документа
// 
// Параметры:
// 	* ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - Ссылка на вид электронного документа.
// Возвращаемое значение:
// 	 Строка - Идентификатор формата электронного документа.
Функция ФорматПоУмолчанию(ВидДокумента) Экспорт
	Отбор = НовыйОтборЗапросаФорматовПоУмолчанию();
	Отбор.ВидДокумента = "= &ОтборВидДокумента";
	ОписаниеЗапроса = ЗапросФорматовПоУмолчанию("", Отбор);
	ОписаниеЗапроса.СлужебныеПараметры.Вставить("ОтборВидДокумента", ВидДокумента);
	РезультатЗапроса = ОбщегоНазначенияБЭД.ВыполнитьЗапрос(ОписаниеЗапроса);
	ВыборкаФормата = РезультатЗапроса.Выбрать();
	Если ВыборкаФормата.Следующий() Тогда
		Возврат ВыборкаФормата.Формат;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

// Возвращает пустую структуру для отбора форматов по умолчанию.
// 
// Возвращаемое значение:
// 	См. _ФорматыЭДО.НовыйОтборЗапросаФорматовПоУмолчанию
Функция НовыйОтборЗапросаФорматовПоУмолчанию() Экспорт
	Возврат ФорматыЭДО.НовыйОтборЗапросаФорматовПоУмолчанию();
КонецФункции

// Возвращает описание запроса, в результате которого будут содержаться форматы по умолчанию.
// Запрос содержит следующие поля:
//   * ВидДокумента - СправочникСсылка.ВидыДокументовЭДО
//   * Формат - Строка
//
// Параметры:
// 	ИмяВременнойТаблицы - Строка - таблица, в которую будет помещен результат запроса
// 	Отбор - См. НовыйОтборЗапросаФорматовПоУмолчанию
// Возвращаемое значение:
// 	См. _ФорматыЭДО.ЗапросФорматовПоУмолчанию
Функция ЗапросФорматовПоУмолчанию(ИмяВременнойТаблицы = "", Отбор = Неопределено) Экспорт
	Возврат ФорматыЭДО.ЗапросФорматовПоУмолчанию(ИмяВременнойТаблицы, Отбор);
КонецФункции

// Возвращает поддерживаемые форматы электронных документов.
//
// Возвращаемое значение:
// 	См. ФорматыЭДО.ПоддерживаемыеФорматы
Функция ПоддерживаемыеФорматы() Экспорт
	Возврат ФорматыЭДО.ПоддерживаемыеФорматы();
КонецФункции

// Формирует пустую структура параметров получения данных электронного документа.
//
// Возвращаемое значение:
// 	См. ФорматыЭДО.НовыеПараметрыПолученияДанныхДокумента
Функция НовыеПараметрыПолученияДанныхДокумента() Экспорт
	Возврат ФорматыЭДО.НовыеПараметрыПолученияДанныхДокумента();
КонецФункции

Функция ЭтоСтандартныйФормат(Формат) Экспорт
	Возврат ФорматыЭДО.ЭтоСтандартныйФормат(Формат);
КонецФункции

Функция ЭтоСлужебноеИмяДополнительногоПоля(ИмяПоля, Формат) Экспорт
	Возврат ФорматыЭДО.ЭтоСлужебноеИмяДополнительногоПоля(ИмяПоля, Формат);
КонецФункции

Функция ПрефиксСлужебныхДополнительныхДанных() Экспорт
	Возврат ФорматыЭДО.ПрефиксДополнительныхДанныхЭлектронныхДокументов();
КонецФункции

Процедура ПроверитьРегистрационныеДанныеДляОператораЭДО(ДеревоРегистрационнойИнформации, Ошибки) Экспорт
	
	ФорматыЭДО.ПроверитьРегистрационныеДанныеДляОператораЭДО(ДеревоРегистрационнойИнформации, Ошибки);
	
КонецПроцедуры

Функция ДанныеДокументаДляЗагрузкиПросмотра(ПараметрыПолучения) Экспорт
	Возврат ФорматыЭДО.ДанныеЭлектронногоДокумента(ПараметрыПолучения);
КонецФункции

#КонецОбласти

#Область Направления

Функция ДоступныеНаправленияДокументов() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Внутренний", Перечисления.НаправленияЭДО.Внутренний);
	Результат.Вставить("Входящий", Перечисления.НаправленияЭДО.Входящий);
	Результат.Вставить("Интеркампани", Перечисления.НаправленияЭДО.Интеркампани);
	Результат.Вставить("Исходящий", Перечисления.НаправленияЭДО.Исходящий);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ТипыДокументов

// Возвращает типы электронных документов, для которых доступно формирование на основании объекта учета.
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * АктВыполненныхРабот - ПеречислениеСсылка.ТипыДокументовЭДО - Акт об оказании услуг.
// * АктНаПередачуПрав - ПеречислениеСсылка.ТипыДокументовЭДО - Акт на передачу прав.
// * АктОРасхождениях - ПеречислениеСсылка.ТипыДокументовЭДО - Акт о расхождениях.
// * ВозвратТоваровМеждуОрганизациями - ПеречислениеСсылка.ТипыДокументовЭДО - Возврат товаров между организациями.
// * ЗаказТовара - ПеречислениеСсылка.ТипыДокументовЭДО - Заказ товара.
// * ЗапросКоммерческихПредложений - ПеречислениеСсылка.ТипыДокументовЭДО - Запрос коммерческих предложений.
// * КаталогТоваров - ПеречислениеСсылка.ТипыДокументовЭДО - Каталог товаров.
// * КоммерческоеПредложение - ПеречислениеСсылка.ТипыДокументовЭДО - Коммерческое предложение.
// * КорректировочныйСчетФактура - ПеречислениеСсылка.ТипыДокументовЭДО - Корректировочный счет-фактура.
// * ОтветНаЗаказ - ПеречислениеСсылка.ТипыДокументовЭДО - Ответ на заказ.
// * ОтчетОПродажахКомиссионногоТовара - ПеречислениеСсылка.ТипыДокументовЭДО - Отчет о продажах комиссионного товара.
// * ОтчетОСписанииКомиссионногоТовара - ПеречислениеСсылка.ТипыДокументовЭДО - Отчет о списании комиссионного товара.
// * ПередачаТоваровМеждуОрганизациями - ПеречислениеСсылка.ТипыДокументовЭДО - Передача товаров между организациями.
// * ПрайсЛист - ПеречислениеСсылка.ТипыДокументовЭДО - Прайс-лист.
// * СоглашениеОбИзмененииСтоимости - ПеречислениеСсылка.ТипыДокументовЭДО - Соглашение об изменении стоимости.
// * СчетНаОплату - ПеречислениеСсылка.ТипыДокументовЭДО - Счет на оплату.
// * СчетФактура - ПеречислениеСсылка.ТипыДокументовЭДО - Счет-фактура.
// * ТоварнаяНакладная - ПеречислениеСсылка.ТипыДокументовЭДО - Товарная накладная.
// * УКД - ПеречислениеСсылка.ТипыДокументовЭДО - УКД.
// * УПД - ПеречислениеСсылка.ТипыДокументовЭДО - УПД.
// 
Функция СтандартныеТипыДокументов() Экспорт
	
	ТипыДокументов = Новый Структура;
	
	ТипыДокументов.Вставить("АктВыполненныхРабот", Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот);
	ТипыДокументов.Вставить("АктНаПередачуПрав", Перечисления.ТипыДокументовЭДО.АктНаПередачуПрав);
	ТипыДокументов.Вставить("АктОРасхождениях", Перечисления.ТипыДокументовЭДО.АктОРасхождениях);
	ТипыДокументов.Вставить("ЗаказТовара", Перечисления.ТипыДокументовЭДО.ЗаказТовара);
	ТипыДокументов.Вставить("ЗапросКоммерческихПредложений", Перечисления.ТипыДокументовЭДО.ЗапросКоммерческихПредложений);
	ТипыДокументов.Вставить("КаталогТоваров", Перечисления.ТипыДокументовЭДО.КаталогТоваров);
	ТипыДокументов.Вставить("КоммерческоеПредложение", Перечисления.ТипыДокументовЭДО.КоммерческоеПредложение);
	ТипыДокументов.Вставить("КорректировочныйСчетФактура", Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура);
	ТипыДокументов.Вставить("ОтветНаЗаказ", Перечисления.ТипыДокументовЭДО.ОтветНаЗаказ);
	ТипыДокументов.Вставить("ОтчетОПродажахКомиссионногоТовара", Перечисления.ТипыДокументовЭДО.ОтчетОПродажахКомиссионногоТовара);
	ТипыДокументов.Вставить("ОтчетОСписанииКомиссионногоТовара", Перечисления.ТипыДокументовЭДО.ОтчетОСписанииКомиссионногоТовара);
	ТипыДокументов.Вставить("ПрайсЛист", Перечисления.ТипыДокументовЭДО.ПрайсЛист);
	ТипыДокументов.Вставить("СоглашениеОбИзмененииСтоимости", Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости);
	ТипыДокументов.Вставить("СчетНаОплату", Перечисления.ТипыДокументовЭДО.СчетНаОплату);
	ТипыДокументов.Вставить("СчетФактура", Перечисления.ТипыДокументовЭДО.СчетФактура);
	ТипыДокументов.Вставить("ТоварнаяНакладная", Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная);
	ТипыДокументов.Вставить("КаталогТоваров", Перечисления.ТипыДокументовЭДО.КаталогТоваров);
	ТипыДокументов.Вставить("РеквизитыОрганизации", Перечисления.ТипыДокументовЭДО.РеквизитыОрганизации);	
	ТипыДокументов.Вставить("УПД", Перечисления.ТипыДокументовЭДО.УПД);
	ТипыДокументов.Вставить("УКД", Перечисления.ТипыДокументовЭДО.УКД);
	
	ТипыДокументов.Вставить("ВозвратТоваровМеждуОрганизациями", Перечисления.ТипыДокументовЭДО.ВозвратТоваровМеждуОрганизациями);
	ТипыДокументов.Вставить("ПередачаТоваровМеждуОрганизациями", Перечисления.ТипыДокументовЭДО.ПередачаТоваровМеждуОрганизациями);
	
	Возврат ТипыДокументов;
	
КонецФункции

// Возвращает доступные типы для электронного документа произвольного формата.
// 
// Возвращаемое значение:
// 	Массив из ПеречислениеСсылка.ТипыДокументовЭДО - типы электронного документа.
Функция ТипыДокументовПроизвольногоФормата() Экспорт
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.АктВзаимозачета);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.АктСверки);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.Ведомость);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.ГарантийноеПисьмо);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.Договор);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.ДополнительноеСоглашение);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.КС11);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.КС2);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.КС3);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.Отчет);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.ПлатежноеПоручение);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.ПриложениеКАкту);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.Прочее);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.СоглашениеОбЭДО);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.Спецификация);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.Уведомление);
	Возврат ТипыДокументов;
КонецФункции

// Определяет является ли тип документа стандартным.
// 
// Параметры:
// 	ТипДокумента - ПеречислениеСсылка.ТипыДокументовЭДО - Тип электронного документа.
// Возвращаемое значение:
// 	Булево - Тип является стандартным.
//
Функция ЭтоСтандартныйТипДокумента(ТипДокумента) Экспорт
	Для Каждого СтандартныйТип Из СтандартныеТипыДокументов() Цикл
		Если СтандартныйТип.Значение = ТипДокумента Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

// Определяет является ли тип документа прикладным.
// 
// Параметры:
// 	ТипДокумента - ПеречислениеСсылка.ТипыДокументовЭДО - Тип электронного документа.
// Возвращаемое значение:
// 	Булево - Признак прикладного типа.
//
Функция ЭтоПрикладнойТипДокумента(ТипДокумента) Экспорт
	Возврат ТипДокумента = Перечисления.ТипыДокументовЭДО.Прикладной;
КонецФункции

// Определяет является ли тип документа типом документов интеркампани.
// 
// Параметры:
// 	ТипДокумента - ПеречислениеСсылка.ТипыДокументовЭДО - Тип электронного документа.
// Возвращаемое значение:
// 	Булево - Признак типа документа интеркампани.
//
Функция ЭтоТипДокументаИнтеркампани(ТипДокумента) Экспорт
	Возврат ТипДокумента = Перечисления.ТипыДокументовЭДО.ПередачаТоваровМеждуОрганизациями
		ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.ВозвратТоваровМеждуОрганизациями
КонецФункции

// Определяет является ли тип документа типом служебных документов.
// 
// Параметры:
// 	ТипДокумента - ПеречислениеСсылка.ТипыДокументовЭДО - Тип электронного документа.
// Возвращаемое значение:
// 	Булево - Признак типа служебного документа.
//
Функция ЭтоТипДокументаСлужебный(ТипДокумента) Экспорт
	Возврат ТипДокумента = Перечисления.ТипыДокументовЭДО.ПодтверждениеОператораЭДО
		ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.ИзвещениеОПолучении
		ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.УведомлениеОбУточнении
		ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.ПредложениеОбАннулировании;
КонецФункции

// Определяет тип служебного документа по типу элемента регламента.
// 
// Параметры:
// 	ТипЭлементаРегламента - ПеречислениеСсылка.ТипыЭлементовРегламентаЭДО - Тип элемента регламента.
// Возвращаемое значение:
// 	ПеречислениеСсылка.ТипыДокументовЭДО - Тип электронного документа.
Функция ТипСлужебногоДокумента(ТипЭлементаРегламента) Экспорт
	
	ТипДокумента = Перечисления.ТипыДокументовЭДО.ПустаяСсылка();
	
	Если ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИОП
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИОП_ПДО_ИОП
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя_ПДО_ИОП
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПДО_ИОП
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПДП_ИОП
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.УОУ_ИОП Тогда
		ТипДокумента = Перечисления.ТипыДокументовЭДО.ИзвещениеОПолучении;
	ИначеЕсли ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПДО
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПДП
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя_ПДО Тогда
		ТипДокумента = Перечисления.ТипыДокументовЭДО.ПодтверждениеОператораЭДО;
	ИначеЕсли ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.УОУ
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПОА_УОУ Тогда
		ТипДокумента = Перечисления.ТипыДокументовЭДО.УведомлениеОбУточнении;
	ИначеЕсли ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПОА Тогда
		ТипДокумента = Перечисления.ТипыДокументовЭДО.ПредложениеОбАннулировании;
	КонецЕсли;
	
	Возврат ТипДокумента;
	
КонецФункции

#КонецОбласти

#Область ВидыДокументов

// Возвращает виды исходящих электронных документов, используемые в конфигурации.
// 
// Возвращаемое значение:
// См. ВидыДокументовДоступныхТипов
Функция ИспользуемыеВидыДокументовИсходящие() Экспорт
	
	ИспользуемыеТипыДокументов = ИнтеграцияЭДО.ИспользуемыеТипыДокументов();
	
	ТипыДокументов = Новый Массив;
	
	Для Каждого ТипДокумента Из ИспользуемыеТипыДокументов Цикл
		Если ТипДокумента.Значение["ИспользоватьДляИсходящих"] Тогда
			ТипыДокументов.Добавить(ТипДокумента.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	ТипыДокументов = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ТипыДокументов, ТипыДокументовИнтеркампани());
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ТипыДокументов, ТипыДокументовПроизвольногоФормата(), Истина);
	
	ВидыДокументовПоТипам = НайтиСоздатьВидыДокументов(ТипыДокументов);
	
	ВидыДокументов = ВыгрузитьВидыДокументовПоТипам(ВидыДокументовПоТипам);
	
	Возврат ВидыДокументов;
	
КонецФункции

// Возвращает виды входящих электронных документов, используемые в конфигурации.
// 
// Возвращаемое значение:
// См. ВидыДокументовДоступныхТипов
Функция ИспользуемыеВидыДокументовВходящие() Экспорт
	
	ИспользуемыеТипыДокументов = ИнтеграцияЭДО.ИспользуемыеТипыДокументов();
	
	ТипыДокументов = Новый Массив;
	
	Для Каждого ТипДокумента Из ИспользуемыеТипыДокументов Цикл
		Если ТипДокумента.Значение["ИспользоватьДляВходящих"] Тогда
			ТипыДокументов.Добавить(ТипДокумента.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	ТипыДокументов = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ТипыДокументов, ТипыДокументовИнтеркампани());
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ТипыДокументов, ТипыДокументовПроизвольногоФормата(), Истина);
	
	ВидыДокументовПоТипам = НайтиСоздатьВидыДокументов(ТипыДокументов);
	
	ВидыДокументов = ВыгрузитьВидыДокументовПоТипам(ВидыДокументовПоТипам);
	
	Возврат ВидыДокументов;
	
КонецФункции

// Возвращает виды электронных документов, используемые в конфигурации, при обмене между организациями.
// 
// Возвращаемое значение:
// См. ВидыДокументовДоступныхТипов
Функция ИспользуемыеВидыДокументовИнтеркампани() Экспорт
	
	ТипыДокументов = ТипыДокументовИнтеркампани();
	
	ВидыДокументовПоТипам = НайтиСоздатьВидыДокументов(ТипыДокументов);
	
	ВидыДокументов = ВыгрузитьВидыДокументовПоТипам(ВидыДокументовПоТипам);
	
	Возврат ВидыДокументов;
	
КонецФункции

// Возвращает виды электронных документов, используемые в конфигурации, при прямом обмене.
// 
// Возвращаемое значение:
// См. ВидыДокументовДоступныхТипов
Функция ИспользуемыеВидыДокументовПрямогоОбмена() Экспорт
	
	ТипыДокументов = ТипыДокументовПрямогоОбмена();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ТипыДокументов, ТипыДокументовПроизвольногоФормата(), Истина);
	
	ВидыДокументовПоТипам = НайтиСоздатьВидыДокументов(ТипыДокументов);
	
	ВидыДокументов = ВыгрузитьВидыДокументовПоТипам(ВидыДокументовПоТипам);
	
	Возврат ВидыДокументов;
	
КонецФункции

// Возвращает прикладные виды электронных документов.
// 
// Возвращаемое значение:
// Массив из СправочникСсылка.ВидыДокументовЭДО - набор видов электронных документов.
Функция ПрикладныеВидыДокументов() Экспорт
	
	ВидыДокументов = Новый Массив;
	ТипыДокументов = ИнтеграцияЭДО.ПрикладныеТипыЭлектронныхДокументов();
	
	Для Каждого ТипДокумента Из ТипыДокументов Цикл
		ВидДокумента = ВидДокументаПоПрикладномуТипу(ТипДокумента);
		ВидыДокументов.Добавить(ВидДокумента);
	КонецЦикла;
	
	Возврат ВидыДокументов;
	
КонецФункции

// Возвращает виды доступные для формирования электронного документа произвольного формата.
// 
// Возвращаемое значение:
// 	Массив из СправочникСсылка.ВидыДокументовЭДО - доступные виды документов.
Функция ВидыДокументовДляПроизвольногоФормата() Экспорт
	
	ТипыДокументов = ТипыДокументовПроизвольногоФормата();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыДокументовЭДО.Ссылка
		|ИЗ
		|	Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|ГДЕ
		|	ВидыДокументовЭДО.ТипДокумента В (&ТипыДокументов)";
	
	Запрос.УстановитьПараметр("ТипыДокументов", ТипыДокументов);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Возвращает вид электронного документа по доступному типу электронного документа.
// 
// Параметры:
// 	ТипДокумента - ПеречислениеСсылка.ТипыДокументовЭДО - Значение элемента структуры СтандартныеТипыДокументов.
// Возвращаемое значение:
// 	СправочникСсылка.ВидыДокументовЭДО - Ссылка на вид электронного документа.
Функция ВидДокументаПоТипу(ТипДокумента) Экспорт
	
	Если Не ЗначениеЗаполнено(ТипДокумента) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнено значение параметра ""Тип документа""'");
	КонецЕсли;
	
	ПараметрыПоиска = НовыеПараметрыПоискаВидаДокумента(ТипДокумента);
	Возврат НайтиСоздатьВидДокумента(ПараметрыПоиска);
	
КонецФункции

// Возвращает виды электронных документов по стандартным типам электронных документов.
// Не подходит для поиска по внутренним и прикладным типам документов.
// 
// Параметры:
//  ТипыДокументов - Массив из ПеречислениеСсылка.ТипыДокументовЭДО - Набор прикладных типов электронных документов.
// Возвращаемое значение:
//  Соответствие - Описание:
//   * Ключ - ПеречислениеСсылка.ТипыДокументовЭДО - Ссылка на тип документа.
//   * Значение - СправочникСсылка.ВидыДокументовЭДО - Ссылка на вид электронного документа.
//                                                     Для внутреннего и прикладного документа возращается пустая ссылка.
Функция ВидыДокументовПоСтандартнымТипам(ТипыДокументов) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыДокументовЭДО.Ссылка,
		|	ВидыДокументовЭДО.ТипДокумента
		|ИЗ
		|	Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|ГДЕ
		|	ВидыДокументовЭДО.ТипДокумента В (&ТипыДокументов)
		|	И ВидыДокументовЭДО.ПрикладнойТипДокумента = &ПрикладнойТипДокумента
		|	И ВидыДокументовЭДО.ИдентификаторКомандыПечати = &ИдентификаторКомандыПечати
		|	И ВидыДокументовЭДО.ИдентификаторОбъектаУчета = &ИдентификаторОбъектаУчета";
	
	Запрос.УстановитьПараметр("ТипыДокументов", ТипыДокументов);
	Запрос.УстановитьПараметр("ПрикладнойТипДокумента", ИнтеграцияЭДО.ПустойПрикладнойТипЭлектронногоДокумента());
	Запрос.УстановитьПараметр("ИдентификаторОбъектаУчета", ИнтеграцияБСПБЭД.ПустойИдентификаторОбъектаМетаданных());
	Запрос.УстановитьПараметр("ИдентификаторКомандыПечати", "");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ТипДокумента, Выборка.Ссылка);
	КонецЦикла;
	
	Если ТипыДокументов.Количество() = Результат.Количество() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ТипДокумента Из ТипыДокументов Цикл
		Если Не ЗначениеЗаполнено(ТипДокумента)
			ИЛИ Результат[ТипДокумента] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ПараметрыПоиска = НовыеПараметрыПоискаВидаДокумента(ТипДокумента);
		ВидДокумента = СоздатьВидДокумента(ПараметрыПоиска);
		Результат.Вставить(ТипДокумента, ВидДокумента);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает вид электронного документа по прикладному типу электронного документа.
// 
// Параметры:
// 	ПрикладнойТипДокумента - ОпределяемыйТип.ПрикладныеТипыЭлектронныхДокументовЭДО - Значение прикладного типа электронного документа.
// Возвращаемое значение:
// 	СправочникСсылка.ВидыДокументовЭДО - Ссылка на вид электронного документа.
Функция ВидДокументаПоПрикладномуТипу(ПрикладнойТипДокумента) Экспорт
	
	Если Не ЗначениеЗаполнено(ПрикладнойТипДокумента) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнено значение параметра ""Прикладной тип документа""'");
	КонецЕсли;
	
	ПараметрыПоиска = НовыеПараметрыПоискаВидаДокумента(Перечисления.ТипыДокументовЭДО.Прикладной);
	ПараметрыПоиска.ПрикладнойТипДокумента = ПрикладнойТипДокумента;
	Возврат НайтиСоздатьВидДокумента(ПараметрыПоиска);
	
КонецФункции

// Возвращает виды электронных документов по прикладным типам электронных документов.
// 
// Параметры:
//  ПрикладныеТипыДокументов - Массив из ОпределяемыйТип.ПрикладныеТипыЭлектронныхДокументовЭДО - набор прикладных типов электронных документов.
// Возвращаемое значение:
//  Соответствие - Описание:
//   * Ключ - ОпределяемыйТип.ПрикладныеТипыЭлектронныхДокументовЭДО - Ссылка на прикладной тип.
//   * Значение - СправочникСсылка.ВидыДокументовЭДО - Ссылка на вид электронного документа.
Функция ВидыДокументовПоПрикладнымТипам(ПрикладныеТипыДокументов) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыДокументовЭДО.Ссылка,
		|	ВидыДокументовЭДО.ПрикладнойТипДокумента
		|ИЗ
		|	Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|ГДЕ
		|	ВидыДокументовЭДО.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыДокументовЭДО.Прикладной)
		|	И ВидыДокументовЭДО.ПрикладнойТипДокумента В (&ПрикладныеТипыДокументов)";
	
	Запрос.УстановитьПараметр("ПрикладныеТипыДокументов", ПрикладныеТипыДокументов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ПрикладнойТипДокумента, Выборка.Ссылка);
	КонецЦикла;
	
	Если ПрикладныеТипыДокументов.Количество() = Результат.Количество() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ПрикладнойТип Из ПрикладныеТипыДокументов Цикл
		Если Не ЗначениеЗаполнено(ПрикладнойТип)
			ИЛИ Результат[ПрикладнойТип] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ПараметрыПоиска = НовыеПараметрыПоискаВидаДокумента(Перечисления.ТипыДокументовЭДО.Прикладной);
		ПараметрыПоиска.ПрикладнойТипДокумента = ПрикладнойТип;
		ВидДокумента = СоздатьВидДокумента(ПараметрыПоиска);
		Результат.Вставить(ПрикладнойТип, ВидДокумента);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает описание вида электронного документа.
// 
// Параметры:
// 	ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - Ссылка на вид электронного документа.
// Возвращаемое значение:
// 	Структура - Описание:
// ** ТипДокумента - ПеречислениеСсылка.ТипыДокументовЭДО - Тип электронного документа.
// ** ПрикладнойТипДокумента - ОпределяемыйТип.ПрикладныеТипыЭлектронныхДокументовЭДО - Прикладной тип электронного документа.
// ** ИдентификаторКомандыПечати - Строка - Идентификатор команды печати.
// ** ИдентификаторОбъектаУчета - СправочникСсылка.ИдентификаторыОбъектовМетаданных - Ссылка на идентификатор объекта метаданных.
Функция ОписаниеВидаДокумента(ВидДокумента) Экспорт
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидДокумента,
		"ТипДокумента, ПрикладнойТипДокумента, ИдентификаторКомандыПечати, ИдентификаторОбъектаУчета");
КонецФункции

// Возвращает описания видов электронных документов.
// 
// Параметры:
// 	ВидыДокументов - Массив из СправочникСсылка.ВидыДокументовЭДО - Ссылки на виды электронных документов.
// Возвращаемое значение:
// 	Соответствие - Описание:
// * Ключ - СправочникСсылка.ВидыДокументовЭДО - Ссылка на вид электронного документа.
// * Значение - Структура - См. ОписаниеВидаДокумента
Функция ОписанияВидовДокументов(ВидыДокументов) Экспорт
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ВидыДокументов,
		"ТипДокумента, ПрикладнойТипДокумента, ИдентификаторКомандыПечати, ИдентификаторОбъектаУчета");
КонецФункции

// Определяет соответсвует ли тип вида документа прикладному типу.
// 
// Параметры:
// 	ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - ссылка на вид документа.
// Возвращаемое значение:
// 	Булево - вид имеет тип документа запрос коммерческих предложений.
Функция ЭтоПрикладнойВидДокумента(ВидДокумента) Экспорт
	Возврат ТипВидаДокументаСоотвествуетТипу(ВидДокумента,
		Перечисления.ТипыДокументовЭДО.Прикладной);
КонецФункции

// Определяет соответсвует ли тип вида документа внутреннему типу.
// 
// Параметры:
// 	ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - ссылка на вид документа.
// Возвращаемое значение:
// 	Булево - вид имеет тип документа запрос коммерческих предложений.
Функция ЭтоВнутреннийВидДокумента(ВидДокумента) Экспорт
	Возврат ТипВидаДокументаСоотвествуетТипу(ВидДокумента,
		Перечисления.ТипыДокументовЭДО.Внутренний);
КонецФункции

// Возвращает заменяемые виды документов для видов УПД и УКД.
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * УПД - Структура - Описание:
// ** ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - Ссылка на вид документа УПД.
// ** ЗаменяемыеВидыДокументов - Массив из СправочникСсылка.ВидыДокументовЭДО - Ссылки на заменяемые виды УПД.
// * УКД - Структура - Описание:
// ** ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - Ссылка на вид документа УКД.
// ** ЗаменяемыеВидыДокументов - Массив из СправочникСсылка.ВидыДокументовЭДО - Ссылки на заменяемые виды УКД.
Функция ВидыДокументовЗаменяемыеУПДУКД() Экспорт
	
	ЗаменяемыеВиды = Новый Структура;
	ЗаменяемыеВиды.Вставить("УПД", Новый Структура);
	ЗаменяемыеВиды.УПД.Вставить("ВидДокумента", Справочники.ВидыДокументовЭДО.ПустаяСсылка());
	ЗаменяемыеВиды.УПД.Вставить("ЗаменяемыеВидыДокументов", Новый Массив);
	ЗаменяемыеВиды.Вставить("УКД", Новый Структура);
	ЗаменяемыеВиды.УКД.Вставить("ВидДокумента", Справочники.ВидыДокументовЭДО.ПустаяСсылка());
	ЗаменяемыеВиды.УКД.Вставить("ЗаменяемыеВидыДокументов", Новый Массив);
	
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.УПД);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.АктНаПередачуПрав);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.СчетФактура);
	
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.УКД);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура);
	
	ВидыДокументовПоТипам = ВидыДокументовПоТипам(ТипыДокументов);
	
	Для Каждого ТипДокумента Из ТипыДокументов Цикл
		
		Если ТипДокумента = Перечисления.ТипыДокументовЭДО.УПД Тогда
			ЗаменяемыеВиды.УПД.ВидДокумента = ВидыДокументовПоТипам[ТипДокумента];
			МассивВидов = ЗаменяемыеВиды.УПД.ЗаменяемыеВидыДокументов;
		ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.УКД Тогда
			ЗаменяемыеВиды.УКД.ВидДокумента = ВидыДокументовПоТипам[ТипДокумента];
			МассивВидов = ЗаменяемыеВиды.УКД.ЗаменяемыеВидыДокументов;
		Иначе
			МассивВидов.Добавить(ВидыДокументовПоТипам[ТипДокумента]);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЗаменяемыеВиды;
	
КонецФункции

// Определяет дополнительные виды электронных документов по данным файла.
//
// Возвращаемое значение:
// 	См. ФорматыЭДО.ДополнительныеВидыДокументовУПД
Функция ДополнительныеВидыДокументовУПД(ОписаниеФайла) Экспорт
	Возврат ФорматыЭДО.ДополнительныеВидыДокументовУПД(ОписаниеФайла);
КонецФункции

// Возвращает пустую структуру для отбора видов документов.
// 
// Возвращаемое значение:
// 	Структура:
// * Ссылка - Строка - Параметр или выражение для отбора по ссылке.
Функция НовыйОтборВидовДокументов() Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", "");
	Отбор.Вставить("ТипДокумента", "");
	Отбор.Вставить("ИдентификаторОбъектаУчета", "");
	
	Возврат Отбор;
	
КонецФункции

// Возвращает описание запроса, в результате которого будут содержаться виды документов.
// Запрос содержит следующие поля:
//   * Ссылка - СправочникСсылка.ВидыДокументовЭДО
//   * Наименование - Строка
//   * ИдентификаторОбъектаУчета - СправочникСсылка.ИдентификаторыОбъектовМетаданных
//   * ИдентификаторКомандыПечати - Строка.
// 
// Параметры:
// 	ИмяВременнойТаблицы - Строка - таблица, в которую будет помещен результат запроса
// 	Отбор - см. НовыйОтборВидовДокументов
// Возвращаемое значение:
// 	см. ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса()
Функция ЗапросВидовДокументов(ИмяВременнойТаблицы, Отбор = Неопределено) Экспорт
	
	Если Отбор = Неопределено Тогда
		Отбор = НовыйОтборВидовДокументов();
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВидыДокументовЭДО.Ссылка,
	|	ВидыДокументовЭДО.Наименование,
	|	ВидыДокументовЭДО.ТипДокумента,
	|	ВидыДокументовЭДО.ИдентификаторКомандыПечати,
	|	ВидыДокументовЭДО.ИдентификаторОбъектаУчета
	|ПОМЕСТИТЬ ИмяВременнойТаблицы
	|ИЗ
	|	Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
	|ГДЕ
	|&ПоляУсловия";
	
	ПоляУсловия = Новый Массив;
	Если ЗначениеЗаполнено(Отбор.Ссылка) Тогда
		ПоляУсловия.Добавить(СтрШаблон("ВидыДокументовЭДО.Ссылка В (%1)", Отбор.Ссылка));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор.ТипДокумента) Тогда
		ПоляУсловия.Добавить(СтрШаблон("ВидыДокументовЭДО.ТипДокумента В (%1)", Отбор.ТипДокумента));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор.ИдентификаторОбъектаУчета) Тогда
		ПоляУсловия.Добавить(СтрШаблон("ВидыДокументовЭДО.ИдентификаторОбъектаУчета В (%1)", Отбор.ИдентификаторОбъектаУчета));
	КонецЕсли;
	
	ТекстЗапроса = ОбщегоНазначенияБЭД.ТекстЗапросаИзШаблона(ТекстЗапроса, ИмяВременнойТаблицы, "", ПоляУсловия);
	ОписаниеЗапроса = ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса();
	ОписаниеЗапроса.Текст = ТекстЗапроса;
	
	Возврат ОписаниеЗапроса;
	
КонецФункции

// Возвращает вид внутреннего электронного документа, если документ не найден, создает
// и возвращает ссылку на созданный элемент.
//
// Параметры:
//  ИдентификаторОбъектаУчета - СправочникСсылка.ИдентификаторыОбъектовМетаданных
//  КомандаПечати - Структура:
//    * Идентификатор - Строка
//    * Представление - Строка
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыДокументовЭДО
//
Функция НайтиСоздатьВидВнутреннегоДокумента(ИдентификаторОбъектаУчета, КомандаПечати) Экспорт
	
	ПараметрыПоиска = НовыеПараметрыПоискаВидаДокумента(Перечисления.ТипыДокументовЭДО.Внутренний);
	ПараметрыПоиска.ИдентификаторОбъектаУчета  = ИдентификаторОбъектаУчета;
	ПараметрыПоиска.ИдентификаторКомандыПечати = КомандаПечати.Идентификатор;
	ПараметрыПоиска.ПредставлениеКомандыПечати = КомандаПечати.Представление;
	
	Возврат НайтиСоздатьВидДокумента(ПараметрыПоиска);
	
КонецФункции

// Возвращает команды печати доступные для внутреннего ЭДО.
// 
// Параметры:
// 	ОбъектМетаданных - ОбъектМетаданных - объект метаданных конфигурации.
// Возвращаемое значение:
// 	ТаблицаЗначений - См. ИнтеграцияЭДО.КомандыПечатиДляВнутреннегоЭДО
Функция КомандыПечатиДляВнутреннегоЭДО(ОбъектМетаданных) Экспорт
	
	Возврат ИнтеграцияЭДО.КомандыПечатиДляВнутреннегоЭДО(ОбъектМетаданных);
	
КонецФункции

// Возвращает виды документов доступные для изменения.
// 
// Параметры:
// 	РезультатРаспознания - См. РаспознатьСообщение
// 	ТипРегламента - ПеречислениеСсылка.ТипыРегламентовЭДО - Тип регламента электронного документа.
// Возвращаемое значение:
// 	Массив из СправочникСсылка.ВидыДокументовЭДО - Виды электронных документов.
Функция ВидыДокументовДляИзменения(РезультатРаспознания, ТипРегламента) Экспорт
	
	ВидыДокументовДляОтражения = Новый Массив;
	
	ОтражениеВУчете = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатРаспознания,
		"ОтражениеВУчете", Новый Структура);
	ФорматОтраженияВУчете = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОтражениеВУчете,
		"Формат", "");
	Если ПустаяСтрока(ФорматОтраженияВУчете) Тогда
		Возврат ВидыДокументовДляОтражения;
	КонецЕсли;
	
	ВидыДокументовДляОтражения = ВидыДокументовПоФормату(ФорматОтраженияВУчете);
	
	Если Не ЗначениеЗаполнено(ВидыДокументовДляОтражения)
		И ТипРегламента = Перечисления.ТипыРегламентовЭДО.Неформализованный Тогда
		ВидыДокументовДляОтражения = ЭлектронныеДокументыЭДО.ВидыДокументовДляПроизвольногоФормата();
	КонецЕсли;
	
	Возврат ВидыДокументовДляОтражения;
	
КонецФункции

// Изменяет виды сообщений при изменении вида документа.
// 
// Параметры:
// 	ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - ссылка на электронный документ.
// 	ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - Устанавливаемый вид электронного документа.
// 	Отказ - Булево - Признак отказа от записи изменения.
Процедура ПриИзмененииВидаДокумента(ЭлектронныйДокумент, ВидДокумента, Отказ) Экспорт
	
	Если Не ЗначениеЗаполнено(ВидДокумента) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	 
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Документ.СообщениеЭДО");
	ЭлементБлокировки.УстановитьЗначение("ЭлектронныйДокумент", ЭлектронныйДокумент);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	СообщениеЭДО.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.СообщениеЭДО КАК СообщениеЭДО
			|ГДЕ
			|	СообщениеЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент
			|	И СообщениеЭДО.ТипЭлементаРегламента В (&ТипыЭлементовРегламента)";
		
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
		
		ТипыЭлементовРегламента = Новый Массив;
		ТипыЭлементовРегламента.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);
		ТипыЭлементовРегламента.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя);
		
		Запрос.УстановитьПараметр("ТипыЭлементовРегламента", ТипыЭлементовРегламента);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СообщениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СообщениеОбъект.ВидСообщения = ВидДокумента;
			СообщениеОбъект.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Формирует список способов отражения в учете входящего электронного документа определенного вида.
//
// Параметры:
//  ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - вид электронного документа
//  ДобавлятьПредопределенныеСпособы - Булево - признак добавления способов "Вручную" и "Автоматически"
// (последний - если в переопределяемом модуле не указаны способы отражения для вида ЭД)
//  Префикс	 - Строка - текст, который будет добавлен к представлению способа обработки.
// 
// Возвращаемое значение:
//  СписокЗначений - список способов обработки с указанием представления и отметки в списке используемого по-умолчанию способа.
//
Функция СписокОперацийВидаДокумента(ВидДокумента, ДобавлятьПредопределенныеСпособы = Ложь, Префикс = "") Экспорт 
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидДокумента, "ТипДокумента, ПрикладнойТипДокумента");
	
	ТипДокумента = ЗначенияРеквизитов.ТипДокумента;
	
	Если ТипДокумента = Перечисления.ТипыДокументовЭДО.УПД Тогда
		ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетФактура;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.УКД Тогда
		ТипДокумента = Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.Прикладной Тогда
		ТипДокумента = ЗначенияРеквизитов.ПрикладнойТипДокумента;
	КонецЕсли;
	
	Возврат ИнтеграцияЭДО.СписокОперацийТипаДокумента(ТипДокумента, ДобавлятьПредопределенныеСпособы, Префикс);
	
КонецФункции

Процедура ЗаполнитьНаименованиеВидаДокумента(ВидДокументаОбъект, ПредставлениеКомандыПечати = "") Экспорт
	
	Если ВидДокументаОбъект.ТипДокумента = Перечисления.ТипыДокументовЭДО.Прикладной Тогда
		ВидДокументаОбъект.Наименование = Строка(ВидДокументаОбъект.ПрикладнойТипДокумента);
	ИначеЕсли ВидДокументаОбъект.ТипДокумента = Перечисления.ТипыДокументовЭДО.Внутренний Тогда
		Если ЗначениеЗаполнено(ПредставлениеКомандыПечати) Тогда
			ВидДокументаОбъект.Наименование = ПредставлениеКомандыПечати;
		Иначе
			ВидДокументаОбъект.Наименование = ИнтерфейсДокументовЭДО.ПредставлениеКомандыПечатиОбъекта(
				ВидДокументаОбъект.ИдентификаторОбъектаУчета, ВидДокументаОбъект.ИдентификаторКомандыПечати)
		КонецЕсли;
	Иначе
		ВидДокументаОбъект.Наименование = Строка(ВидДокументаОбъект.ТипДокумента);
		ВидДокументаОбъект.КраткоеНаименование = КраткоеНаименованиеТипаДокумента(ВидДокументаОбъект.ТипДокумента);
	КонецЕсли;
	
	Если ПустаяСтрока(ВидДокументаОбъект.КраткоеНаименование) Тогда
		ВидДокументаОбъект.КраткоеНаименование = ВидДокументаОбъект.Наименование;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Настройки

// Возвращает ключ настроек отправки по объекту учета.
//
// Параметры:
//  ОписаниеОбъектаУчета - См. ИнтеграцияЭДО.ОписаниеОбъектаУчета
//
// Возвращаемое значение:
//  См. НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки, Неопределено - ключ настроек отправки.
//  	Неопределено, если не удалось определить.
//
Функция КлючНастроекОтправкиОбъектаУчета(ОписаниеОбъектаУчета) Экспорт
	
	Если ОписаниеОбъектаУчета.Направление <> Перечисления.НаправленияЭДО.Исходящий Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КлючНастроек = НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки();
	
	Если ОписаниеОбъектаУчета.ТипДокумента = Перечисления.ТипыДокументовЭДО.Прикладной Тогда
		ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоПрикладномуТипу(ОписаниеОбъектаУчета.ПрикладнойТипДокумента);
	Иначе
		ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(ОписаниеОбъектаУчета.ТипДокумента);
	КонецЕсли;
	
	КлючНастроек.ВидДокумента = ВидДокумента;
	КлючНастроек.Отправитель = ОписаниеОбъектаУчета.Организация;
	КлючНастроек.Получатель = ОписаниеОбъектаУчета.Контрагент;
	КлючНастроек.Договор = ОписаниеОбъектаУчета.Договор;
	
	Возврат КлючНастроек;
	
КонецФункции

// Возвращает ключи настроек отправки по объектам учета.
//
// Параметры:
//  ОписанияОбъектовУчета - См. ИнтеграцияЭДО.ОписанияОбъектовУчета.
//
// Возвращаемое значение:
// 	ТаблицаЗначений - Описание:
// 	* ОбъектУчета - ОпределяемыеТипы.ОснованияЭлектронныхДокументовЭДО - Ссылка на объект учета.
// 	* Организация - ОпределяемыеТипы.Организация - Ссылка на организацию.
// 	* Контрагент - ОпределяемыеТипы.КонтрагентБЭД - Ссылка на контрагента
// 	* Договор - ОпределяемыеТипы.ДоговорСКонтрагентомЭДО - Ссылка на договор.
// 	* ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - Ссылка на вид электронного документа.
//
Функция КлючиНастроекОтправкиОбъектовУчета(ОписанияОбъектовУчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОписанияОбъектовУчета.ОбъектУчета КАК ОбъектУчета,
		|	ОписанияОбъектовУчета.Организация КАК Организация,
		|	ОписанияОбъектовУчета.Контрагент КАК Контрагент,
		|	ОписанияОбъектовУчета.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ОписанияОбъектовУчета.ТипДокумента КАК ТипДокумента
		|ПОМЕСТИТЬ ОписанияОбъектовУчета
		|ИЗ
		|	&ОписанияОбъектовУчета КАК ОписанияОбъектовУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОписанияОбъектовУчета.ОбъектУчета КАК ОбъектУчета,
		|	ОписанияОбъектовУчета.Организация КАК Организация,
		|	ОписанияОбъектовУчета.Контрагент КАК Контрагент,
		|	ОписанияОбъектовУчета.ДоговорКонтрагента КАК Договор,
		|	ВидыДокументовЭДО.Ссылка КАК ВидДокумента
		|ИЗ
		|	ОписанияОбъектовУчета КАК ОписанияОбъектовУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|		ПО ОписанияОбъектовУчета.ТипДокумента = ВидыДокументовЭДО.ТипДокумента";
	Запрос.УстановитьПараметр("ОписанияОбъектовУчета", ОписанияОбъектовУчета);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ШаблоныНастроекОтправкиВидовДокументов(ВидыДокументов) Экспорт
	
	ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
	
	ШаблоныНастроек = Новый ТаблицаЗначений;
	ШаблоныНастроек.Колонки.Добавить("ВидДокумента", Новый ОписаниеТипов("СправочникСсылка.ВидыДокументовЭДО"));
	ШаблоныНастроек.Колонки.Добавить("Формат", Новый ОписаниеТипов("Строка"));
	ШаблоныНастроек.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число",,,
		Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	ШаблоныНастроек.Колонки.Добавить("Группа", Новый ОписаниеТипов("Строка"));
	ШаблоныНастроек.Колонки.Добавить("ПриоритетГруппы", Новый ОписаниеТипов("Число",,,
		Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	ШаблоныНастроек.Колонки.Добавить("ДокументУчета", Новый ОписаниеТипов("Строка"));
	ШаблоныНастроек.Колонки.Добавить("МаршрутПодписания", Новый ОписаниеТипов("СправочникСсылка.МаршрутыПодписания"));
	ШаблоныНастроек.Колонки.Добавить("ТребуетсяИзвещениеОПолучении", ОписаниеТиповБулево);
	ШаблоныНастроек.Колонки.Добавить("ТребуетсяОтветнаяПодпись", ОписаниеТиповБулево);
	ШаблоныНастроек.Колонки.Добавить("РедактироватьПодпись", ОписаниеТиповБулево);
	ШаблоныНастроек.Колонки.Добавить("РедактироватьИзвещение", ОписаниеТиповБулево);
	ШаблоныНастроек.Колонки.Добавить("РедактироватьОтветнуюПодпись", ОписаниеТиповБулево);
	
	ОтборФорматов = НовыйОтборФорматовЭлектронныхДокументов();
	ОтборФорматов.ВидыДокументов = ВидыДокументов;
	ОтборФорматов.Действует = Истина;
	Форматы = ФорматыЭлектронныхДокументов(ОтборФорматов);
	
	ПредставленияОснованийПоТипам = ИнтеграцияЭДО.ПредставленияОснованийПоТипамДокументов();
	
	ОписанияВидовДокументов = ОписанияВидовДокументов(ВидыДокументов);
	
	Для Каждого Элемент Из ОписанияВидовДокументов Цикл
		
		ВидДокумента = Элемент.Ключ;
		ОписаниеВида = Элемент.Значение;
		
		ИдентификаторФормата = "";
		СведенияОФормате = Форматы.Найти(ВидДокумента, "ВидДокумента");
		Если СведенияОФормате <> Неопределено Тогда
			ИдентификаторФормата = СведенияОФормате.ИдентификаторФормата;
		КонецЕсли;
		
		ШаблонНастройкиВида = ШаблоныНастроек.Добавить();
		ШаблонНастройкиВида.ВидДокумента = ВидДокумента;
		ШаблонНастройкиВида.Формат = ИдентификаторФормата;
		ШаблонНастройкиВида.Приоритет = ПриоритетТипаДокументаПриОтображенииВСписке(ОписаниеВида.ТипДокумента);
		ПараметрыГруппы = ПараметрыГруппыТипаДокументаПриОтображенииВСписке(ОписаниеВида.ТипДокумента);
		ШаблонНастройкиВида.Группа = ПараметрыГруппы.Группа;
		ШаблонНастройкиВида.ПриоритетГруппы = ПараметрыГруппы.ПриоритетГруппы;
		ШаблонНастройкиВида.МаршрутПодписания = МаршрутыПодписанияБЭД.МаршрутОднойДоступнойПодписью();
		
		Если ЭтоПрикладнойТипДокумента(ОписаниеВида.ТипДокумента) Тогда
			ТипДокументаДляПредставления = ОписаниеВида.ПрикладнойТипДокумента;
		Иначе
			ТипДокументаДляПредставления = ОписаниеВида.ТипДокумента;
		КонецЕсли;
		
		ПредставлениеОснования = ПредставленияОснованийПоТипам[ТипДокументаДляПредставления];
		Если ПредставлениеОснования = Неопределено Тогда // не задано соответствие
			ШаблонСообщения = НСтр("ru = 'В переопределяемом модуле прикладного решения необходимо указать представление документа ИБ(основания) и хоз. операции для типа документа %1.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщения, ТипДокументаДляПредставления);
			
			ОбщегоНазначенияБЭД.ЗаписатьВЖурналРегистрации(ТекстСообщения, 
				ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ЭлектронноеВзаимодействие,
				УровеньЖурналаРегистрации.Предупреждение);
		КонецЕсли;
		ШаблонНастройкиВида.ДокументУчета = ПредставлениеОснования;
		
		НастройкиРегламента = НастройкиРегламента(ОписаниеВида, ИдентификаторФормата);
		ЗаполнитьЗначенияСвойств(ШаблонНастройкиВида, НастройкиРегламента);
		
	КонецЦикла;
	
	ШаблоныНастроек.Сортировать("ПриоритетГруппы, Приоритет");
	
	Возврат ШаблоныНастроек;
	
КонецФункции

// Формирует таблицу способов отражения входящих документов по имени профиля.
//
// Параметры:
//  Профиль	 - Строка - см. ИнтеграцияЭДО.ПрофилиНастроекОтраженияВходящихДокументов.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица предопределенного профиля:
//   * ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - вид электронного документа.
//   * СпособОбработки - Строка - текстовый идентификатор способа обработки.
//
Функция ШаблонНастроекОтраженияВУчете(Профиль) Экспорт
	
	ТаблицаПрофиля = ИнтеграцияЭДО.ТаблицаПредопределенногоПрофиля(Профиль);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаПрофиля", ТаблицаПрофиля);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаПрофиля.ТипДокумента КАК ТипДокумента,
		|	ТаблицаПрофиля.ПрикладнойТипДокумента КАК ПрикладнойТипДокумента,
		|	ТаблицаПрофиля.СпособОбработки КАК СпособОбработки
		|ПОМЕСТИТЬ ТаблицаПрофиля
		|ИЗ
		|	&ТаблицаПрофиля КАК ТаблицаПрофиля
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыДокументовЭДО.Ссылка КАК ВидДокумента,
		|	ТаблицаПрофиля.СпособОбработки КАК СпособОбработки
		|ИЗ
		|	ТаблицаПрофиля КАК ТаблицаПрофиля
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|		ПО ТаблицаПрофиля.ТипДокумента = ВидыДокументовЭДО.ТипДокумента
		|		И ТаблицаПрофиля.ПрикладнойТипДокумента = ВидыДокументовЭДО.ПрикладнойТипДокумента";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает настройки регламента ЭДО.
// 
// Параметры:
// 	ОписаниеВидаДокумента - См. ОписаниеВидаДокумента
// 	Формат - Строка - Идентификатор формата электронного документа.
// Возвращаемое значение:
// 	Структура - Описание:
// * РедактироватьОтветнуюПодпись - Булево - Возможность редактирования признака ожидания ответной подписи.
// * РедактироватьИзвещение - Булево - Возможность редактирования признака ожидания извещения.
// * РедактироватьПодпись - Булево - Возможность редактирования признака использования подписи.
// * ТребуетсяОтветнаяПодпись - Булево - Значение признака ожидания ответной подписи по умолчанию.
// * ТребуетсяИзвещениеОПолучении - Булево - Значение признака ожидания извещения по умолчанию.
Функция НастройкиРегламента(ОписаниеВидаДокумента, Формат) Экспорт
	
	Настройки = Новый Структура;
	Настройки.Вставить("ТребуетсяИзвещениеОПолучении", Истина);
	Настройки.Вставить("ТребуетсяОтветнаяПодпись",     Истина);
	Настройки.Вставить("РедактироватьПодпись",         Ложь);
	Настройки.Вставить("РедактироватьИзвещение",       Истина);
	Настройки.Вставить("РедактироватьОтветнуюПодпись", Истина);
	
	ТипДокумента = ОписаниеВидаДокумента.ТипДокумента;
	
	Если ЭтоПрикладнойТипДокумента(ТипДокумента) Тогда
		НастройкиПрикладныхФорматов = ИнтеграцияЭДО.НастройкиРегламентаПрикладногоФормата(
			ОписаниеВидаДокумента.ПрикладнойТипДокумента, Формат);
		ЗаполнитьЗначенияСвойств(Настройки, НастройкиПрикладныхФорматов);
		Возврат Настройки;
	КонецЕсли;
	
	Настройки.ТребуетсяИзвещениеОПолучении = ТребуетсяИзвещениеПоУмолчанию(ТипДокумента);
	Настройки.ТребуетсяОтветнаяПодпись = ТребуетсяОтветнаяПодписьПоУмолчанию(ТипДокумента);
	Настройки.РедактироватьОтветнуюПодпись = РедактироватьОтветнуюПодпись(ТипДокумента);
	
	Возврат Настройки;
	
КонецФункции

Функция ДокументооборотНастроен(ОбъектУчета) Экспорт
	
	Результат = Ложь;
	
	Если ТипЗнч(ОбъектУчета) = Тип("Структура") Тогда
		ОписаниеОбъектаУчета = ИнтеграцияЭДО.НовоеОписаниеОбъектаУчета();
		ЗаполнитьЗначенияСвойств(ОписаниеОбъектаУчета, ОбъектУчета);
	Иначе
		ОписаниеОбъектаУчета = ИнтеграцияЭДО.ОписаниеОбъектаУчета(ОбъектУчета);	
	КонецЕсли;
		
	Если ОписаниеОбъектаУчета.Направление = Перечисления.НаправленияЭДО.Внутренний Тогда
		ОтборНастроек = НастройкиЭДО.НовыйОтборНастроекВнутреннегоЭДО();
		ОтборНастроек.Организация = ОписаниеОбъектаУчета.Организация;
		ОписаниеЗапроса = НастройкиЭДО.ЗапросНастроекВнутреннегоЭДО("НастройкиВнутреннегоЭДО", ОтборНастроек);
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА КАК ЕстьНастройки
			|ИЗ
			|	НастройкиВнутреннегоЭДО КАК НастройкиВнутреннегоЭДО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
			|		ПО НастройкиВнутреннегоЭДО.ВидВнутреннегоДокумента = ВидыДокументовЭДО.Ссылка
			|		И НастройкиВнутреннегоЭДО.Формировать
			|		И ВидыДокументовЭДО.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыДокументовЭДО.Внутренний)
			|		И ВидыДокументовЭДО.ИдентификаторОбъектаУчета = &ИдентификаторОбъектаУчета";
		Запрос = ОбщегоНазначенияБЭД.СоединитьЗапросы(Запрос, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОписаниеЗапроса));
		
		Если ТипЗнч(ОбъектУчета) = Тип("Структура") Тогда
			ИдентификаторОбъектаУчета = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
				Метаданные.НайтиПоПолномуИмени(ОбъектУчета.ПолноеИмяМетаданных));
		Иначе 
			ИдентификаторОбъектаУчета = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектУчета.Метаданные());
		КонецЕсли;
		Запрос.УстановитьПараметр("ИдентификаторОбъектаУчета", ИдентификаторОбъектаУчета);
		РезультатЗапроса = Запрос.Выполнить();
		Результат = Не РезультатЗапроса.Пустой();
	Иначе
		КлючНастроекОтправки = КлючНастроекОтправкиОбъектаУчета(ОписаниеОбъектаУчета);
		Настройки = НастройкиЭДО.НастройкиОтправки(КлючНастроекОтправки);
		Если ЗначениеЗаполнено(Настройки) И Настройки.Формировать Тогда
			Если ОписаниеОбъектаУчета.Направление = Перечисления.НаправленияЭДО.Интеркампани Тогда
				Результат = Истина;
			Иначе
				Результат = СинхронизацияЭДО.ДокументооборотНастроен(Настройки.ИдентификаторОтправителя,
					Настройки.ИдентификаторПолучателя);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает таблицу настроек отправки по переданному набору объектов учета.
// 
// Параметры:
// 	ОбъектыУчета - Массив Из ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - набор объектов учета
// Возвращаемое значение:
// 	Соответствие - настройки переданных объектов учета:
//   * Ключ - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - ссылка на объект учета из переданного массива.
//   * Значение - Неоределено - в случае, если настроек не существует, либо передан объект учета, по которому не могут
//                              быть созданы внешние электронные документы.
//              - Структура - настройки с ключами:
//    ** Отправитель
//    ** Получатель
//    ** Договор
//    ** ТипДокумента - ПеречислениеСсылка.ТипыДокументовЭДО - тип электронного документа
//                      //ОБРАТИ ВНИМАНИЕ: в дополнении запроса, который возвращает компонент настроек, этого поля нет.
//    ** ВидДокумента
//    ** Формат
//    ** МаршрутПодписания
//    ** СпособОбменаЭД
//    ** ИдентификаторОтправителя
//    ** ИдентификаторПолучателя
//    ** ТребуетсяОтветнаяПодпись
//    ** ТребуетсяИзвещениеОПолучении
//    ** ВыгружатьДополнительныеСведения
//    ** ОбменБезПодписи
//    ** Формировать
//    ** ВерсияФорматаУстановленаВручную
//    ** ЗаполнениеКодаТовара
//
Функция НастройкиОтправкиОбъектовУчета(ОбъектыУчета) Экспорт
	
	Результат = Новый Соответствие();
	Для Каждого ОбъектУчета Из ОбъектыУчета Цикл
		Результат.Вставить(ОбъектУчета, Неопределено);
	КонецЦикла;
	
	ОписанияОбъектовУчета = ИнтеграцияЭДО.ОписанияОбъектовУчета(ОбъектыУчета);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОписанияОбъектовУчета", ОписанияОбъектовУчета);
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить( 
		"ВЫБРАТЬ
		|	ОписанияОбъектовУчета.ОбъектУчета КАК ОбъектУчета,
		|	ОписанияОбъектовУчета.Направление КАК Направление,
		|	ОписанияОбъектовУчета.ТипДокумента КАК ТипДокумента,
		|	ОписанияОбъектовУчета.ПрикладнойТипДокумента КАК ПрикладнойТипДокумента,
		|	ОписанияОбъектовУчета.Организация КАК Организация,
		|	ОписанияОбъектовУчета.Контрагент КАК Контрагент,
		|	ОписанияОбъектовУчета.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	"""" КАК ВидВнутреннегоДокумета,
		|	"""" КАК ИдентификаторОбъектаУчета
		|ПОМЕСТИТЬ ОписанияОбъектовУчета
		|ИЗ
		|	&ОписанияОбъектовУчета КАК ОписанияОбъектовУчета");
	 
	ПоляТаблицы =
		"	ОписанияОбъектовУчета.ОбъектУчета КАК ОбъектУчета,
		|	ОписанияОбъектовУчета.Направление КАК Направление,
		|	ОписанияОбъектовУчета.ТипДокумента КАК ТипДокумента,
		|	ОписанияОбъектовУчета.Организация КАК Отправитель,
		|	ОписанияОбъектовУчета.Контрагент КАК Получатель,
		|	ОписанияОбъектовУчета.ДоговорКонтрагента КАК Договор,
		|	ВидыДокументовЭДО.Ссылка КАК ВидДокумента";
	ИмяТаблицы = 
		"	ОписанияОбъектовУчета КАК ОписанияОбъектовУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|		ПО ОписанияОбъектовУчета.ТипДокумента = ВидыДокументовЭДО.ТипДокумента
		|		И ОписанияОбъектовУчета.ПрикладнойТипДокумента = ВидыДокументовЭДО.ПрикладнойТипДокумента
		|		И ОписанияОбъектовУчета.Направление <> &НаправлениеВнутренний";
		
	ПоляКлючаНастройки = НастройкиЭДО.НовоеОписаниеПолейКлючаНастройкиОтправки();
	ПоляКлючаНастройки.Отправитель = "ОписанияОбъектовУчета.Организация";
	ПоляКлючаНастройки.Получатель = "ОписанияОбъектовУчета.Контрагент";
	ПоляКлючаНастройки.Договор = "ОписанияОбъектовУчета.ДоговорКонтрагента";
	ПоляКлючаНастройки.ВидДокумента = "ВидыДокументовЭДО.Ссылка";
	
	ТекстЗапросаНастроекОтправкиОбъектовУчета =  НастройкиЭДО.ТекстЗапросаДополнениеНастройкамиОтправки(ИмяТаблицы, ПоляТаблицы, ПоляКлючаНастройки);
	ТекстЗапросаНастроекОтправкиОбъектовУчета = ТекстЗапросаНастроекОтправкиОбъектовУчета + "
		|ГДЕ
		|	ОписанияОбъектовУчета.Направление В (&НаправленияНастроекОтправки)
		|	И ЭлектронныеДокументыОбъектовУчета.ЭлектронныйДокумент ЕСТЬ NULL";
	
	ТекстыЗапросов.Добавить(ТекстЗапросаНастроекОтправкиОбъектовУчета);
		
	НаправленияНастроекОтправки = Новый Массив();
	НаправленияНастроекОтправки.Добавить(Перечисления.НаправленияЭДО.Исходящий);
	Если НастройкиЭДО.ОбменЭлектроннымиДокументамиМеждуОрганизациями() Тогда
		НаправленияНастроекОтправки.Добавить(Перечисления.НаправленияЭДО.Интеркампани);
	КонецЕсли;
	Запрос.УстановитьПараметр("НаправленияНастроекОтправки", НаправленияНастроекОтправки);
	
	Запрос.УстановитьПараметр("НаправлениеВнутренний", Перечисления.НаправленияЭДО.Внутренний);
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	ТаблицаНастроек = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаНастроек Из ТаблицаНастроек Цикл
		Настройки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаНастроек);
		Настройки.Удалить("ОбъектУчета");
		Настройки.Удалить("Направление");
		
		Результат[СтрокаНастроек.ОбъектУчета] = Настройки;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СтатусДокумента

Функция СтатусДокумента(ЭлектронныйДокумент) Экспорт
	
	Результат = "";
	
	Статусы = ДоступныеСтатусыДокумента();
	
	СостояниеДокумента = СостояниеДокумента(ЭлектронныйДокумент);
	
	Если СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОбменЗавершен Тогда
		
		Результат = Статусы.Утвержден;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.Аннулирован
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ЗакрытПринудительно
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОбменЗавершенСИсправлением
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОжидаетсяИсправление
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ЗакрытСОтклонением
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяУточнение
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ЗакрытСОтклонениемПриглашения Тогда
		
		Результат = Статусы.Отклонен;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание Тогда
		
		Результат = ?(ЭтоВходящийЭДО(ЭлектронныйДокумент), Статусы.УтверждениеВОбработке, Статусы.ВОбработке);
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправка
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОжидаетсяОтветНаПриглашение
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеОператора
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОжидаетсяПодтверждение Тогда
		
		Результат = Статусы.ВОбработке;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяУтверждение Тогда
		
		Результат = Статусы.Получен;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.НеПолучен
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.НеСформирован Тогда
		
		Результат = Статусы.НеНачат;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеАннулирования
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеАннулирования
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправкаАннулирования
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправкаОтклонения
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеОтклонения
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодтверждениеАннулирования Тогда
		
		Результат = Статусы.ОтклонениеВОбработке;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ЗакрытСОшибкойПередачи
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяИсправлениеОшибкиПередачи
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяПовторнаяОтправка Тогда
		
		Результат = Статусы.Ошибка;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Обработка состояний для извещения о получении информации отправителя.
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаСостоянияСообщений();
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	СостоянияДокументов = Запрос.Выполнить().Выгрузить();
	
	ЕстьПодтверждениеИнформацииОтправителя = Ложь;
	ЕстьПредложениеОбАннулировании = Ложь;
	ЕстьУведовлениеОбУточнении = Ложь;
	
	Для Каждого СтрокаТаблицы Из СостоянияДокументов Цикл
		
		Если СтрокаТаблицы.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя
			И СтрокаТаблицы.Статус = Перечисления.СтатусыСообщенийЭДО.Подтвержден
			ИЛИ СтрокаТаблицы.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя
				И (СтрокаТаблицы.Статус = Перечисления.СтатусыСообщенийЭДО.Отправлен
					ИЛИ СтрокаТаблицы.Статус = Перечисления.СтатусыСообщенийЭДО.Получен) Тогда
			ЕстьПодтверждениеИнформацииОтправителя = Истина;
		ИначеЕсли СтрокаТаблицы.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПОА Тогда
			ЕстьПредложениеОбАннулировании = Истина;
		ИначеЕсли СтрокаТаблицы.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.УОУ Тогда
			ЕстьУведовлениеОбУточнении = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьПредложениеОбАннулировании
		ИЛИ ЕстьУведовлениеОбУточнении Тогда
		Результат = Статусы.ОтклонениеВОбработке;
	ИначеЕсли ЕстьПодтверждениеИнформацииОтправителя
		ИЛИ Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйДокумент, "ТребуетсяПодтверждение") Тогда
		Результат = Статусы.Утвержден;
	Иначе
		Результат = ?(ЭтоВходящийЭДО(ЭлектронныйДокумент), Статусы.УтверждениеВОбработке, Статусы.ВОбработке);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СостояниеДокумента

// Возвращает начальное состояние исходящего электронного документа.
// 
// Возвращаемое значение:
// 	ПеречислениеСсылка.СостоянияДокументовЭДО - Состояние электронного документа.
Функция НачальноеСостояниеДокумента() Экспорт
	
	Возврат РегламентыЭДО.НачальноеСостояниеДокумента();
	
КонецФункции

// Возвращает текущее состояния документа.
// 
// Параметры:
// 	ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - Ссылка на электронный документ.
// Возвращаемое значение:
// 	см. ФорматыЭлектронныхДокументов.СостояниеДокумента
Функция СостояниеДокумента(ЭлектронныйДокумент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СостоянияДокументовЭДО.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|ГДЕ
		|	СостоянияДокументовЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент";
	
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат РегламентыЭДО.НачальноеСостояниеДокумента();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Состояние;
	
КонецФункции

Функция СостояниеДокументаПодробное(ЭлектронныйДокумент) Экспорт
	
	Состояние = Новый Структура;
	Состояние.Вставить("Значение", Перечисления.СостоянияДокументовЭДО.ПустаяСсылка());
	Состояние.Вставить("Дополнение", "");
	Состояние.Вставить("ДатаИзменения", '00010101');
	Состояние.Вставить("Комментарий", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СостоянияДокументовЭДО.Состояние КАК Значение,
		|	СостоянияДокументовЭДО.СостояниеДополнение КАК Дополнение,
		|	СостоянияДокументовЭДО.ДатаИзменения КАК ДатаИзменения,
		|	СостоянияДокументовЭДО.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|ГДЕ
		|	СостоянияДокументовЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент";
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Состояние, Выборка);
	КонецЕсли;
	
	Возврат Состояние;
	
КонецФункции

Функция ЗапросСостоянийДокументов(ИмяВременнойТаблицы, ИмяПараметраЭлектронныйДокумент) Экспорт

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СостоянияДокументовЭДО.ЭлектронныйДокумент КАК Ссылка,
	|	СостоянияДокументовЭДО.Состояние КАК Состояние,
	|	СостоянияДокументовЭДО.СостояниеДополнение КАК СостояниеДополнение
	|ПОМЕСТИТЬ ИмяВременнойТаблицы
	|ИЗ
	|	РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
	|ГДЕ
	|	СостоянияДокументовЭДО.ЭлектронныйДокумент В(&ЭлектронныйДокумент)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭлектронныйДокумент", ИмяПараметраЭлектронныйДокумент);
	ОписаниеЗапроса = ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса();
	ОписаниеЗапроса.Текст = ТекстЗапроса;
	
	Возврат ОписаниеЗапроса;
	
КонецФункции

#КонецОбласти

#Область РаботаСПакетами

Функция ИдентификаторПакетаДокумента(ЭлектронныйДокумент) Экспорт
	
	Запрос = Новый Запрос(ТекстЗапросаИдентификатораПакетаДокумента());
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ИдентификаторПакета;
	
КонецФункции

Функция ДокументыПакета(ИдентификаторПакета) Экспорт
	
	Возврат РезультатЗапросаДокументовПакета(ИдентификаторПакета).Выгрузить().ВыгрузитьКолонку("ЭлектронныйДокумент");
	
КонецФункции

Функция СоздатьПакетДокументов(ЭлектронныеДокументы, КонтекстДиагностики) Экспорт
	
	ИдентификаторПакета = Неопределено;
	
	Если ЭлектронныеДокументы.Количество() < 2 Тогда
		Возврат ИдентификаторПакета;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		ЭтоВходящийЭДО = Неопределено;
		
		Блокировка = Новый БлокировкаДанных;
		Для Каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
			Если ЭтоВходящийЭДО = Неопределено Тогда
				ЭтоВходящийЭДО = ЭтоВходящийЭДО(ЭлектронныйДокумент);
			ИначеЕсли ЭтоВходящийЭДО <> ЭтоВходящийЭДО(ЭлектронныйДокумент) Тогда
				ОтменитьТранзакцию();
				Возврат ИдентификаторПакета;
			КонецЕсли;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СоставПакетовДокументовЭДО");
			ЭлементБлокировки.УстановитьЗначение("ЭлектронныйДокумент", ЭлектронныйДокумент);
		КонецЦикла;
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СоставПакетовДокументовЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент
			|ИЗ
			|	РегистрСведений.СоставПакетовДокументовЭДО КАК СоставПакетовДокументовЭДО
			|ГДЕ
			|	СоставПакетовДокументовЭДО.ЭлектронныйДокумент В (&ЭлектронныеДокументы)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СостоянияДокументовЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
			|	СостоянияДокументовЭДО.Состояние КАК Состояние
			|ИЗ
			|	РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
			|ГДЕ
			|	СостоянияДокументовЭДО.ЭлектронныйДокумент В (&ЭлектронныеДокументы)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ТаблицаДокументаЭДО.Дата КАК Дата,
			|	ТаблицаДокументаЭДО.Организация КАК Организация,
			|	ТаблицаДокументаЭДО.Контрагент КАК Контрагент,
			|	ТаблицаДокументаЭДО.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	СостоянияДокументовЭДО.Состояние КАК Состояние
			|ИЗ
			|	ИмяТаблицыДокументаЭДО КАК ТаблицаДокументаЭДО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
			|		ПО ТаблицаДокументаЭДО.Ссылка = СостоянияДокументовЭДО.ЭлектронныйДокумент
			|ГДЕ
			|	ТаблицаДокументаЭДО.Ссылка В (&ЭлектронныеДокументы)
			|УПОРЯДОЧИТЬ ПО
			|	Дата";
		ИмяТаблицыДокументаЭДО = ИмяТаблицыДокументаЭДО(ЭтоВходящийЭДО);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяТаблицыДокументаЭДО", ИмяТаблицыДокументаЭДО);
		Запрос.УстановитьПараметр("ЭлектронныеДокументы", ЭлектронныеДокументы);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		Если Не РезультатыЗапроса[0].Пустой() Тогда
			ОтменитьТранзакцию();
			ДокументыВСоставеДругогоПакета = РезультатыЗапроса[0].Выгрузить().ВыгрузитьКолонку("ЭлектронныйДокумент");
			ДобавитьОшибкуДокументыВСоставеДругогоПакета(ДокументыВСоставеДругогоПакета, КонтекстДиагностики);
			Возврат ИдентификаторПакета;
		КонецЕсли;
		
		СостоянияДокументов = Новый Соответствие;
		ВыборкаСостояний = РезультатыЗапроса[1].Выбрать();
		Пока ВыборкаСостояний.Следующий() Цикл
			СостоянияДокументов.Вставить(ВыборкаСостояний.ЭлектронныйДокумент, ВыборкаСостояний.Состояние);
		КонецЦикла;
		
		Если ИзменениеСоставаПакетаНедоступно(СостоянияДокументов, КонтекстДиагностики) Тогда
			ОтменитьТранзакцию();
			Возврат ИдентификаторПакета;
		КонецЕсли;
		
		ИдентификаторПакета = Новый УникальныйИдентификатор;
		
		Выборка = РезультатыЗапроса[2].Выбрать();
		Если Выборка.Следующий() Тогда
			НоваяЗапись = РегистрыСведений.ПакетыДокументовЭДО.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.ИдентификаторПакета = ИдентификаторПакета;
			НоваяЗапись.Записать();
		Иначе
			ОтменитьТранзакцию();
			ИдентификаторПакета = Неопределено;
			Возврат ИдентификаторПакета;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.СоставПакетовДокументовЭДО.СоздатьНаборЗаписей();
		Для Каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ЭлектронныйДокумент = ЭлектронныйДокумент;
			НоваяЗапись.ИдентификаторПакета = ИдентификаторПакета;
		КонецЦикла;
		НаборЗаписей.Записать(Ложь);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ИдентификаторПакета = Неопределено;
		
		ВидОперации = НСтр("ru = 'Создание пакета документов'");
		ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка();
		
		ЗаголовокОшибки = НСтр("ru = 'Не удалось создать пакет документов'");
		
		КраткоеПредставление = ЗаголовокОшибки + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ПредставленияДокументов = Новый Массив;
		Для Каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
			ПредставленияДокументов.Добавить(ПредставлениеДокумента(ЭлектронныйДокумент));
		КонецЦикла;
	
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(ЗаголовокОшибки);
		МассивСтрок.Добавить(СтрШаблон(ПредставленияДокументов, ", "));
		МассивСтрок.Добавить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ПодробноеПредставление = СтрСоединить(МассивСтрок, Символы.ПС);
		
		Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации, ВидОшибки, ПодробноеПредставление, КраткоеПредставление);
		ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
		ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	КонецПопытки;
	
	Возврат ИдентификаторПакета;
	
КонецФункции

Функция УдалитьДокументИзПакета(ИдентификаторПакета, ЭлектронныйДокумент, КонтекстДиагностики = Неопределено) Экспорт
	
	Результат = Ложь;
	ВидОперации = НСтр("ru = 'Удаление электронного документа из пакета'");
	
	Если ВыполнениеДействийПоЭДОЗапрещено(КонтекстДиагностики) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ЭтоВходящийЭДО(ЭлектронныйДокумент) Тогда
		ДобавитьОшибкуИзмененияСоставаПакетаВходящегоЭДО(КонтекстДиагностики, ВидОперации, ЭлектронныйДокумент);
		Возврат Результат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		ЗаблокироватьПакетДокументовДляИзменения(ИдентификаторПакета);
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостоянияДокументовЭДО");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапросаДокументовПакета(ИдентификаторПакета);
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ЭлектронныйДокумент", "ЭлектронныйДокумент");
		Блокировка.Заблокировать();
		
		ПараметрыИзменения = ПараметрыИзмененияПакетаДокументов(ИдентификаторПакета, ЭлектронныйДокумент);
		СостоянияДокументов = ПараметрыИзменения.СостоянияДокументов;
		Если Не ЗначениеЗаполнено(СостоянияДокументов)
			ИЛИ СостоянияДокументов[ЭлектронныйДокумент] = Неопределено Тогда
			Результат = Истина;
			ЗафиксироватьТранзакцию();
			Возврат Результат;
		ИначеЕсли ИзменениеСоставаПакетаНедоступно(СостоянияДокументов, КонтекстДиагностики) Тогда
			ЗафиксироватьТранзакцию();
			Возврат Результат;
		КонецЕсли;
		
		Если СостоянияДокументов.Количество() > 2 Тогда
			НаборЗаписей = РегистрыСведений.СоставПакетовДокументовЭДО.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЭлектронныйДокумент.Установить(ЭлектронныйДокумент);
			НаборЗаписей.Записать();
			
			Если ЗначениеЗаполнено(ПараметрыИзменения.ОписаниеПакета) Тогда
				ОбновитьОписаниеПакета(ПараметрыИзменения.ОписаниеПакета);
			КонецЕсли;
		Иначе
			НаборЗаписей = РегистрыСведений.ПакетыДокументовЭДО.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ИдентификаторПакета.Установить(ИдентификаторПакета);
			НаборЗаписей.Записать();
			
			Для Каждого СостояниеДокумента Из СостоянияДокументов Цикл
				НаборЗаписей = РегистрыСведений.СоставПакетовДокументовЭДО.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ЭлектронныйДокумент.Установить(СостояниеДокумента.Ключ);
				НаборЗаписей.Записать();
			КонецЦикла; 
		КонецЕсли;
		
		Результат = Истина;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуИзмененияСоставаПакетаИсходящегоЭДО(КонтекстДиагностики, ВидОперации,
			ИдентификаторПакета, ЭлектронныйДокумент, ТекстОшибки);
	КонецПопытки;
	
КонецФункции

Функция ДобавитьДокументВПакет(ИдентификаторПакета, ЭлектронныйДокумент, КонтекстДиагностики = Неопределено) Экспорт
	
	Результат = Ложь;
	ВидОперации = НСтр("ru = 'Добавление электронного документа в пакет'");
	
	Если ВыполнениеДействийПоЭДОЗапрещено(КонтекстДиагностики) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ЭтоВходящийЭДО(ЭлектронныйДокумент) Тогда
		ДобавитьОшибкуИзмененияСоставаПакетаВходящегоЭДО(КонтекстДиагностики, ВидОперации, ЭлектронныйДокумент);
		Возврат Результат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		ЗаблокироватьПакетДокументовДляИзменения(ИдентификаторПакета);
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостоянияДокументовЭДО");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапросаДокументовПакета(ИдентификаторПакета);
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ЭлектронныйДокумент", "ЭлектронныйДокумент");
		Блокировка.Заблокировать();
		
		ПараметрыИзменения = ПараметрыИзмененияПакетаДокументов(ИдентификаторПакета, ЭлектронныйДокумент);
		СостоянияДокументов = ПараметрыИзменения.СостоянияДокументов;
		Если ЗначениеЗаполнено(СостоянияДокументов)
			И ИзменениеСоставаПакетаНедоступно(СостоянияДокументов, КонтекстДиагностики) Тогда
			ЗафиксироватьТранзакцию();
			Возврат Результат;
		ИначеЕсли ЗначениеЗаполнено(ПараметрыИзменения.ОписаниеПакета) Тогда 
			ОбновитьОписаниеПакета(ПараметрыИзменения.ОписаниеПакета);
		КонецЕсли;
		
		НоваяЗапись = РегистрыСведений.СоставПакетовДокументовЭДО.СоздатьМенеджерЗаписи();
		НоваяЗапись.ЭлектронныйДокумент = ЭлектронныйДокумент;
		НоваяЗапись.ИдентификаторПакета = ИдентификаторПакета;
		НоваяЗапись.Записать();
		
		Результат = Истина;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ВидОперации = НСтр("ru = 'Добавление электронного документа из пакета'");
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуИзмененияСоставаПакетаИсходящегоЭДО(КонтекстДиагностики, ВидОперации,
			ИдентификаторПакета, ЭлектронныйДокумент, ТекстОшибки);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция СостоянияДокументовПакета(ИдентификаторПакета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторПакета", ИдентификаторПакета);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СоставПакетовДокументовЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
		|	СостоянияДокументовЭДО.Состояние КАК Значение,
		|	СостоянияДокументовЭДО.СостояниеДополнение КАК Дополнение,
		|	СостоянияДокументовЭДО.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.СоставПакетовДокументовЭДО КАК СоставПакетовДокументовЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|		ПО СоставПакетовДокументовЭДО.ЭлектронныйДокумент = СостоянияДокументовЭДО.ЭлектронныйДокумент
		|		И СоставПакетовДокументовЭДО.ИдентификаторПакета = &ИдентификаторПакета";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СостояниеПакета(СостоянияДокументов) Экспорт
	МассивСостояний = СостоянияДокументов.ВыгрузитьКолонку("Значение");
	Возврат РегламентыЭДО.СостояниеПакета(МассивСостояний);
КонецФункции

#КонецОбласти

#Область СхемаРегламента

// См. РегламентыЭДО.НоваяСхемаРегламента
Функция НоваяСхемаРегламента(НастройкиСхемыРегламента, ДанныеЭлементовСхемы = Неопределено) Экспорт
	
	Возврат РегламентыЭДО.НоваяСхемаРегламента(НастройкиСхемыРегламента, ДанныеЭлементовСхемы);
	
КонецФункции

// См. РегламентыЭДО.ЭлементыСхемыРегламентаБезДанных
Функция ЭлементыСхемыРегламентаБезДанных(СхемаРегламента) Экспорт
	
	Возврат РегламентыЭДО.ЭлементыСхемыРегламентаБезДанных(СхемаРегламента);
	
КонецФункции

Функция ДанныеЭлементовСхемыРегламента(ЭлектронныйДокумент) Экспорт
	Запрос = Новый Запрос(ТекстЗапросаДанныхЭлементовСхемыРегламента(ЭтоВходящийЭДО(ЭлектронныйДокумент)));
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти

#Область ПредставлениеДокумента

// Возвращает пустые свойства электронного документа для формирования представления.
// 
// Возвращаемое значение:
// 	Структура - Описание:
// 	* ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - 
// 	* НомерДокумента - Строка - 
// 	* ДатаДокумента - Дата - 
Функция НовыеСвойстваПредставленияДокумента() Экспорт
	Свойства = Новый Структура;
	Свойства.Вставить("ВидДокумента", Справочники.ВидыДокументовЭДО.ПустаяСсылка());
	Свойства.Вставить("НомерДокумента", "");
	Свойства.Вставить("ДатаДокумента", Дата(1,1,1));
	Возврат Свойства;
КонецФункции

// Получение представления по свойствам электронного документа.
//
// Параметры:
// 	СвойстваДокумента - Структура - параметры из которых формируется представление документа:
// 	* ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - вид электронного документа.
// 	* НомерДокумента - Строка - номер электронного документа.
// 	* ДатаДокумента - Дата - дата электронного документа.
//
Функция ПредставлениеДокументаПоСвойствам(СвойстваДокумента, ЭтоНовый = Ложь) Экспорт
	Возврат ЭлектронныеДокументыЭДОКлиентСервер.ПредставлениеДокументаПоСвойствам(СвойстваДокумента, ЭтоНовый);
КонецФункции

Функция ЗапросПараметровПредставленияДокументов(ИмяВременнойТаблицы, ИмяПараметраСообщенияЭДО) Экспорт
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Ссылка,
		|	СообщениеЭДО.ВидСообщения КАК ВидДокумента,
		|	СообщениеЭДО.ЭлектронныйДокумент.НомерДокумента КАК НомерДокумента,
		|	СообщениеЭДО.ЭлектронныйДокумент.ДатаДокумента КАК ДатаДокумента
		|ПОМЕСТИТЬ ИмяВременнойТаблицы
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.Ссылка В(&СообщенияЭДО)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СообщенияЭДО", ИмяПараметраСообщенияЭДО);
	ОписаниеЗапроса = ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса();
	ОписаниеЗапроса.Текст = ТекстЗапроса;
	
	Возврат ОписаниеЗапроса;
	
КонецФункции

#КонецОбласти

#Область ОписаниеСообщения

Функция НовоеОписаниеСообщения() Экспорт
	ОписаниеСообщения = Новый Структура;
	ОписаниеСообщения.Вставить("ВидСообщения", Справочники.ВидыДокументовЭДО.ПустаяСсылка());
	ОписаниеСообщения.Вставить("ТипЭлементаРегламента", Перечисления.ТипыЭлементовРегламентаЭДО.ПустаяСсылка());
	ОписаниеСообщения.Вставить("Направление", Перечисления.НаправленияЭДО.ПустаяСсылка());
	ОписаниеСообщения.Вставить("ДополнительнаяИнформация", "");
	ОписаниеСообщения.Вставить("Данные", ФорматыЭДО.НовыйРезультатФормированияДокументаПоУчету());
	Возврат ОписаниеСообщения;
КонецФункции

Функция ОписаниеСообщенияОтправителя(ОбъектУчета, ДанныеОбъектаУчета, НастройкиОтправки, ЗначенияДополнительныхПолей = Неопределено) Экспорт
	
	ЭтоИнтеркампани = СинхронизацияЭДО.ЭтоИнтеркампани(НастройкиОтправки.СпособОбмена);
	
	ДанныеДляФормирования = ФорматыЭДО.НовыеДанныеДляФормированияОсновногоТитула();
	
	Если ТипЗнч(ДанныеОбъектаУчета) = Тип("Структура") Тогда
		ДанныеДляФормирования.УникальныйИдентификатор = Строка(Новый УникальныйИдентификатор);
		ДанныеДляФормирования.ДанныеДокумента = ДанныеОбъектаУчета.ДеревоЭД;
		ДанныеДляФормирования.Вставить("ДанныеДО", ДанныеОбъектаУчета.ДанныеДО);
		ДанныеДляФормирования.ЗначенияДополнительныхПолей = ЗначенияДополнительныхПолей;
	Иначе
		ДанныеДляФормирования.УникальныйИдентификатор = Строка(Новый УникальныйИдентификатор);
		ДанныеДляФормирования.ДанныеДокумента = ДанныеОбъектаУчета;
		ДанныеДляФормирования.ЗначенияДополнительныхПолей = ЗначенияДополнительныхПолей;
	КонецЕсли;
	
	Если ДанныеДляФормирования.Свойство("Участники") Тогда
		
		ДанныеДляФормирования.Участники.ИдентификаторОтправителя = НастройкиОтправки.ИдентификаторОтправителя;
		ДанныеДляФормирования.Участники.ИдентификаторПолучателя = НастройкиОтправки.ИдентификаторПолучателя;
		
		Если Не ЭтоИнтеркампани И ДанныеДляФормирования.Участники.Свойство("Оператор") Тогда
			
			СведенияОбОператоре = СинхронизацияЭДО.СведенияОбОператоре(НастройкиОтправки.ИдентификаторОтправителя);
			ДанныеДляФормирования.Участники.Оператор.Наименование = СведенияОбОператоре.Наименование;
			ДанныеДляФормирования.Участники.Оператор.ИНН = СведенияОбОператоре.ИНН;
			ДанныеДляФормирования.Участники.Оператор.Идентификатор = СведенияОбОператоре.Идентификатор;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОписаниеВидаДокумента = ОписаниеВидаДокумента(НастройкиОтправки.ВидДокумента);
	
	НастройкиФормирования = ФорматыЭДО.НовыеНастройкиФормированияДокументаПоОбъектуУчета();
	НастройкиФормирования.ТипДокумента = ОписаниеВидаДокумента.ТипДокумента;
	НастройкиФормирования.Формат = НастройкиОтправки.Формат;
	
	ДанныеСообщения = ФорматыЭДО.СформироватьДанныеОсновногоТитулаПоОбъектуУчета(ОбъектУчета,
		НастройкиФормирования, ДанныеДляФормирования);
	
	ОписаниеСообщения = НовоеОписаниеСообщения();
	ОписаниеСообщения.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя;
	ОписаниеСообщения.ВидСообщения = НастройкиОтправки.ВидДокумента;
	ОписаниеСообщения.Направление = ?(ЭтоИнтеркампани, Перечисления.НаправленияЭДО.Интеркампани,
		Перечисления.НаправленияЭДО.Исходящий);
	ОписаниеСообщения.Данные = ДанныеСообщения;
	
	Возврат ОписаниеСообщения;
	
КонецФункции

Функция ОписаниеСообщенияОтправителяПрикладногоДокумента(ОбъектУчета, НастройкиОтправки, ПрикладнойТипДокумента) Экспорт

	Данные = ФорматыЭДО.НовыеДанныеДляФормированияПрикладногоДокумента();	
	
	Данные.УникальныйИдентификатор = Строка(Новый УникальныйИдентификатор);
	Данные.ИдентификаторОтправителя = НастройкиОтправки.ИдентификаторОтправителя;
	Данные.ИдентификаторПолучателя = НастройкиОтправки.ИдентификаторПолучателя;
	Данные.ПрикладнойТипДокумента = ПрикладнойТипДокумента;
	
	ДанныеСообщения = ФорматыЭДО.СформироватьДанныеПрикладногоДокумента(
		ОбъектУчета, НастройкиОтправки, Данные);
	
	ОписаниеСообщения = НовоеОписаниеСообщения();
	ОписаниеСообщения.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя;
	ОписаниеСообщения.ВидСообщения = НастройкиОтправки.ВидДокумента;
	ОписаниеСообщения.Направление = Перечисления.НаправленияЭДО.Исходящий;
	ОписаниеСообщения.Данные = ДанныеСообщения;
	
	Возврат ОписаниеСообщения;
	
КонецФункции

Функция ОписаниеСообщенияВнутреннегоЭДО(ОбъектУчета, НастройкиВнутреннегоЭДО) Экспорт
	
	ОписаниеСообщения = НовоеОписаниеСообщения();
	ОписаниеСообщения.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя;
	ОписаниеСообщения.Направление = Перечисления.НаправленияЭДО.Внутренний;
	ОписаниеСообщения.ВидСообщения = НастройкиВнутреннегоЭДО.ВидДокумента;
	ОписаниеСообщения.Данные = ВнутренниеДокументыЭДО.СформироватьДанныеВнутреннегоДокумента(
		ОбъектУчета, НастройкиВнутреннегоЭДО);
	
	Возврат ОписаниеСообщения;
	
КонецФункции

Функция НовоеСодержаниеСообщения() Экспорт
	Возврат ФорматыЭДО.НовоеОписаниеФайлаДокумента();
КонецФункции

#КонецОбласти

#Область ДанныеСообщения

Функция ПредставлениеДанныхСообщения(ВидДокумента, ДанныеФайла, ДанныеФайлаОтвета = Неопределено, ПараметрыВизуализации = Неопределено, КонтекстДиагностики = Неопределено) Экспорт
	
	ОписаниеВида = ОписаниеВидаДокумента(ВидДокумента);
	
	Если ОписаниеВида.ТипДокумента = Перечисления.ТипыДокументовЭДО.Прикладной Тогда
		ПараметрыПредставления = ИнтеграцияЭДО.НовыеПараметрыПредставленияПроизвольногоДокумента();
		ПараметрыПредставления.ВыводитьДопДанные = ПараметрыВизуализации.ВыводитьДопДанные;
		ПараметрыПредставления.ВыводитьБанковскиеРеквизиты = ПараметрыВизуализации.ВыводитьБанковскиеРеквизиты;
		ПараметрыПредставления.ПрикладнойТипДокумента = ОписаниеВида.ПрикладнойТипДокумента;
		
		Возврат ИнтеграцияЭДО.ПредставлениеФайлаПрикладногоЭлектронногоДокумента(ДанныеФайла, ПараметрыПредставления);
		
	Иначе
		Возврат ФорматыЭДО.ПредставлениеДанныхДокумента(ДанныеФайла, ДанныеФайлаОтвета, ПараметрыВизуализации,
			КонтекстДиагностики);
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеДанныхСообщенияПоСсылке(Сообщение, СообщениеОтвета = Неопределено, ПараметрыВизуализации = Неопределено, КонтекстДиагностики = Неопределено) Экспорт
	
	СвойстваСообщения = СвойстваСообщения(Сообщение, "ОсновнойФайл, ВидСообщения");
	ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(СвойстваСообщения.ОсновнойФайл);
	
	ОписаниеВида = ОписаниеВидаДокумента(СвойстваСообщения.ВидСообщения);
	
	Если ОписаниеВида.ТипДокумента = Перечисления.ТипыДокументовЭДО.Прикладной Тогда
		ПараметрыПредставления = ИнтеграцияЭДО.НовыеПараметрыПредставленияПроизвольногоДокумента();
		Если ЗначениеЗаполнено(ПараметрыВизуализации) Тогда
			ПараметрыПредставления.ВыводитьДопДанные = ПараметрыВизуализации.ВыводитьДопДанные;
			ПараметрыПредставления.ВыводитьБанковскиеРеквизиты = ПараметрыВизуализации.ВыводитьБанковскиеРеквизиты;
		КонецЕсли;
		ПараметрыПредставления.ПрикладнойТипДокумента = ОписаниеВида.ПрикладнойТипДокумента;
		ПараметрыПредставления.ЭлектронныеПодписи = ЭлектроннаяПодпись.УстановленныеПодписи(СвойстваСообщения.ОсновнойФайл);
		
		Возврат ИнтеграцияЭДО.ПредставлениеФайлаПрикладногоЭлектронногоДокумента(ДвоичныеДанныеФайла, ПараметрыПредставления);
		
	Иначе
		ДвоичныеДанныеФайлаОтвета = Неопределено;

		Если ЗначениеЗаполнено(СообщениеОтвета) Тогда
			СвойстваСообщения = СвойстваСообщения(СообщениеОтвета, "ОсновнойФайл");
			ДвоичныеДанныеФайлаОтвета = РаботаСФайлами.ДвоичныеДанныеФайла(СвойстваСообщения.ОсновнойФайл);
		КонецЕсли;

		Возврат ФорматыЭДО.ПредставлениеДанныхДокумента(ДвоичныеДанныеФайла, ДвоичныеДанныеФайлаОтвета,
			ПараметрыВизуализации, КонтекстДиагностики);
		
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеДанныхВнутреннегоСообщения(ДвоичныеДанныеАрхива) Экспорт
	
	Возврат ВнутренниеДокументыЭДО.ПредставлениеДанныхВнутреннегоДокумента(ДвоичныеДанныеАрхива);
	
КонецФункции

Функция ПредставлениеКарточкиСообщения(Сообщение, ОтветноеСообщение = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(СообщениеЭДО.ВидСообщения) КАК ВидДокументаПредставление,
		|	СообщениеЭДО.ЭлектронныйДокумент.Номер КАК НомерДокумента,
		|	СообщениеЭДО.ЭлектронныйДокумент.Дата КАК ДатаДокумента,
		|	СообщениеЭДО.ДополнительнаяИнформация КАК СопроводительнаяЗаписка,
		|	СообщениеЭДО.ЭлектронныйДокумент.Контрагент КАК Контрагент,
		|	СообщениеЭДО.ЭлектронныйДокумент.Организация КАК Организация,
		|	СообщениеЭДО.Направление КАК Направление,
		|	СообщениеЭДО.Ссылка КАК Сообщение,
		|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента,
		|	СообщениеЭДО.ЭлектронныйДокумент.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
		|	СообщениеЭДО.ОсновнойФайл КАК ФайлСсылка,
		|	СообщениеЭДО.ОсновнойФайл.ПолноеИмяФайла КАК ПолноеИмяФайла,
		|	СообщениеЭДО.ОсновнойФайл.Расширение КАК РасширениеФайла
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.Ссылка = &Сообщение";
	
	Запрос.Параметры.Вставить("Сообщение", Сообщение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Макет = УправлениеПечатью.МакетПечатнойФормы(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Документ.СообщениеЭДО.ПФ_MXL_КарточкаЭД_%1",
		ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Если Выборка.Следующий() Тогда
	
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		
		ОбластьШапка.Параметры.ИмяФайла = Выборка.ПолноеИмяФайла;
		ОбластьШапка.Параметры.НомерДокумента = Выборка.НомерДокумента;
		ОбластьШапка.Параметры.ДатаДокумента = Выборка.ДатаДокумента;
		
		Если Выборка.Направление = Перечисления.НаправленияЭДО.Исходящий Тогда
			Отправитель = ИнтеграцияЭДО.ПредставлениеЮрФизЛица(Выборка.Организация);
			Получатель = ИнтеграцияЭДО.ПредставлениеЮрФизЛица(Выборка.Контрагент);
		Иначе
			Отправитель = ИнтеграцияЭДО.ПредставлениеЮрФизЛица(Выборка.Контрагент);
			Получатель = ИнтеграцияЭДО.ПредставлениеЮрФизЛица(Выборка.Организация);
		КонецЕсли;
		
		ОбластьШапка.Параметры.Отправитель = Отправитель;
		ОбластьШапка.Параметры.Получатель = Получатель;
		
		Файл = Новый Файл(Выборка.ПолноеИмяФайла);
		ОбластьШапка.Параметры.Идентификатор = Файл.ИмяБезРасширения;
		ОбластьШапка.Параметры.ВидДокумента = Выборка.ВидДокументаПредставление;

		ОбщегоНазначенияБЭД.ВывестиОбластьВТабличныйДокумент(ТабличныйДокумент,
			ОбластьШапка, "Шапка");
		
		Если ЗначениеЗаполнено(Выборка.СопроводительнаяЗаписка) Тогда
			ОбластьСопроводительнаяЗаписка = Макет.ПолучитьОбласть("СопроводительнаяЗаписка");
			ОбластьСопроводительнаяЗаписка.Параметры.Заполнить(Выборка);
			ОбщегоНазначенияБЭД.ВывестиОбластьВТабличныйДокумент(ТабличныйДокумент,
				ОбластьСопроводительнаяЗаписка, "СопроводительнаяЗаписка");
		КонецЕсли;
		
		ОбластьТребуемыеПодписи = Макет.ПолучитьОбласть("ТребуемыеПодписи");
		
		ПодписьОтправителя = Отправитель;
		ПодписьПолучателя = ?(Выборка.ТребуетсяПодтверждение, Получатель, НСтр("ru = 'Не требуется'"));
			
		ОбластьТребуемыеПодписи.Параметры.ПредставлениеОтправителя = ПодписьОтправителя;
		ОбластьТребуемыеПодписи.Параметры.ПредставлениеПолучателя = ПодписьПолучателя;
		
		ОбщегоНазначенияБЭД.ВывестиОбластьВТабличныйДокумент(ТабличныйДокумент,
			ОбластьТребуемыеПодписи, "ТребуемыеПодписи");
			
		ОбластьСертификаты = Макет.ПолучитьОбласть("Сертификаты");
			ОбщегоНазначенияБЭД.ВывестиОбластьВТабличныйДокумент(ТабличныйДокумент,
				ОбластьСертификаты, "Сертификаты");	
				
		УстановленныеПодписи = ЭлектронныеДокументыЭДО.УстановленныеПодписи(Сообщение);		
		
		Если ЗначениеЗаполнено(ОтветноеСообщение) Тогда
			ОтветныеПодписи = ЭлектронныеДокументыЭДО.УстановленныеПодписи(ОтветноеСообщение);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(УстановленныеПодписи, ОтветныеПодписи);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(УстановленныеПодписи) Тогда			
			
			ОбластьСертификатыСтрока = Макет.ПолучитьОбласть("СертификатыСтрока");
			НомерСтроки = 1;
			
			Для Каждого Подпись Из УстановленныеПодписи Цикл
				ОбластьСертификатыСтрока.Параметры.Заполнить(Подпись);
				
				ОбластьСертификатыСтрока.Параметры.КомуВыдан = Подпись.Владелец;
				ОбластьСертификатыСтрока.Параметры.Сертификат = Подпись.Владелец;
				
				Если Подпись.ПодписьВерна Тогда
					СтатусПодписи = "Верна (" + Формат(Подпись.ДатаПроверкиПодписи,"ДЛФ=DT") + ")";
				Иначе
					СтатусПодписи = "Неверна (" + Формат(Подпись.ДатаПроверкиПодписи,"ДЛФ=DT") + ")";
				КонецЕсли;
				
				ОбластьСертификатыСтрока.Параметры.Статус = СтатусПодписи;

				ОбщегоНазначенияБЭД.ВывестиОбластьВТабличныйДокумент(ТабличныйДокумент, ОбластьСертификатыСтрока,
					"СертификатыСтрока", НомерСтроки);
				
				НомерСтроки = НомерСтроки + 1;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ОбластьПодпись = Макет.ПолучитьОбласть("Подпись");
		ОбластьПодпись.Параметры.ТекущаяДата = Формат(ТекущаяДатаСеанса(), "ДЛФ=D");
		ОбщегоНазначенияБЭД.ВывестиОбластьВТабличныйДокумент(ТабличныйДокумент, ОбластьПодпись, "Подпись");
		
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Очищает дополнительную информацию (сопроводительную записку) для указанного электронного документа.
// 
// Параметры:
// 	Сообщение - ДокументСсылка.СообщениеЭДО - Ссылка на сообщение ЭДО.
Процедура ОчиститьДополнительнуюИнформациюСообщения(Сообщение) Экспорт
	СообщениеОбъект = Сообщение.ПолучитьОбъект();
	СообщениеОбъект.ДополнительнаяИнформация = "";
	СообщениеОбъект.Записать();
КонецПроцедуры

// Получает информацию о товаре из файла электронного документа.
//
// Параметры:
//  ПараметрыПолучения - см. ФорматыЭДО.НовыеПараметрыПолученияДанныхДокумента.
// Возвращаемое значение:
// 	См. ФорматыЭДО.ИнформацияОТовареИзФайла.
Функция ДанныеНоменклатурыДокумента(ПараметрыПолучения) Экспорт

	Возврат ФорматыЭДО.ИнформацияОТовареИзФайла(ПараметрыПолучения);

КонецФункции

// Получает информацию по данным электронного документа.
//
// Параметры:
//  Сообщение - ДокументСсылка.СообщениеЭДО - Ссылка на сообщение ЭДО.
// Возвращаемое значение:
// 	См. КонвертацияЭДО.ПараметрыФайлаПроизвольногоДокумента.
Функция РаспознатьСообщение(Сообщение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщениеЭДО.ОсновнойФайл
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|		ПО СообщениеЭДО.ОсновнойФайл = ПрисоединенныеФайлы.Ссылка
		|ГДЕ
		|	СообщениеЭДО.Ссылка = &Ссылка
		|	И ПрисоединенныеФайлы.Расширение = &Расширение";
	
	Запрос.УстановитьПараметр("Ссылка", Сообщение);
	Запрос.УстановитьПараметр("Расширение", "xml");
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.ОсновнойФайл);
	Возврат КонвертацияЭДО.ПараметрыФайлаПроизвольногоДокумента(ДвоичныеДанные);
	
КонецФункции

Функция ЭтоСводныйУПД(ДанныеФайла) Экспорт
	Возврат ФорматыЭДО.ЭтоСводныйУПД(ДанныеФайла);
КонецФункции

Функция СвойстваСообщения(Сообщение, Свойства) Экспорт
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сообщение, Свойства);
КонецФункции

Функция ЭлектронныйДокументСообщенияЭДО(Сообщение) Экспорт
	Возврат СвойстваСообщения(Сообщение, "ЭлектронныйДокумент");
КонецФункции

Функция СообщениеОтправлено(Статус) Экспорт
	Возврат Статус = Перечисления.СтатусыСообщенийЭДО.Отправлен
		ИЛИ Статус = Перечисления.СтатусыСообщенийЭДО.Подтвержден;
КонецФункции

// Получает описание сообщения по двоичным данным.
//
// Параметры:
//  ОписаниеФайла - См. РаботаСФайламиБЭД.НовоеОписаниеФайла
// Возвращаемое значение:
// 	См. ФорматыЭДО.ПрочитатьСодержаниеДокумента.
Функция СодержаниеСообщения(ОписаниеФайла) Экспорт

	Возврат ФорматыЭДО.ПрочитатьСодержаниеДокумента(ОписаниеФайла);
	
КонецФункции

Функция ЭтоСлужебныйСообщение(Сообщение) Экспорт
	ТипЭлементаРегламента = Общегоназначения.ЗначениеРеквизитаОбъекта(Сообщение, "ТипЭлементаРегламента");
	Возврат РегламентыЭДО.ЭтоСлужебноеСообщение(ТипЭлементаРегламента);
КонецФункции

Функция ДокументыСообщений(Сообщения) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Сообщения, "ЭлектронныйДокумент", Истина);
КонецФункции

#КонецОбласти

#Область ДанныеДокумента

Функция ДанныеДокументовДляОтраженияВУчете(ЭлектронныеДокументы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭлектронныйДокументВходящийЭДО.Ссылка КАК ЭлектронныйДокумент,
		|	ЭлектронныйДокументВходящийЭДО.ВидДокумента КАК ВидДокумента,
		|	ВЫБОР
		|		КОГДА ЭлектронныйДокументВходящийЭДО.ВидДокумента.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыДокументовЭДО.Прикладной)
		|			ТОГДА ЭлектронныйДокументВходящийЭДО.ВидДокумента.ПрикладнойТипДокумента
		|		ИНАЧЕ ЭлектронныйДокументВходящийЭДО.ВидДокумента.ТипДокумента
		|	КОНЕЦ КАК ТипДокумента,
		|	СообщениеЭДО.Представление КАК Представление,
		|	ЭлектронныйДокументВходящийЭДО.Контрагент КАК Отправитель,
		|	ЭлектронныйДокументВходящийЭДО.Организация КАК Получатель,
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторКонтрагента КАК ИдентификаторОтправителя,
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторОрганизации КАК ИдентификаторПолучателя,
		|	ПрисоединенныеФайлы.Ссылка КАК ОсновнойФайл,
		|	ПрисоединенныеФайлы.ПолноеИмяФайла КАК ИмяОсновногоФайла,
		|	ПрисоединенныеФайлыДоп.Ссылка КАК ДополнительныйФайл,
		|	ПрисоединенныеФайлыДоп.ПолноеИмяФайла КАК ИмяДополнительногоФайла,
		|	СостоянияЭДО.Состояние КАК СостояниеДокумента,
		|	СообщениеЭДО.Направление КАК Направление
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ПО (СообщениеЭДО.ТипЭлементаРегламента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя))
		|		И (СообщениеЭДО.ЭлектронныйДокумент = ЭлектронныйДокументВходящийЭДО.Ссылка)
		|		И (ЭлектронныйДокументВходящийЭДО.Ссылка В (&ЭлектронныеДокументы))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовЭДО КАК СостоянияЭДО
		|		ПО ЭлектронныйДокументВходящийЭДО.Ссылка = СостоянияЭДО.ЭлектронныйДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|		ПО (ПрисоединенныеФайлы.Ссылка = СообщениеЭДО.ОсновнойФайл)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлыДоп
		|		ПО (ПрисоединенныеФайлыДоп.ВладелецФайла = СообщениеЭДО.Ссылка)
		|		И (ПрисоединенныеФайлыДоп.Ссылка <> СообщениеЭДО.ОсновнойФайл)
		|		И НЕ ПрисоединенныеФайлыДоп.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭлектронныйДокументИсходящийЭДО.Ссылка,
		|	ЭлектронныйДокументИсходящийЭДО.ВидДокумента,
		|	ВЫБОР
		|		КОГДА
		|			ЭлектронныйДокументИсходящийЭДО.ВидДокумента.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыДокументовЭДО.Прикладной)
		|			ТОГДА ЭлектронныйДокументИсходящийЭДО.ВидДокумента.ПрикладнойТипДокумента
		|		ИНАЧЕ ЭлектронныйДокументИсходящийЭДО.ВидДокумента.ТипДокумента
		|	КОНЕЦ,
		|	СообщениеЭДО.Представление,
		|	ЭлектронныйДокументИсходящийЭДО.Организация,
		|	ЭлектронныйДокументИсходящийЭДО.Контрагент,
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторОрганизации,
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторКонтрагента,
		|	ПрисоединенныеФайлы.Ссылка,
		|	ПрисоединенныеФайлы.ПолноеИмяФайла,
		|	ПрисоединенныеФайлыДоп.Ссылка,
		|	ПрисоединенныеФайлыДоп.ПолноеИмяФайла,
		|	СостоянияЭДО.Состояние,
		|	СообщениеЭДО.Направление
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ПО (СообщениеЭДО.ТипЭлементаРегламента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя))
		|		И (СообщениеЭДО.ЭлектронныйДокумент = ЭлектронныйДокументИсходящийЭДО.Ссылка)
		|		И (ЭлектронныйДокументИсходящийЭДО.Ссылка В (&ЭлектронныеДокументы))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовЭДО КАК СостоянияЭДО
		|		ПО (СообщениеЭДО.ЭлектронныйДокумент = СостоянияЭДО.ЭлектронныйДокумент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|		ПО (ПрисоединенныеФайлы.Ссылка = СообщениеЭДО.ОсновнойФайл)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлыДоп
		|		ПО (ПрисоединенныеФайлыДоп.ВладелецФайла = СообщениеЭДО.Ссылка)
		|		И (ПрисоединенныеФайлыДоп.Ссылка <> СообщениеЭДО.ОсновнойФайл)
		|		И НЕ ПрисоединенныеФайлыДоп.ПометкаУдаления";
	
	Запрос.Параметры.Вставить("ЭлектронныеДокументы", ЭлектронныеДокументы);
	
	НаборДанных = Новый Массив;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат НаборДанных;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Данные = НовыеДанныеДокументовДляОтраженияВУчете();
		ЗаполнитьЗначенияСвойств(Данные, Выборка);
		Данные.ДанныеОсновногоФайла.ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.ОсновнойФайл);
		Данные.ДанныеОсновногоФайла.ИмяФайла = Выборка.ИмяОсновногоФайла;
		Если ЗначениеЗаполнено(Выборка.ДополнительныйФайл) Тогда
			Данные.ДанныеДополнительногоФайла.ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.ДополнительныйФайл);
			Данные.ДанныеДополнительногоФайла.ИмяФайла = Выборка.ИмяДополнительногоФайла;
		КонецЕсли;
		
		НаборДанных.Добавить(Данные);
		
	КонецЦикла;
	
	Возврат НаборДанных;
	
КонецФункции

Функция СведенияСообщенияУчастникаЭДО(ЭлектронныйДокумент) Экспорт
		
	Подписи = Новый ТаблицаЗначений;
	Подписи.Колонки.Добавить("Подписант", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	Подписи.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	Подписи.Колонки.Добавить("Владелец", Новый ОписаниеТипов("Строка",
		Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	
	Сведения = Новый Структура;
	
	Сведения.Вставить("ОписаниеВидаДокумента", Новый Структура);
	Сведения.ОписаниеВидаДокумента.Вставить("ТипДокумента", Перечисления.ТипыДокументовЭДО.ПустаяСсылка());
	Сведения.ОписаниеВидаДокумента.Вставить("ПрикладнойТипДокумента", Неопределено);
	Сведения.ОписаниеВидаДокумента.Вставить("ИдентификаторКомандыПечати", "");
	
	Сведения.Вставить("Подписи", Подписи);
	Сведения.Вставить("ОбъектыУчета", Новый Массив);
	Сведения.Вставить("Актуальный", Ложь);
	Сведения.Вставить("СодержитМаркируемыеТовары", Ложь);
	
	Сведения.Вставить("Сообщения", Новый Структура);
	Сведения.Сообщения.Вставить("ДанныеОтправителя", Новый Структура);
	Сведения.Сообщения.ДанныеОтправителя.Вставить("ИмяФайлаБезРасширения", "");
	Сведения.Сообщения.ДанныеОтправителя.Вставить("Расширение", "");
	Сведения.Сообщения.Вставить("ДанныеПолучателя", Новый Структура);
	Сведения.Сообщения.ДанныеПолучателя.Вставить("ИмяФайлаБезРасширения", "");
	Сведения.Сообщения.ДанныеПолучателя.Вставить("Расширение", "");
	
	ТекстыЗапросов = Новый Массив;
	
	Если ЭтоВходящийЭДО(ЭлектронныйДокумент) Тогда
		ТекстыЗапросов.Добавить(
			"ВЫБРАТЬ
			|	ВидыДокументовЭДО.ТипДокумента КАК ТипДокумента,
			|	ВидыДокументовЭДО.ПрикладнойТипДокумента КАК ПрикладнойТипДокумента,
			|	ВидыДокументовЭДО.ИдентификаторКомандыПечати КАК ИдентификаторКомандыПечати,
			|	ЗНАЧЕНИЕ(Перечисление.ВидыЭлектронныхПодписей.УсиленнаяКвалифицированная) КАК ВидПодписи,
			|	ЭлектронныйДокументВходящийЭДО.СодержитМаркируемыеТовары КАК СодержитМаркируемыеТовары
			|ИЗ
			|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
			|		ПО ЭлектронныйДокументВходящийЭДО.ВидДокумента = ВидыДокументовЭДО.Ссылка
			|		И ЭлектронныйДокументВходящийЭДО.Ссылка = &ЭлектронныйДокумент");
	Иначе
		ТекстыЗапросов.Добавить(
			"ВЫБРАТЬ
			|	ВидыДокументовЭДО.ТипДокумента КАК ТипДокумента,
			|	ВидыДокументовЭДО.ПрикладнойТипДокумента КАК ПрикладнойТипДокумента,
			|	ВидыДокументовЭДО.ИдентификаторКомандыПечати КАК ИдентификаторКомандыПечати,
			|	ЭлектронныйДокументИсходящийЭДО.ВидПодписи КАК ВидПодписи,
			|	ЭлектронныйДокументИсходящийЭДО.СодержитМаркируемыеТовары КАК СодержитМаркируемыеТовары
			|ИЗ
			|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
			|		ПО ЭлектронныйДокументИсходящийЭДО.ВидДокумента = ВидыДокументовЭДО.Ссылка
			|		И ЭлектронныйДокументИсходящийЭДО.Ссылка = &ЭлектронныйДокумент");
	КонецЕсли;
	
	ТекстыЗапросов.Добавить(ИнтеграцияЭДО.ТекстЗапросаОбъектовУчетаЭлектронныхДокументов());
	
	ТекстыЗапросов.Добавить(
		"ВЫБРАТЬ
		|	СообщениеЭДО.ОсновнойФайл КАК Ссылка,
		|	СообщениеЭДО.ОсновнойФайл.ПолноеИмяФайла КАК ПолноеИмяФайла,
		|	СообщениеЭДО.ТипЭлементаРегламента
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент
		|	И СообщениеЭДО.ТипЭлементаРегламента В (&ТипыЭлементовРегламента)");
	
	ТипыЭлементовРегламента = Новый Массив;
	ТипыЭлементовРегламента.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);
	ТипыЭлементовРегламента.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя);
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	Запрос.УстановитьПараметр("ТипыЭлементовРегламента", ТипыЭлементовРегламента);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	Если РезультатыЗапроса[0].Пустой() Тогда
		Возврат Сведения;
	КонецЕсли;
	
	ВыборкаОписанияВида = РезультатыЗапроса[0].Выбрать();
	ВыборкаОписанияВида.Следующий();
	ЗаполнитьЗначенияСвойств(Сведения.ОписаниеВидаДокумента, ВыборкаОписанияВида);
	ЗаполнитьЗначенияСвойств(Сведения, ВыборкаОписанияВида);
	
	ВыборкаОбъектовУчета = РезультатыЗапроса[1].Выбрать();
	Пока ВыборкаОбъектовУчета.Следующий() Цикл
		Сведения.ОбъектыУчета.Добавить(ВыборкаОбъектовУчета.ОбъектУчета);
		Если ВыборкаОбъектовУчета.Актуальный Тогда
			Сведения.Актуальный = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Сведения.Актуальный = Не РезультатыЗапроса[1].Пустой();
	
	ВыборкаФайлов = РезультатыЗапроса[2].Выбрать();
	Пока ВыборкаФайлов.Следующий() Цикл
		Если ВыборкаОписанияВида.ВидПодписи = Перечисления.ВидыЭлектронныхПодписей.Простая Тогда
			ПростыеПодписи = УстановленныеПростыеПодписи(ВыборкаФайлов.Ссылка);
			Для Каждого СвойстваПодписи Из ПростыеПодписи Цикл
				СтрокаПодписи = Сведения.Подписи.Добавить();
				СтрокаПодписи.Подписант = СвойстваПодписи.УстановившийПодпись;
				СтрокаПодписи.Дата = СвойстваПодписи.ДатаПодписи;
				СтрокаПодписи.Владелец = СвойстваПодписи.ВладелецПодписи;
			КонецЦикла;
		Иначе
			ЭлектронныеПодписи = ЭлектроннаяПодпись.УстановленныеПодписи(ВыборкаФайлов.Ссылка);
			Для Каждого СвойстваПодписи Из ЭлектронныеПодписи Цикл
				СтрокаПодписи = Сведения.Подписи.Добавить();
				СтрокаПодписи.Подписант = СвойстваПодписи.УстановившийПодпись;
				СтрокаПодписи.Дата = СвойстваПодписи.ДатаПодписи;
				СтрокаПодписи.Владелец = СвойстваПодписи.КомуВыданСертификат;
			КонецЦикла;
		КонецЕсли;
		
		// Заполним сведения о сообщениях
		Если ВыборкаФайлов.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя Тогда
			ТипЭлементаРегламента = "ДанныеОтправителя";
		Иначе
			ТипЭлементаРегламента = "ДанныеПолучателя";			
		КонецЕсли;
		
		СведенияОИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ВыборкаФайлов.ПолноеИмяФайла);
		ЭлементСведений = Сведения.Сообщения[ТипЭлементаРегламента]; 
		ЭлементСведений.ИмяФайлаБезРасширения = СведенияОИмениФайла.ИмяБезРасширения;
		ЭлементСведений.Расширение = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(СведенияОИмениФайла.Расширение);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Сведения.Сообщения.ДанныеПолучателя.ИмяФайлаБезРасширения) Тогда
		Сведения.Сообщения.ДанныеПолучателя = Неопределено;
	КонецЕсли;
	
	Возврат Сведения;
	
КонецФункции

Функция ЕстьОтклонениеАннулирования(ЭлектронныйДокумент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент
		|	И СообщениеЭДО.ТипЭлементаРегламента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовРегламентаЭДО.ПОА_УОУ)
		|	И СообщениеЭДО.Направление = ЗНАЧЕНИЕ(Перечисление.НаправленияЭДО.Входящий)";
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();
КонецФункции

Функция СообщениеОтправителя(ЭлектронныйДокумент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент
		|	И СообщениеЭДО.ТипЭлементаРегламента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя)";
	
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

Функция ВнутреннийДокументАктуален(ОбъектУчета, ВидДокумента, ЭлектронныйДокумент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщениеЭДО.ОсновнойФайл КАК Файл
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент
		|	И СообщениеЭДО.ТипЭлементаРегламента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя)";
	
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДвоичныеДанныеАрхива = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Файл);
	
	Возврат ВнутренниеДокументыЭДО.ВнутреннийДокументооборотАктуален(ОбъектУчета,
		ВидДокумента, ДвоичныеДанныеАрхива);
	
КонецФункции

Функция ПредставлениеДокумента(ЭлектронныйДокумент) Экспорт
	СвойстваДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйДокумент,
		"ВидДокумента, НомерДокумента, ДатаДокумента");
	Возврат ПредставлениеДокументаПоСвойствам(СвойстваДокумента);
КонецФункции

Функция НовыеПараметрыВизуализацииДокумента() Экспорт

	Возврат ФорматыЭДО.НовыеПараметрыВизуализацииДокумента();
	
КонецФункции

Функция СформироватьДанныеДокументовДляВыгрузки(ОписанияОбъектовУчета) Экспорт
	
	ДанныеДокументов = СинхронизацияЭДО.НовыеДанныеОбъектов();
	
	ОписанияЗапросов = Новый Массив;
	ОписанияЗапросов.Добавить(ИнтеграцияЭДО.ЗапросСведенийПоОбъектамУчетаИУчастникамЭДО(
		ОписанияОбъектовУчета, "СведенияПоОбъектамУчета"));
	ОписанияЗапросов.Добавить(ЭлектронныеДокументыЭДО.ЗапросАктуальныхФорматов("АктуальныеФорматы"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияПоОбъектамУчета.ОбъектУчета КАК ОбъектУчета,
		|	СведенияПоОбъектамУчета.Направление КАК Направление,
		|	СведенияПоОбъектамУчета.ТипДокумента КАК ТипДокумента,
		|	СведенияПоОбъектамУчета.ПрикладнойТипДокумента КАК ПрикладнойТипДокумента,
		|	СведенияПоОбъектамУчета.Организация КАК Организация,
		|	СведенияПоОбъектамУчета.Контрагент КАК Контрагент,
		|	СведенияПоОбъектамУчета.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СведенияПоОбъектамУчета.ОрганизацияИНН КАК ОрганизацияИНН,
		|	СведенияПоОбъектамУчета.ОрганизацияКПП КАК ОрганизацияКПП,
		|	СведенияПоОбъектамУчета.КонтрагентИНН КАК КонтрагентИНН,
		|	СведенияПоОбъектамУчета.КонтрагентКПП КАК КонтрагентКПП,
		|	ВидыДокументовЭДО.Ссылка КАК ВидДокумента,
		|	ВидыДокументовЭДО.Наименование КАК ВидДокументаНаименование,
		|	АктуальныеФорматы.Формат
		|ИЗ
		|	СведенияПоОбъектамУчета КАК СведенияПоОбъектамУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|		ПО СведенияПоОбъектамУчета.ТипДокумента = ВидыДокументовЭДО.ТипДокумента
		|		И СведенияПоОбъектамУчета.ПрикладнойТипДокумента = ВидыДокументовЭДО.ПрикладнойТипДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АктуальныеФорматы КАК АктуальныеФорматы
		|		ПО ВидыДокументовЭДО.Ссылка = АктуальныеФорматы.ВидДокумента";
	
	Запрос = ОбщегоНазначенияБЭД.СоединитьЗапросы(Запрос, ОписанияЗапросов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПараметрыПредставления = НовыеСвойстваПредставленияДокумента();
	
	Пока Выборка.Следующий() Цикл
		
		Настройки = ФорматыЭДО.НовыеНастройкиФормированияДокументаПоОбъектуУчета();
		Настройки.ТипДокумента = Выборка.ТипДокумента;
		Настройки.Формат = Выборка.Формат;
		Настройки.ОтключитьРассчетДополнительныхПолей = Истина;
		
		Данные = ФорматыЭДО.НовыеДанныеДляФормированияОсновногоТитула();
		Данные.УникальныйИдентификатор = Строка(Новый УникальныйИдентификатор);
		Данные.Участники.ИдентификаторОтправителя = Выборка.ОрганизацияИНН + ?(ПустаяСтрока(Выборка.ОрганизацияКПП),"",
			"_" + Выборка.ОрганизацияКПП);
		Данные.Участники.ИдентификаторПолучателя = Выборка.КонтрагентИНН + ?(ПустаяСтрока(Выборка.КонтрагентКПП),"",
			"_" + Выборка.КонтрагентКПП);
		
		ПараметрыФормирования = ИнтеграцияЭДО.НовыеПараметрыФормированияДанныхОбъектаУчет();
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, Настройки);
		ОписаниеДанных = ИнтеграцияЭДО.ОписаниеДанныхОбъектаУчета(Выборка.ОбъектУчета,
			ПараметрыФормирования);
		Данные.ДанныеДокумента = ОписаниеДанных.Данные;
		
		РезультатФормирования = ФорматыЭДО.СформироватьДанныеОсновногоТитулаПоОбъектуУчета(
			Выборка.ОбъектУчета, Настройки, Данные);
		
		Содержание = РезультатФормирования.Содержание;
		
		НовыеДанные = СинхронизацияЭДО.ДобавитьДанныеОбъекта(ДанныеДокументов);
		НовыеДанные.Объект = Выборка.ОбъектУчета;
		НовыеДанные.СпособОбмена = Перечисления.СпособыОбменаЭД.БыстрыйОбмен;
		НовыеДанные.ИдентификаторДокументооборота = Строка(Новый УникальныйИдентификатор);
		НовыеДанные.ИдентификаторСообщения = Содержание.ИдентификаторДокумента;
		НовыеДанные.ТипРегламента = Содержание.ТипРегламента;
		НовыеДанные.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя;
		НовыеДанные.ТипДокумента = Выборка.ТипДокумента;
		НовыеДанные.ВидДокумента = Выборка.ВидДокумента;
		НовыеДанные.ИдентификаторОтправителя = Данные.Участники.ИдентификаторОтправителя;
		НовыеДанные.ИдентификаторПолучателя = Данные.Участники.ИдентификаторПолучателя;
		НовыеДанные.Организация = Выборка.Организация;
		НовыеДанные.Контрагент = Выборка.Контрагент;
		НовыеДанные.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
		
		ОписаниеДокумента = СинхронизацияЭДО.НовоеОписаниеДокумента();
		ОписаниеДокумента.Номер = Содержание.НомерДокумента;
		ОписаниеДокумента.Дата = Содержание.ДатаДокумента;
		ОписаниеДокумента.Сумма = Содержание.СуммаДокумента;
		НовыеДанные.ОписаниеДокумента = ОписаниеДокумента;
		
		НовыеДанные.ОписаниеДанных.ИмяФайла = РезультатФормирования.Документ.ИмяФайла;
		НовыеДанные.ОписаниеДанных.ДвоичныеДанные = РезультатФормирования.Документ.ДвоичныеДанные;
		
		ПараметрыПредставления.ВидДокумента = Выборка.ВидДокументаНаименование;
		ПараметрыПредставления.НомерДокумента = Содержание.НомерДокумента;
		ПараметрыПредставления.ДатаДокумента = Содержание.ДатаДокумента;
		НовыеДанные.Представление = ПредставлениеДокументаПоСвойствам(ПараметрыПредставления);
		
	КонецЦикла;
	
	Возврат ДанныеДокументов;
	
КонецФункции

Процедура ЗагрузитьИдентификаторыСвязанныхОбъектовУчета(ДокументОбъект, СвязанныеОбъектыУчета) Экспорт
	
	ДокументОбъект.ИдентификаторыОснований.Очистить();
	
	Если Не ЗначениеЗаполнено(СвязанныеОбъектыУчета) Тогда
		Возврат
	КонецЕсли;
	
	ТаблицаСвязанныхОбъектовУчета = НоваяТаблицаСвязанныхОбъектовУчета();
	
	Для Каждого ОбъектУчета Из СвязанныеОбъектыУчета Цикл
		СтрокаТаблицы = ТаблицаСвязанныхОбъектовУчета.Добавить();
		СтрокаТаблицы.ОбъектУчета = ОбъектУчета;
	КонецЦикла;
	
	РезультатЗапроса = РезультатЗапросаИдентификаторовДокументоборотовОбъектовУчета(ТаблицаСвязанныхОбъектовУчета);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ДокументОбъект.ИдентификаторыОснований.Добавить();
		ЗаполнитьЭлементКоллекцииИдентификаторыОснованияДокумента(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

Функция СвойстваДокумента(Документ, Свойства) Экспорт
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, Свойства);
КонецФункции

Функция ЗапросСвойствДокументов(Документы, ИмяВременнойТаблицы = "") Экспорт
	
	ОписаниеЗапроса = ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса();
	
	Если Не ЗначениеЗаполнено(Документы) Тогда
		Возврат ОписаниеЗапроса;
	КонецЕсли;
	
	МеткаВременнойТаблицы = "ПОМЕСТИТЬ ИмяВременнойТаблицы";
	ЗначениеВременнойТаблицы = "";
	Если ЗначениеЗаполнено(ИмяВременнойТаблицы) Тогда
		ЗначениеВременнойТаблицы = СтрЗаменить(МеткаВременнойТаблицы, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	КонецЕсли;
	
	ОписаниеЗапроса.Текст =
		"ВЫБРАТЬ
		|	ДокументЭДО.Ссылка КАК ЭлектронныйДокумент,
		|	ДокументЭДО.Номер,
		|	ДокументЭДО.Дата,
		|	ДокументЭДО.ВидДокумента,
		|	ДокументЭДО.Контрагент,
		|	ДокументЭДО.Организация,
		|	ДокументЭДО.СуммаДокумента
		|ПОМЕСТИТЬ ИмяВременнойТаблицы
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ДокументЭДО
		|ГДЕ
		|	ДокументЭДО.Ссылка В (&Документы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументЭДО.Ссылка КАК ЭлектронныйДокумент,
		|	ДокументЭДО.Номер,
		|	ДокументЭДО.Дата,
		|	ДокументЭДО.ВидДокумента,
		|	ДокументЭДО.Контрагент,
		|	ДокументЭДО.Организация,
		|	ДокументЭДО.СуммаДокумента
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ДокументЭДО
		|ГДЕ
		|	ДокументЭДО.Ссылка В (&Документы)";
	
	ОписаниеЗапроса.Текст = СтрЗаменить(ОписаниеЗапроса.Текст, МеткаВременнойТаблицы, ЗначениеВременнойТаблицы);
	ОписаниеЗапроса.СлужебныеПараметры.Вставить("Документы", Документы);
	
	Возврат ОписаниеЗапроса;
	
КонецФункции


// См. ОбменСКонтрагентами.ДанныеЭлектронногоДокумента.
Функция ДанныеЭлектронногоДокумента(ЭлектронныйДокумент) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеОтправителя");
	Результат.Вставить("ДанныеПолучателя", );
	
	ТипыЭлементовРегламента = Новый Массив;
	ТипыЭлементовРегламента.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);
	ТипыЭлементовРегламента.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	Запрос.УстановитьПараметр("ТипыЭлементовРегламента", ТипыЭлементовРегламента);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СообщениеЭДО.ОсновнойФайл,
	|	СообщениеЭДО.ТипЭлементаРегламента,
	|	СообщениеЭДО.Направление
	|ИЗ
	|	Документ.СообщениеЭДО КАК СообщениеЭДО
	|ГДЕ
	|	СообщениеЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент
	|	И СообщениеЭДО.ТипЭлементаРегламента В (&ТипыЭлементовРегламента)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеФайла = РаботаСФайлами.ДанныеФайла(Выборка.ОсновнойФайл);
		ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.ОсновнойФайл);
		
		Если НРег(ДанныеФайла.Расширение) = "xml" Тогда
			ОписаниеФайла = РаботаСФайламиБЭД.НовоеОписаниеФайла();
			ОписаниеФайла.ИмяФайла       = ДанныеФайла.ИмяФайла;
			ОписаниеФайла.ДвоичныеДанные = ДвоичныеДанныеФайла;
			
			ПараметрыПолученияДанных = ФорматыЭДО.НовыеПараметрыПолученияДанныхДокумента();
			ПараметрыПолученияДанных.Направление = Выборка.Направление;
			ПараметрыПолученияДанных.ОсновнойФайл = ОписаниеФайла;
			ДанныеСообщения = ФорматыЭДО.ДанныеЭлектронногоДокумента(ПараметрыПолученияДанных);			
			СодержаниеСообщения = ФорматыЭДО.ПрочитатьСодержаниеДокумента(ОписаниеФайла);
			
			Если ДанныеСообщения <> Неопределено И СодержаниеСообщения <> Неопределено Тогда
				ИмяКлюча = ?(Выборка.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя,
					"ДанныеОтправителя", "ДанныеПолучателя");
				
				Результат[ИмяКлюча] = Новый Структура("Формат, Содержание");
				Результат[ИмяКлюча].Содержание = ДанныеСообщения.НовыйЭД.ЗначениеРеквизита;
				Результат[ИмяКлюча].Формат = СодержаниеСообщения.Формат;
			КонецЕсли;
			
			
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Формирует данные файла информации отправителя для предоставления в ФНС.
// 
// Параметры:
// 	ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - ссылка на входящий электронный документ.
// 	                    - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - ссылка на исходящий электронный документ.  
// Возвращаемое значение:
// 	Структура - данные файла:
// * ИмяФайла - Строка
// * ДвоичныеДанные - ДвоичныеДанные 
// * Размер - Число
// * КНД - Строка - номер по классификатору налоговых документов.
// * УстановленныеПодписи - см. ЭлектроннаяПодпись.УстановленныеПодписи 
Функция ДанныеФайлаИнформацииОтправителяДляВыгрузкиФНС(ЭлектронныйДокумент) Экспорт

	Возврат ДанныеФайлаДляВыгрузкиФНС(ЭлектронныйДокумент,
		Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);

КонецФункции

// Формирует данные файла информации получателя для предоставления в ФНС.
// 
// Параметры:
// 	ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - ссылка на входящий электронный документ.
// 	                    - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - ссылка на исходящий электронный документ.  
// Возвращаемое значение:
// 	Структура - данные файла:
// * ИмяФайла - Строка
// * ДвоичныеДанные - ДвоичныеДанные 
// * Размер - Число
// * КНД - Строка - номер по классификатору налоговых документов.
// * УстановленныеПодписи - см. ЭлектроннаяПодпись.УстановленныеПодписи
Функция ДанныеФайлаИнформацииПолучателяДляВыгрузкиФНС(ЭлектронныйДокумент) Экспорт

	Возврат ДанныеФайлаДляВыгрузкиФНС(ЭлектронныйДокумент, 
		Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя);

КонецФункции

#КонецОбласти

#Область ПодписиДокумента

// Возвращает установленные подписи по электронному документу.
// 
// Параметры:
// 	Сообщение - ДокументСсылка.СообщениеЭДО - Ссылка на сообщение ЭДО.
// 	ВидПодписи - ПеречислениеСсылка.ВидыЭлектронныхПодписей - вид электронной подписи.
// Возвращаемое значение:
// 	Массив из См. НовыеДанныеПодписи.
Функция УстановленныеПодписи(Сообщение, ВидПодписи = Неопределено) Экспорт
	
	ПрисоединенныйФайл = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сообщение, "ОсновнойФайл");
	
	Если Не ЗначениеЗаполнено(ПрисоединенныйФайл) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Подписи = УстановленныеПодписиФайла(ПрисоединенныйФайл, ВидПодписи);
	
	Возврат Подписи;
	
КонецФункции

Функция ПроверитьПодписиДокумента(ЭлектронныйДокумент, КонтекстДиагностики) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("ПодписиДляПроверки");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщениеЭДО.ОсновнойФайл КАК ПрисоединенныйФайл
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент
		|	И СообщениеЭДО.ТипЭлементаРегламента В (&ТипыЭлементовРегламента)";
		
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	
	ТипыЭлементовРегламента = Новый Массив;
	ТипыЭлементовРегламента.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);
	ТипыЭлементовРегламента.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя);
	Запрос.УстановитьПараметр("ТипыЭлементовРегламента", ТипыЭлементовРегламента);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПрисоединенныеФайлыМассив = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ПрисоединенныйФайл");
	
	ДвоичныеДанныеФайлов = РаботаСФайламиБЭД.ДвоичныеДанныеФайлов(ПрисоединенныеФайлыМассив, КонтекстДиагностики);
	
	МенеджерКриптографии = Неопределено;
	Если ЭлектроннаяПодпись.ПроверятьЭлектронныеПодписиНаСервере() Тогда
		МенеджерКриптографии = КриптографияБЭД.МенеджерКриптографии();
	КонецЕсли;
	
	Если МенеджерКриптографии = Неопределено Тогда
		Результат.ПодписиДляПроверки = ПодписиДокументаДляПроверкиНаКлиенте(ДвоичныеДанныеФайлов);
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ДанныеФайла Из ДвоичныеДанныеФайлов Цикл
		
		УстановленныеПодписи = ЭлектроннаяПодпись.УстановленныеПодписи(ДанныеФайла.Ключ);
		
		Для Каждого СвойстваПописи Из УстановленныеПодписи Цикл
			РезультатПроверки = КриптографияБЭД.ПроверитьПодпись(МенеджерКриптографии, ДанныеФайла.Значение,
				СвойстваПописи.Подпись, КонтекстДиагностики);
			Если ЗначениеЗаполнено(РезультатПроверки.ОписаниеОшибки) Тогда
				Продолжить;
			КонецЕсли;
			СвойстваПописи.ПодписьВерна = РезультатПроверки.ПодписьВерна;
			СвойстваПописи.ДатаПроверкиПодписи = РезультатПроверки.ДатаПроверкиПодписи;
			ЭлектроннаяПодпись.ОбновитьПодпись(ДанныеФайла.Ключ, СвойстваПописи);
		КонецЦикла;
		
	КонецЦикла;
	
	Результат.Успех = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаписатьРезультатПроверкиПодписейДокумента(ПроверенныеПодписи) Экспорт
	
	Если Не ЗначениеЗаполнено(ПроверенныеПодписи) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого РезультатПроверкиФайла Из ПроверенныеПодписи Цикл
		
		УстановленныеПодписи = ЭлектроннаяПодпись.УстановленныеПодписи(РезультатПроверкиФайла.Ключ);
		
		Для Каждого СвойстваПописи Из УстановленныеПодписи Цикл
			РезультатПроверки = ПолучитьРезультатПроверкиПодписи(РезультатПроверкиФайла.Значение, СвойстваПописи.Подпись);
			Если РезультатПроверки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			СвойстваПописи.ПодписьВерна = РезультатПроверки.ПодписьВерна;
			СвойстваПописи.ДатаПроверкиПодписи = РезультатПроверки.ДатаПроверкиПодписи;
			ЭлектроннаяПодпись.ОбновитьПодпись(РезультатПроверкиФайла.Ключ, СвойстваПописи);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ДокументыНаПодписи

 Функция НовыйОтборДокументовНаПодписи() Экспорт
	Отбор = Новый Структура;
	Отбор.Вставить("Организация");
	Отбор.Вставить("Контрагент");
	Отбор.Вставить("ВидДокумента");
	Отбор.Вставить("Направление");
	Возврат Отбор;
КонецФункции

Функция ЗапросДокументовНаПодписи(Отбор) Экспорт
	
	ОтборОбъектовДляПодписания = МаршрутыПодписанияБЭД.НовыйОтборОбъектовДляПодписания();
	ОтборОбъектовДляПодписания.Объект =
		"ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенийЭДО.Подписание)";
	ОписаниеЗапроса = МаршрутыПодписанияБЭД.ЗапросОбъектовДляПодписания("ОбъектыДляПодписания", ОтборОбъектовДляПодписания);
	
	ТекстыЗапроса = Новый Массив;
	ТекстыЗапроса.Добавить(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СообщениеЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
		|	ОбъектыДляПодписания.Сертификат КАК Сертификат
		|ПОМЕСТИТЬ ДокументыДляПодписания
		|ИЗ
		|	ОбъектыДляПодписания КАК ОбъектыДляПодписания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ПО ОбъектыДляПодписания.Объект = СообщениеЭДО.Ссылка");
	
	ТекстыЗапросаПоНаправлению = Новый Массив;
	Если Не ЗначениеЗаполнено(Отбор.Направление)
		ИЛИ Отбор.Направление = Перечисления.НаправленияЭДО.Входящий Тогда
		ТекстыЗапросаПоНаправлению.Добавить(
			"ВЫБРАТЬ
			|	ДокументыДляПодписания.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
			|	ДокументыДляПодписания.Сертификат КАК Сертификат,
			|	ДокументЭДО.Организация КАК Организация,
			|	ДокументЭДО.ВидДокумента КАК ВидДокумента,
			|	ДокументЭДО.НомерДокумента КАК НомерДокумента,
			|	ДокументЭДО.ДатаДокумента КАК ДатаДокумента,
			|	ДокументЭДО.СуммаДокумента КАК СуммаДокумента
			|ИЗ
			|	ДокументыДляПодписания
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящийЭДО КАК ДокументЭДО
			|		ПО ДокументыДляПодписания.ЭлектронныйДокумент = ДокументЭДО.Ссылка
			|ГДЕ
			|	&УсловиеОтбора");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Отбор.Направление)
		ИЛИ Отбор.Направление <> Перечисления.НаправленияЭДО.Входящий Тогда
		ТекстыЗапросаПоНаправлению.Добавить(
			"ВЫБРАТЬ
			|	ДокументыДляПодписания.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
			|	ДокументыДляПодписания.Сертификат КАК Сертификат,
			|	ДокументЭДО.Организация КАК Организация,
			|	ДокументЭДО.ВидДокумента КАК ВидДокумента,
			|	ДокументЭДО.НомерДокумента КАК НомерДокумента,
			|	ДокументЭДО.ДатаДокумента КАК ДатаДокумента,
			|	ДокументЭДО.СуммаДокумента КАК СуммаДокумента
			|ИЗ
			|	ДокументыДляПодписания
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументИсходящийЭДО КАК ДокументЭДО
			|		ПО ДокументыДляПодписания.ЭлектронныйДокумент = ДокументЭДО.Ссылка
			|ГДЕ
			|	&УсловиеОтбора");
	КонецЕсли;
	
	РазделительЗапроса = "
		|ОБЪЕДИНИТЬ ВСЕ
		|";
	
	ТекстыЗапроса.Добавить(СтрСоединить(ТекстыЗапросаПоНаправлению, РазделительЗапроса));
	
	Запрос = Новый Запрос(СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов()));
	Запрос = ОбщегоНазначенияБЭД.СоединитьЗапросы(Запрос, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОписаниеЗапроса));
	
	УсловиеОтбора = Новый Массив;
	
	ДобавитьУсловиеОтбораДокументовДляПодписания(Запрос, УсловиеОтбора, Отбор, "ДокументЭДО", "Организация");
	ДобавитьУсловиеОтбораДокументовДляПодписания(Запрос, УсловиеОтбора, Отбор, "ДокументЭДО", "Контрагент");
	ДобавитьУсловиеОтбораДокументовДляПодписания(Запрос, УсловиеОтбора, Отбор, "ДокументЭДО", "ВидДокумента");
	
	Если ЗначениеЗаполнено(УсловиеОтбора) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", СтрСоединить(УсловиеОтбора, " И "));
	Иначе
		Запрос.УстановитьПараметр("УсловиеОтбора", Истина);
	КонецЕсли;

	Возврат Запрос;
	
КонецФункции

#КонецОбласти

#Область СвязанныеДокументы

Функция НовыйОтборСвязанныхДокументовВходящегоЭДО() Экспорт
	Отбор = Новый Структура;
	Отбор.Вставить("ЭлектронныйДокумент", Документы.ЭлектронныйДокументВходящийЭДО.ПустаяСсылка());
	Отбор.Вставить("ИдентификаторыСвязи", Новый Массив);
	Возврат Отбор;
КонецФункции

Функция ЗапросСвязанныхДокументовВходящегоЭДО(Отбор, ИмяВременнойТаблицы = "") Экспорт
	
	ОписаниеЗапроса = ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса();
	
	Если Не ЗначениеЗаполнено(Отбор.ЭлектронныйДокумент) Тогда
		Возврат ОписаниеЗапроса;
	КонецЕсли;
	
	МеткаВременнойТаблицы = "ПОМЕСТИТЬ ИмяВременнойТаблицы";
	ЗначениеВременнойТаблицы = "";
	Если ЗначениеЗаполнено(ИмяВременнойТаблицы) Тогда
		ЗначениеВременнойТаблицы = СтрЗаменить(МеткаВременнойТаблицы, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	КонецЕсли;
	
	ОписаниеЗапроса.Текст =
		"ВЫБРАТЬ
		|	ЭлектронныйДокументВходящийЭДОИдентификаторыОснований.ИдентификаторСвязи,
		|	ЭлектронныйДокументВходящийЭДОИдентификаторыОснований.ИдентификаторДокументооборота
		|ПОМЕСТИТЬ ВТ_ИдентификаторыОснований
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО.ИдентификаторыОснований КАК
		|		ЭлектронныйДокументВходящийЭДОИдентификаторыОснований
		|ГДЕ
		|	ЭлектронныйДокументВходящийЭДОИдентификаторыОснований.Ссылка = &ОтборЭлектронныйДокумент
		|;
		|
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументЭДО.Ссылка КАК ЭлектронныйДокумент
		|ПОМЕСТИТЬ ИмяВременнойТаблицы
		|ИЗ
		|	ВТ_ИдентификаторыОснований
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящийЭДО КАК ДокументЭДО
		|		ПО ВТ_ИдентификаторыОснований.ИдентификаторДокументооборота = ДокументЭДО.ИдентификаторДокументооборота
		|		И ВТ_ИдентификаторыОснований.ИдентификаторДокументооборота <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументЭДО.Ссылка КАК ЭлектронныйДокумент
		|ИЗ
		|	ВТ_ИдентификаторыОснований КАК ВТ_ИдентификаторыОснований
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящийЭДО КАК ДокументЭДО
		|		ПО ВТ_ИдентификаторыОснований.ИдентификаторСвязи = ДокументЭДО.ИдентификаторСвязи
		|		И ВТ_ИдентификаторыОснований.ИдентификаторСвязи <> """"
		|		И ВТ_ИдентификаторыОснований.ИдентификаторДокументооборота = """"
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОснований КАК ВТ_ИдентификаторыДокументооборотов
		|		ПО ДокументЭДО.ИдентификаторДокументооборота = ВТ_ИдентификаторыДокументооборотов.ИдентификаторДокументооборота
		|ГДЕ
		|	ВТ_ИдентификаторыДокументооборотов.ИдентификаторДокументооборота ЕСТЬ NULL";
	
	ОписаниеЗапроса.Текст = СтрЗаменить(ОписаниеЗапроса.Текст, МеткаВременнойТаблицы, ЗначениеВременнойТаблицы);
	
	ОписаниеЗапроса.СлужебныеПараметры.Вставить("ОтборЭлектронныйДокумент", Отбор.ЭлектронныйДокумент);
	
	Если ЗначениеЗаполнено(Отбор.ИдентификаторыСвязи) Тогда
		
		ОписаниеЗапроса.СлужебныеПараметры.Вставить("ОтборИдентификаторыСвязи", Отбор.ИдентификаторыСвязи);
		
		ОписаниеЗапроса.Текст = ОписаниеЗапроса.Текст + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
		
		ОписаниеЗапроса.Текст = ОписаниеЗапроса.Текст
			+ "ВЫБРАТЬ
			|	ДокументЭДО.Ссылка КАК ЭлектронныйДокумент
			|ИЗ
			|	Документ.ЭлектронныйДокументВходящийЭДО КАК ДокументЭДО
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОснований КАК ВТ_ИдентификаторыСвязи
			|		ПО ДокументЭДО.ИдентификаторСвязи = ВТ_ИдентификаторыСвязи.ИдентификаторСвязи
			|ГДЕ
			|	ДокументЭДО.ИдентификаторСвязи В (&ОтборИдентификаторыСвязи)
			|	И ВТ_ИдентификаторыСвязи.ИдентификаторСвязи ЕСТЬ NULL";
			
	КонецЕсли;
	
	Возврат ОписаниеЗапроса;
	
КонецФункции

#КонецОбласти

#Область ДействияПоЭДО

// Возвращает набор действий по указанному состоянию и свойствам электронного документа.
// 
// Параметры:
// 	СостояниеДокумента - ПеречислениеСсылка.СостоянияДокументовЭДО - Состояние электронного документа.
// 	СвойстваДокумента - ДокументОбъект.ЭлектронныйДокументВходящийЭДО, ДокументОбъект.ЭлектронныйДокументИсходящийЭДО, Структура - Свойства:
// 	* Ссылка - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - Ссылка на электронный документ.
// 	* НаОзнакомлении - Булево - Признак необходимости ознакомиться с электронным документом.
// 	* СпособОбмена - ПеречислениеСсылка.СпособыОбменаЭД - Способ обмена электронным документом.
// Возвращаемое значение:
// 	Соответствие - Набор действий по состоянию ЭДО.
Функция ДействияПоСостояниюДокумента(СостояниеДокумента, СвойстваДокумента) Экспорт
	Возврат ДоступныеДействияПоЭДО(СостояниеДокумента, СвойстваДокумента);
КонецФункции

#КонецОбласти

#Область ОбработкаДействийПоЭДО

// Выполняет указанные действия по ЭДО над переданными объектами.
// 
// Параметры:
// 	ПараметрыВыполнения - См. ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО()
// 	КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики()
// Возвращаемое значение:
// 	Структура - Описание:
// * Итог - Структура - количество обработанных документов
// ** Сформировано - Число - Количество сформированных документов.
// ** Утверждено   - Число - Количество утвержденных документов.
// ** Подписано    - Число - Количество подписанных документов.
// ** Отправлено   - Число - Количество отправленных документов.
// * ОшибкиФормирования -  Массив из см. НовоеОписаниеОшибкиФормирования - описания ошибок при формировании.
// * ДанныеДляИнтерактивногоПодписания - Массив из см. ОписаниеНабораДанныхДляИнтерактивногоПодписания - данные для инициализации подписания с клиента.
// * КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики()
Функция ВыполнитьДействияПоЭДО(ПараметрыВыполнения, КонтекстДиагностики = Неопределено) Экспорт
	
	Если КонтекстДиагностики = Неопределено Тогда
		КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	КонецЕсли;
	
	РезультатДействий = НовыйРезультатДействийПоЭДО(КонтекстДиагностики);
	
	Если ОтсутствуютОбъектыДействий(ПараметрыВыполнения.ОбъектыДействий) Тогда
		Возврат РезультатДействий;
	КонецЕсли;
	
	ЗаполнитьОтпечакиСертификатов(ПараметрыВыполнения, КонтекстДиагностики);
	
	ПродолжитьВыполнениеДействийПоЭДО(ПараметрыВыполнения, РезультатДействий);
	
	Возврат РезультатДействий;
	
КонецФункции

Функция ВыполнитьДействияПоЭДОВФоне(ПараметрыВыполненияДействий, КонтекстДиагностики = Неопределено) Экспорт
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"ЭлектронныеДокументыЭДО.ВыполнитьДействияПоЭДО", ПараметрыВыполненияДействий, КонтекстДиагностики);
КонецФункции

Процедура ДобавитьДействие(НаборДействий, Действие) Экспорт
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, Действие);
КонецПроцедуры

Функция НовыйИдентификаторДокументооборота() Экспорт
	Возврат Строка(Новый УникальныйИдентификатор);
КонецФункции

Процедура ПередЗаписьюНовогоДокумента(ДокументОбъект, ОписаниеСообщения) Экспорт
	
	ДокументОбъект.ВидДокумента = ОписаниеСообщения.ВидСообщения;
	ДокументОбъект.НомерДокумента = ОписаниеСообщения.Данные.Содержание.НомерДокумента;
	ДокументОбъект.ДатаДокумента = ОписаниеСообщения.Данные.Содержание.ДатаДокумента;
	ДокументОбъект.СуммаДокумента = ОписаниеСообщения.Данные.Содержание.СуммаДокумента;
	ДокументОбъект.СодержитМаркируемыеТовары = ОписаниеСообщения.Данные.Содержание.ЕстьМаркировка;
	Если Не ЗначениеЗаполнено(ДокументОбъект.ВидПодписи) Тогда
		ДокументОбъект.ВидПодписи = Перечисления.ВидыЭлектронныхПодписей.УсиленнаяКвалифицированная;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписиНовогоДокумента(ДокументОбъект, ОписаниеСообщения, КонтекстДиагностики, ОбъектыУчета = Неопределено) Экспорт
	
	Действие = Перечисления.ДействияПоЭДО.Сформировать;
	
	СообщениеОбъект = СоздатьСообщение(ОписаниеСообщения, ДокументОбъект.Ссылка, ДокументОбъект);
	
	СостоянияЭлементовРегламента = РегламентыЭДО.НовыеСостоянияЭлементовРегламента();
	ЗаполнитьЗначенияСвойств(СостоянияЭлементовРегламента.Добавить(), СообщениеОбъект);
	
	Если ЗначениеЗаполнено(ДокументОбъект.ИдентификаторыОснований)
		И ЗначениеЗаполнено(ОписаниеСообщения.Данные.Содержание) Тогда
		ОбновитьСвязанныеДокументы(ОписаниеСообщения.Данные.Содержание.ТипДокумента,
			ДокументОбъект.ИдентификаторыОснований.Выгрузить(), Действие, КонтекстДиагностики);
	КонецЕсли;
	
	ДополненияСостоянийЭДО = Неопределено;
	Если Не ДокументОбъект.ОбменБезПодписи Тогда
		
		Если СообщениеОбъект.Направление = Перечисления.НаправленияЭДО.Интеркампани Тогда
			МаршрутПодписания = МаршрутыПодписанияБЭД.МаршрутУказыватьПриСоздании();
			СписокПодписантов = СписокПодписантовИнтеркампани(ДокументОбъект.Организация, ДокументОбъект.Контрагент);
		Иначе
			МаршрутПодписания = ДокументОбъект.МаршрутПодписания;
			СписокПодписантов = ДокументОбъект.СписокПодписантов.Выгрузить();
		КонецЕсли;
		
		Если МаршрутПодписания = МаршрутыПодписанияБЭД.МаршрутУказыватьПриСоздании()
			И Не ЗначениеЗаполнено(СписокПодписантов) Тогда
			ВызватьИсключение НСтр("ru = 'Не заполнен список подписантов'");
		КонецЕсли;
		
		ПараметрыМаршрута = СформироватьМаршрутПодписания(СообщениеОбъект, МаршрутПодписания, СписокПодписантов);
		
		ПараметрыОповещенияПодписантов = Новый Структура("СообщениеОбъект, ТаблицаПодписания",
			СообщениеОбъект, ПараметрыМаршрута.ТаблицаПодписания);
		
		ДокументОбъект.ДополнительныеСвойства.Вставить("ПараметрыОповещенияПодписантов",
			ПараметрыОповещенияПодписантов);
		
		Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО") Тогда
			ВидПодписи = Перечисления.ВидыЭлектронныхПодписей.УсиленнаяКвалифицированная;
		Иначе
			ВидПодписи = ДокументОбъект.ВидПодписи;
		КонецЕсли;
		
		ДополненияСостоянийЭДО = ДополненияСостоянийЭДОПриПодписании(СообщениеОбъект, ВидПодписи,
			ПараметрыМаршрута.ВесМаршрута);
		
	КонецЕсли;
	
	СостояниеДокумента = УстановитьСостояниеДокументаПриФормировании(ДокументОбъект, СостоянияЭлементовРегламента,
		ДокументОбъект.Дата, ОбъектыУчета, КонтекстДиагностики, ДополненияСостоянийЭДО);
	
	ЗаписатьДействиеВЖурнал(Действие, ДокументОбъект, СостояниеДокумента, ДокументОбъект.Дата, СообщениеОбъект);
	
КонецПроцедуры

Процедура ПослеЗаписиНовогоДокумента(ДокументОбъект, КонтекстДиагностики) Экспорт
	
	ПараметрыОповещенияПодписантов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДокументОбъект.ДополнительныеСвойства, "ПараметрыОповещенияПодписантов");
	
	Если ЗначениеЗаполнено(ПараметрыОповещенияПодписантов) Тогда
		ОповеститьОДокументеКПодписанию(ПараметрыОповещенияПодписантов.СообщениеОбъект,
			ПараметрыОповещенияПодписантов.ТаблицаПодписания);
	КонецЕсли;
	
	ЭлектронныеДокументыЭДОСобытия.ПослеФормированияЭлектронногоДокумента(ДокументОбъект.Ссылка, КонтекстДиагностики);
	
КонецПроцедуры

Функция ОбработатьРезультатДействийПоЭДОФоне(РезультатДействийПоЭДОФоне) Экспорт
	
	КонтекстПодписания = РезультатДействийПоЭДОФоне.КонтекстПодписания;
	
	Если ЗначениеЗаполнено(КонтекстПодписания) Тогда
		
		ПоместитьДанныеДляПодписанияВХранилище(КонтекстПодписания);
		
		КонтекстПодписания.АдресКонтекстаНаСервере = ПоместитьВоВременноеХранилище(
			КонтекстПодписания.КонтекстНаСервере, Новый УникальныйИдентификатор);
		
		КонтекстПодписания.Удалить("КонтекстНаСервере");
		
	КонецЕсли;
	
	Возврат РезультатДействийПоЭДОФоне;
	
КонецФункции

// Конвертирует переданные двоичные данные в произвольный электронный документ.
//
// Параметры:
//  ПараметрыФормирования - Структура - описывает стороны электронного документооборота:
//   * Контрагент - ОпределяемыйТип.КонтрагентБЭД - контрагент, которому нужно отправить документ.
//   * Организация - ОпределяемыйТип.Организация - организация, от имени которой нужно отправить документ.
//   * ДоговорКонтрагента - ОпределяемыйТип.ДоговорСКонтрагентомЭДО - договор, по которому отправляется документ (необязателен).
//   * ОбъектыУчета - Массив Из ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - учетные объекты, которые нужно проставить в качестве основания.
//   * ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - вид электронного документа (необязателен).
//   * СодержаниеДокумента - См. ФорматыЭДО.НовоеОписаниеФайлаДокумента (необязателен).
//  ПараметрыФайла - Структура - описывает файл, который нужно отправить:
//   * ИмяФайла - имя файла вместе с расширением.
//   * АдресХранилища - адрес временного хранилища, в котором содержатся двоичные данные файла.
// Возвращаемое значение:
//  ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - Истина - Ссылка на сформированный произвольный документ.
//  Неопределено - Если произвольный документ не сформирован.
//
Функция СоздатьПроизвольныйДокумент(ПараметрыФормирования, ПараметрыФайла) Экспорт
	
	Результат = Неопределено;
	
	Если ВыполнениеДействийПоЭДОЗапрещено() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОписаниеФайла = РаботаСФайламиБЭД.НовоеОписаниеФайла();
	ОписаниеФайла.ИмяФайла = ПараметрыФайла.ИмяФайла;
	ОписаниеФайла.ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПараметрыФайла.АдресХранилища);
		
	Содержание = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыФормирования, "СодержаниеДокумента");
	Если Не ЗначениеЗаполнено(Содержание) Тогда
		Содержание = ФорматыЭДО.ПрочитатьСодержаниеДокумента(ОписаниеФайла);
		Если Не ЗначениеЗаполнено(Содержание) Тогда
			Содержание = НовоеСодержаниеСообщения();
			Содержание.ТипРегламента = Перечисления.ТипыРегламентовЭДО.Неформализованный;
			Содержание.ТипДокумента = Перечисления.ТипыДокументовЭДО.Прочее;
		КонецЕсли;
	КонецЕсли;
	
	ВидДокумента = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыФормирования, "ВидДокумента");
	Если Не ЗначениеЗаполнено(ВидДокумента) Тогда
		ПараметрыПоиска = НовыеПараметрыПоискаВидаДокумента(Содержание.ТипДокумента);
		ВидДокумента = НайтиСоздатьВидДокумента(ПараметрыПоиска);
	КонецЕсли;
	
	КлючНастройкиОтправки = НастройкиЭДО.НовоеОписаниеПолейКлючаНастройкиОтправки();
	КлючНастройкиОтправки.Отправитель = ПараметрыФормирования.Организация;
	КлючНастройкиОтправки.Получатель = ПараметрыФормирования.Контрагент;
	КлючНастройкиОтправки.Договор = ПараметрыФормирования.Договор;
	КлючНастройкиОтправки.ВидДокумента = ВидДокумента;
	
	НастройкиОтправки = НастройкиЭДО.НастройкиОтправки(КлючНастройкиОтправки);
	Если Не ЗначениеЗаполнено(НастройкиОтправки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	НастройкиДокумента = НовыеНастройкиОтправкиДокумента();
	НастройкиДокумента.Организация = НастройкиОтправки.Отправитель;
	НастройкиДокумента.Контрагент = НастройкиОтправки.Получатель;
	НастройкиДокумента.ДоговорКонтрагента = НастройкиОтправки.Договор;
	НастройкиДокумента.ИдентификаторОрганизации = НастройкиОтправки.ИдентификаторОтправителя;
	НастройкиДокумента.ИдентификаторКонтрагента = НастройкиОтправки.ИдентификаторПолучателя;
	НастройкиДокумента.СпособОбмена = НастройкиОтправки.СпособОбмена;
	НастройкиДокумента.ОбменБезПодписи = НастройкиОтправки.ОбменБезПодписи;
	НастройкиДокумента.МаршрутПодписания = НастройкиОтправки.МаршрутПодписания;
	НастройкиДокумента.ТребуетсяИзвещение = НастройкиОтправки.ТребуетсяИзвещениеОПолучении;
	НастройкиДокумента.ТребуетсяПодтверждение = НастройкиОтправки.ТребуетсяОтветнаяПодпись;
	НастройкиДокумента.ВыгружатьДополнительныеСведения = НастройкиОтправки.ВыгружатьДополнительныеСведения;
	
	ОписаниеСообщения = НовоеОписаниеСообщения();
	ОписаниеСообщения.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя;
	ОписаниеСообщения.ВидСообщения = ВидДокумента;
	ОписаниеСообщения.Направление = Перечисления.НаправленияЭДО.Исходящий;
	ОписаниеСообщения.Данные.Содержание = Содержание;
	ОписаниеСообщения.Данные.Документ = ОписаниеФайла;
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	ДокументОбъект = СоздатьИсходящийДокумент(НастройкиДокумента, ОписаниеСообщения, КонтекстДиагностики, Неопределено,
		ПараметрыФормирования.ОбъектыУчета);
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции

// Отправляет все документы в соответствующем состоянии для указанных идентификаторов организаций.
// 
// Параметры:
// 	ИдентификаторыОрганизаций - Массив из Строка - набор идентификаторов организаций, по которым производится отправка
// 	ОтпечаткиСертификатов - См. КриптографияБЭДКлиентСервер.НовыйРезультатПолученияОтпечатков
// 	КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
// Возвращаемое значение:
// 	Неопределено - если выполнение действий запрещено.
// 	См. СинхронизацияЭДО.ОтправитьОбъекты
Функция ОтправитьВсеДокументы(ИдентификаторыОрганизаций, ОтпечаткиСертификатов = Неопределено, КонтекстДиагностики = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ИдентификаторыОрганизаций)
		ИЛИ ВыполнениеДействийПоЭДОЗапрещено(КонтекстДиагностики) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыДействийПоЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыДействийПоЭДО.ОбъектыДействий.ИдентификаторыОрганизаций = ИдентификаторыОрганизаций;
	ПараметрыДействийПоЭДО.ОтпечаткиСертификатов = ОтпечаткиСертификатов;
	ДобавитьДействие(ПараметрыДействийПоЭДО.НаборДействий, Перечисления.ДействияПоЭДО.Отправить);
	
	РезультатОтправки = ОтправитьСообщения(ПараметрыДействийПоЭДО, КонтекстДиагностики);
	
	Возврат РезультатОтправки;
	
КонецФункции

// Устанавливает ответственного по электронному документу.
// 
// Параметры:
// 	ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - Ссылка на электронный документ.
// 	Ответственный - СправочникСсылка.Пользователи - Ссылка на пользователя.
// 	КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
// 	Комментарий - Строка - Описание причины смены отвественного.
// Возвращаемое значение:
// 	Булево - Истина, если отвественный успешно установлен.
Функция УстановитьОтветственногоПоДокументу(ЭлектронныйДокумент, Ответственный, КонтекстДиагностики, Комментарий = "") Экспорт
	
	Если ВыполнениеДействийПоЭДОЗапрещено(КонтекстДиагностики) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ПеренаправитьДокумент(ЭлектронныйДокумент, Ответственный, КонтекстДиагностики, Комментарий);
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаДокументов

Функция ЗагрузитьОбработатьДанныеОбъектовКонтейнеров(ДанныеОбъектов, КонтекстДиагностики, ОтпечаткиСертификатов, ПаролиСертификатов = Неопределено, МенеджерКриптографии = Неопределено) Экспорт
	
	Результат = НовыйРезультатЗагрузкиДокументов();
	Результат.КонтекстДиагностики = КонтекстДиагностики;
	
	Если Не ЗначениеЗаполнено(ДанныеОбъектов)
		ИЛИ ВыполнениеДействийПоЭДОЗапрещено(КонтекстДиагностики) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДополнитьДанныеОбъектовДляЗагрузки(ДанныеОбъектов);
	
	БезПодписей = Истина;
	Для Каждого СтрокаДанных Из ДанныеОбъектов Цикл
		Если ЗначениеЗаполнено(СтрокаДанных.ПодписиОсновныхДанных)
			ИЛИ ЗначениеЗаполнено(СтрокаДанных.ПодписиДополнительныхДанных) Тогда
			БезПодписей = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если БезПодписей Тогда
		ПроверенныеПодписи = Новый Соответствие;
		Результат = ЗагрузитьДанныеОбъектовКонтейнеровПослеПроверкиПодписей(ДанныеОбъектов,
			ПроверенныеПодписи, КонтекстДиагностики, ОтпечаткиСертификатов, ПаролиСертификатов);
		Возврат Результат;
	КонецЕсли;
	
	ТребуетсяПроверкаПодписейНаКлиенте = Ложь;
	
	Если Не ОтпечаткиСертификатов.Сервер.Доступность
		И Не ОтпечаткиСертификатов.Облако.Доступность Тогда
		ТребуетсяПроверкаПодписейНаКлиенте = Истина;
	КонецЕсли;
	
	Если ТребуетсяПроверкаПодписейНаКлиенте Тогда
		КонтекстПроверки = НовыйКонтекстПроверкиПодписей();
		КонтекстПроверки.ОтпечаткиСертификатов = ОтпечаткиСертификатов;
		КонтекстПроверки.ПаролиСертификатов = ПаролиСертификатов;
		КонтекстПроверки.ДанныеДокументов = ДанныеОбъектов;
		Результат.КонтекстПроверкиПодписей = КонтекстПроверки;
		Возврат Результат;
	КонецЕсли;
	
	Если МенеджерКриптографии = Неопределено
		И ОтпечаткиСертификатов.Сервер.Доступность Тогда
		МенеджерКриптографии = КриптографияБЭД.МенеджерКриптографии();
	КонецЕсли;
	
	ПроверенныеПодписи = ПроверитьПодписиПоОбъектамКонтейнеров(ДанныеОбъектов, МенеджерКриптографии,
		КонтекстДиагностики);
	
	Результат = ЗагрузитьДанныеОбъектовКонтейнеровПослеПроверкиПодписей(ДанныеОбъектов,
		ПроверенныеПодписи, КонтекстДиагностики, ОтпечаткиСертификатов, ПаролиСертификатов);
	
	Возврат Результат;
	
КонецФункции

Функция ОбработатьРезультатЗагрузкиВФоне(РезультатЗагрузкиВФоне) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КонтекстДиагностики", РезультатЗагрузкиВФоне.КонтекстДиагностики);
	Результат.Вставить("КонтекстСобытияПослеЗагрузки", РезультатЗагрузкиВФоне.КонтекстСобытияПослеЗагрузки);
	Результат.Вставить("ПодписиДляПроверки");
	Результат.Вставить("РезультатДействийПоЭДО");
	Результат.Вставить("АдресКонтекстаНаСервере", "");
	
	Если ЗначениеЗаполнено(РезультатЗагрузкиВФоне.РезультатДействийПоЭДО) Тогда
		Результат.РезультатДействийПоЭДО = ОбработатьРезультатДействийПоЭДОФоне(
			РезультатЗагрузкиВФоне.РезультатДействийПоЭДО);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РезультатЗагрузкиВФоне.КонтекстПроверкиПодписей) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.АдресКонтекстаНаСервере = ПоместитьВоВременноеХранилище(
		РезультатЗагрузкиВФоне.КонтекстПроверкиПодписей, Новый УникальныйИдентификатор);
	
	ПодписиДляПроверки = Новый Массив;
	
	Для Каждого ДанныеДокумента Из РезультатЗагрузкиВФоне.КонтекстПроверкиПодписей.ДанныеДокументов Цикл
		
		Если ЗначениеЗаполнено(ДанныеДокумента.ОписаниеДанных)
			И ЗначениеЗаполнено(ДанныеДокумента.ПодписиОсновныхДанных) Тогда
			
			Для Каждого ОписаниеДанныхПодписи Из ДанныеДокумента.ПодписиОсновныхДанных Цикл
				ПараметрыПроверки = НовыеПараметрыПроверкиПодписиНаКлиенте();
				ПараметрыПроверки.ИдентификаторДанныхДокумента = ДанныеДокумента.ИдентификаторСтроки;
				ПараметрыПроверки.ДвоичныеДанныеФайла = ДанныеДокумента.ОписаниеДанных.ДвоичныеДанные;
				ПараметрыПроверки.ДвоичныеДанныеПодписи = ОписаниеДанныхПодписи.ДвоичныеДанные;
				ПараметрыПроверки.ЭтоОсновныеДанные = Истина;
				ПодписиДляПроверки.Добавить(ПараметрыПроверки);
			КонецЦикла;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеДокумента.ОписаниеДополнительныхДанных)
			И ЗначениеЗаполнено(ДанныеДокумента.ПодписиДополнительныхДанных) Тогда
			
			Для Каждого ОписаниеДанныхПодписи Из ДанныеДокумента.ПодписиДополнительныхДанных Цикл
				ПараметрыПроверки = НовыеПараметрыПроверкиПодписиНаКлиенте();
				ПараметрыПроверки.ИдентификаторДанныхДокумента = ДанныеДокумента.ИдентификаторСтроки;
				ПараметрыПроверки.ДвоичныеДанныеФайла = ДанныеДокумента.ОписаниеДополнительныхДанных.ДвоичныеДанные;
				ПараметрыПроверки.ДвоичныеДанныеПодписи = ОписаниеДанныхПодписи.ДвоичныеДанные;
				ПараметрыПроверки.ЭтоОсновныеДанные = Ложь;
				ПодписиДляПроверки.Добавить(ПараметрыПроверки);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.ПодписиДляПроверки = ПодписиДляПроверки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ТекстыЗапросов

Функция ТекстЗапросаСостоянияДокумента() Экспорт
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	СостоянияДокументовЭДО.Состояние
		|ИЗ
		|	РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|ГДЕ
		|	СостоянияДокументовЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент";
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапросаДанныхЭлементовСхемыРегламента(ЭтоВходящийЭДО) Экспорт
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента,
		|	СообщениеЭДО.Ссылка КАК Сообщение,
		|	СообщениеЭДО.ВидСообщения КАК ВидСообщения,
		|	СообщениеЭДО.Направление КАК Направление,
		|	СообщениеЭДО.Статус КАК Статус,
		|	СообщениеЭДО.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса,
		|	СообщениеЭДО.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		|	ДокументЭДО.ВидДокумента КАК ВидДокумента,
		|	ДокументЭДО.НомерДокумента КАК НомерДокумента,
		|	ДокументЭДО.ДатаДокумента КАК ДатаДокумента,
		|	ВидыДокументовЭДО.ТипДокумента КАК ТипДокумента,
		|	ВидыДокументовЭДО.ПрикладнойТипДокумента КАК ПрикладнойТипДокумента,
		|	ПрисоединенныеФайлы.Ссылка КАК ПрисоединенныйФайл
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИмяТаблицыДокументаЭДО КАК ДокументЭДО
		|		ПО СообщениеЭДО.ЭлектронныйДокумент = ДокументЭДО.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|		ПО СообщениеЭДО.ВидСообщения = ВидыДокументовЭДО.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|		ПО СообщениеЭДО.ОсновнойФайл = ПрисоединенныеФайлы.Ссылка
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент";
	ИмяТаблицыДокументаЭДО = ИмяТаблицыДокументаЭДО(ЭтоВходящийЭДО);
	Возврат СтрЗаменить(ТекстЗапроса, "ИмяТаблицыДокументаЭДО", ИмяТаблицыДокументаЭДО);
КонецФункции

#КонецОбласти

#Область ДополнительныеПоля

Функция ВариантыЗаполненияПолейЭлектронныхДокументов(ВидДокумента, Формат) Экспорт
	ТипДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДокумента, "ТипДокумента");
	Возврат ФорматыЭДО.ВариантыЗаполненияПолейЭлектронныхДокументов(ТипДокумента, Формат);
КонецФункции

// Возвращает доступные разделы дополнительных полей по формату.
//
// Возвращаемое значение:
// 	См. ФорматыЭДО.РазделыДополнительныхПолейФорматаЭлектронногоДокумента
Функция РазделыДополнительныхПолейФорматаЭлектронногоДокумента(ВидДокумента, Формат) Экспорт
	ТипДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДокумента, "ТипДокумента");
	Возврат ФорматыЭДО.РазделыДополнительныхПолейФорматаЭлектронногоДокумента(ТипДокумента, Формат);
КонецФункции

Функция ЗапросКонструктораДополнительныхПолей(ВидДокумента, Формат, ТипРаздела) Экспорт
	ТипДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДокумента, "ТипДокумента");
	Возврат ФорматыЭДО.ЗапросКонструктораДополнительныхПолей(ТипДокумента, Формат, ТипРаздела);
КонецФункции
#КонецОбласти

#Область ОбработкаСобытий

// См. СинхронизацияЭДОСобытия.ПослеОтправкиОбъекта
Процедура ПослеОтправкиОбъекта(Объект, ТранспортныйКонтейнер, ОшибкаПередачи, КонтекстДиагностики, Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОшибкаПередачи)
		ИЛИ СинхронизацияЭДО.ЭтоОшибкаПовторнойОтправки(ОшибкаПередачи) Тогда
		Если ДополнительныеПараметры = Неопределено Тогда
			ДополнительныеПараметры = Новый Структура;
		КонецЕсли;
		Если Не ДополнительныеПараметры.Свойство("ИтогДействийПоЭДО") Тогда
			ДополнительныеПараметры.Вставить("ИтогДействийПоЭДО",
				ЭлектронныеДокументыЭДОКлиентСервер.НовыйИтогВыполненияДействийПоЭДО());
		КонецЕсли;
		ОбработатьОтправленноеСообщение(Объект, ОшибкаПередачи, КонтекстДиагностики, Отказ,
			ДополнительныеПараметры.ИтогДействийПоЭДО);
		Возврат;
	КонецЕсли;
	
	ПричинаОстановки = ?(ОшибкаПередачи.Блокирующая,
		Перечисления.ПричиныОстановкиЭДО.ОшибкаПередачиБлокирующая,
		Перечисления.ПричиныОстановкиЭДО.ОшибкаПередачиНеблокирующая);
	ЭлектронныйДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "ЭлектронныйДокумент");
	Отказ = Не ОстановитьДокумент(ЭлектронныйДокумент, ПричинаОстановки, Перечисления.ДействияПоЭДО.Отправить,
		КонтекстДиагностики, ОшибкаПередачи.Описание);
	
КонецПроцедуры

// См. СинхронизацияЭДОСобытия.ПослеОтправкиОбъектов
Процедура ПослеОтправкиОбъектов(РезультатОтправки, КонтекстДиагностики) Экспорт
	
	Сообщения = Новый Массив;
	Для Каждого РезультатОтправкиОбъекта Из РезультатОтправки.ОтправленныеОбъекты Цикл
		Если РезультатОтправкиОбъекта.Значение Тогда
			Сообщения.Добавить(РезультатОтправкиОбъекта.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Сообщения) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщениеЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
		|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента,
		|	СостоянияДокументовЭДО.Состояние КАК Состояние
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО,
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|		ПО СообщениеЭДО.ЭлектронныйДокумент = СостоянияДокументовЭДО.ЭлектронныйДокумент
		|		И СостоянияДокументовЭДО.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.ОбменЗавершен)
		|ГДЕ
		|	СообщениеЭДО.Ссылка В (&Сообщения)";
	
	Запрос.УстановитьПараметр("Сообщения", Сообщения);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПДП_ИОП Тогда
			ОтправитьНаОзнакомление(Выборка.ЭлектронныйДокумент);
		КонецЕсли;
		
		ЭлектронныеДокументыЭДОСобытия.ПослеЗавершенияОбменаЭлектроннымДокументом(
			Выборка.ЭлектронныйДокумент, КонтекстДиагностики);
		
	КонецЦикла;
	
КонецПроцедуры

// См. СинхронизацияЭДОСобытия.ПослеИзмененияСтатусаПриглашения
Процедура ПослеИзмененияСтатусаПриглашения(ИдентификаторОрганизации, ИдентификаторКонтрагента, Статус, КонтекстДиагностики) Экспорт
	
	Если Статус = Перечисления.СтатусыПриглашений.Принято Тогда
		ВозобновитьДокументыПослеПолученияСогласияПоПриглашению(ИдентификаторОрганизации, ИдентификаторКонтрагента,
			КонтекстДиагностики);
		Возврат;
	КонецЕсли;
	
	ПричинаОстановки = Перечисления.ПричиныОстановкиЭДО.ПустаяСсылка();
	
	Если Статус = Перечисления.СтатусыПриглашений.ОжидаемСогласия Тогда
		
		ПричинаОстановки = Перечисления.ПричиныОстановкиЭДО.ОжидаетсяОтветНаПриглашение;
		
	ИначеЕсли Статус = Перечисления.СтатусыПриглашений.Отклонено Тогда
		
		ПричинаОстановки = Перечисления.ПричиныОстановкиЭДО.ОтклонениеПриглашения;
		
	ИначеЕсли Статус = Перечисления.СтатусыПриглашений.ТребуетсяОтправить
		ИЛИ Статус = Перечисления.СтатусыПриглашений.Ошибка Тогда
		
		ПричинаОстановки = Перечисления.ПричиныОстановкиЭДО.ТребуетсяОтправкаПриглашения;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПричинаОстановки) Тогда
		ОстановитьДокументыПослеИзмененияПриглашения(ИдентификаторОрганизации, ИдентификаторКонтрагента,
			ПричинаОстановки, КонтекстДиагностики);
	КонецЕсли;
	
КонецПроцедуры

// См. СинхронизацияЭДОСобытия.ПриИсправленииОшибкиПередачи
Процедура ПриИсправленииОшибкиПередачи(ИдентификаторДокументооборота, КонтекстДиагностики) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭлектронныйДокументВходящийЭДО.Ссылка КАК ЭлектронныйДокумент
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|ГДЕ
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторДокументооборота = &ИдентификаторДокументооборота
		|	И ЭлектронныйДокументВходящийЭДО.Остановлен
		|	И ЭлектронныйДокументВходящийЭДО.ПричинаОстановки = &ПричинаОстановки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭлектронныйДокументИсходящийЭДО.Ссылка КАК ЭлектронныйДокумент
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|ГДЕ
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокументооборота = &ИдентификаторДокументооборота
		|	И ЭлектронныйДокументИсходящийЭДО.Остановлен
		|	И ЭлектронныйДокументИсходящийЭДО.ПричинаОстановки = &ПричинаОстановки";
	
	Запрос.УстановитьПараметр("ИдентификаторДокументооборота", ИдентификаторДокументооборота);
	Запрос.УстановитьПараметр("ПричинаОстановки", Перечисления.ПричиныОстановкиЭДО.ОшибкаПередачиНеблокирующая);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Действие = Перечисления.ДействияПоЭДО.Загрузить;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ВозобновитьДокумент(Выборка.ЭлектронныйДокумент, Действие, КонтекстДиагностики);
	КонецЦикла;
	
КонецПроцедуры

// См. СинхронизацияЭДОСобытия.ПриИзмененииСтатусаТранспортногоКонтейнера
Процедура ПриИзмененииСтатусаТранспортногоКонтейнера(Контейнер, НовыйСтатус, КонтекстДиагностики) Экспорт
	
	Если НовыйСтатус <> Перечисления.СтатусыТранспортныхСообщенийБЭД.Отменен
		ИЛИ ВыполнениеДействийПоЭДОЗапрещено(КонтекстДиагностики) Тогда
		Возврат;
	КонецЕсли;
	
	НаборСообщений = СинхронизацияЭДО.ОбъектыТранспортногоКонтейнера(Контейнер);
	
	ОтменитьОтправку(НаборСообщений, КонтекстДиагностики);
	
КонецПроцедуры

// См. НастройкиЭДОСобытия.ПередИзменениемИспользованияУтверждения
Процедура ПередИзменениемИспользованияУтверждения(ИспользоватьУтверждение, КонтекстДиагностики, Отказ) Экспорт
	
	Если ИспользоватьУтверждение Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.Состояние = &СостояниеУтвеждение";
	Запрос.УстановитьПараметр("СостояниеУтвеждение", Перечисления.СостоянияСообщенийЭДО.Утверждение);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не СнятьСУтверждения(Выборка.Ссылка, ИспользоватьУтверждение, КонтекстДиагностики) Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Событие возникает при установки /снятии пометки удаления электронного документа.
// 
// Параметры:
// 	ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - Ссылка на электронный документ.
// 	ПометкаУдаления - Булево - признак установки / снятия пометки.
// 	Отказ - Булево - признак отказа от установки пометки удаления.
Процедура ПриУстановкеПометкиУдаленияДокумента(ЭлектронныйДокумент, ПометкаУдаления, Отказ) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Документ.СообщениеЭДО");
	ЭлементБлокировки.УстановитьЗначение("ЭлектронныйДокумент", ЭлектронныйДокумент);
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Сообщение
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент";
	
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СообщениеОбъект = Выборка.Сообщение.ПолучитьОбъект();
		Если СообщениеОбъект.ПометкаУдаления <> ПометкаУдаления Тогда
			СообщениеОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
		КонецЕсли;
	КонецЦикла;
	
	ЭлектронныеДокументыЭДОСобытия.ПриУстановкеПометкиУдаленияДокумента(ЭлектронныйДокумент, ПометкаУдаления, Отказ);
	
КонецПроцедуры

// Событие возникает перед непосредственным удалением электронного документа из базы данных.
// 
// Параметры:
// 	ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - Ссылка на электронный документ.
// 	Отказ - Булево - признак отказа от удаления электронного документа.
Процедура ПередУдалениемДокумента(ЭлектронныйДокумент, Отказ) Экспорт
	
	ЭлектронныеДокументыЭДОСобытия.ПередУдалениемДокумента(ЭлектронныйДокумент, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область Интеграция

#Область РаботаСФайлами

// См. РаботаСФайламиПереопределяемый.ПриОпределенииНастроек.
//
Процедура ПриОпределенииНастроекФайлов(Настройки) Экспорт
	
	Настройки.НеОчищатьФайлы.Добавить(Метаданные.Справочники["СообщениеЭДОПрисоединенныеФайлы"]);
	Настройки.НеСинхронизироватьФайлы.Добавить(Метаданные.Справочники["СообщениеЭДОПрисоединенныеФайлы"]);
	Настройки.НеВыводитьВИнтерфейс.Добавить(Метаданные.Справочники["СообщениеЭДОПрисоединенныеФайлы"]);

КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. ОбменСКонтрагентамиИнтеграцияСобытия.ПриЗаполненииСписковСОграничениемДоступа
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.ЭлектронныйДокументВходящийЭДО, Истина);
	Списки.Вставить(Метаданные.Документы.ЭлектронныйДокументИсходящийЭДО, Истина);
	Списки.Вставить(Метаданные.Документы.СообщениеЭДО, Истина);
	Списки.Вставить(Метаданные.Справочники.СообщениеЭДОПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЖурналДействийПоЭДО, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СостоянияДокументовЭДО, Истина);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиИнтеграцияСобытия.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|Документ.ЭлектронныйДокументВходящийЭДО.Чтение.Организации
	|Документ.ЭлектронныйДокументИсходящийЭДО.Чтение.Организации
	|Документ.СообщениеЭДО.Чтение.Организации
	|Справочник.СообщениеЭДОПрисоединенныеФайлы.Чтение.Организации
	|РегистрСведений.ЖурналДействийПоЭДО.Чтение.Организации
	|РегистрСведений.СостоянияДокументовЭДО.Чтение.Организации
	|";
	
КонецПроцедуры

#КонецОбласти

#Область ПоставляемыеДанные

// См. ПоставляемыеДанныеПереопределяемый.ПолучитьОбработчикиПоставляемыхДанных 
Процедура ПриРегистрацииОбработчиковПоставляемыхДанных(Обработчики) Экспорт
	
	ФорматыЭДО.ПриРегистрацииОбработчиковПоставляемыхДанных(Обработчики);
	
КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияБРОЭДО

// Возвращает данные файлов основного титула, ответного титула и подписей к ним 
// для указанных объектов учета с завершенным документооборотом. Данные получаются только для документов
// следующих типов:
// УПД, СчетФактура, ТоварнаяНакладная, АктВыполненныхРабот, АктНаПередачуПрав,
// УКД, КорректировочныйСчетФактура, СоглашениеОбИзмененииСтоимости,
// АктОРасхождениях.
//
// Параметры:
//  ОбъектыУчета - Массив из Ссылка - ссылки на объекты учета.
//  УникальныйИдентификатор - УникальныйИдентификатор - для данных помещаемых во временное хранилище.
//
// Возвращаемое значение:
//  Соотвествие - Данные файлов по объектам учета:
//    * Ключ - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - объект учета, переданный в параметре ОбъектыУчета.
//    * Значение - Массив из Структура - Данные файлов:
//     ** Тип - Строка - тип файла. Возможные значения "ОсновнойТитул", "ОтветныйТитул",
//                       "ОсновнаяПодпись", "ОтветнаяПодпись".
//     ** КНД - Строка - КНД документа. Пустая строка для типов "ОсновнаяПодпись" и "ОтветнаяПодпись". 
//     ** Данные - Строка - адрес во временном хранилище с двоичными данными файла.
//     ** Имя - Строка - имя файла с расширением.
//
Функция ДанныеФайловЭлектронныхДокументовДляВыгрузкиВФНС(Знач ОбъектыУчета, Знач УникальныйИдентификатор) Экспорт
	
	ДанныеФайловПоОбъектамУчета = Новый Соответствие;
	
	ТипыДокументовОтбор = Новый Массив;
	ТипыДокументовОтбор.Добавить(Перечисления.ТипыДокументовЭДО.УПД);
	ТипыДокументовОтбор.Добавить(Перечисления.ТипыДокументовЭДО.СчетФактура);
	ТипыДокументовОтбор.Добавить(Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная);
	ТипыДокументовОтбор.Добавить(Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот);
	ТипыДокументовОтбор.Добавить(Перечисления.ТипыДокументовЭДО.АктНаПередачуПрав);
	ТипыДокументовОтбор.Добавить(Перечисления.ТипыДокументовЭДО.УКД);
	ТипыДокументовОтбор.Добавить(Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура);
	ТипыДокументовОтбор.Добавить(Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости);
	ТипыДокументовОтбор.Добавить(Перечисления.ТипыДокументовЭДО.АктОРасхождениях);
	
	ТипыЭлементовРегламентаОтбор = Новый Массив;
	ТипыЭлементовРегламентаОтбор.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);
	ТипыЭлементовРегламентаОтбор.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя);
	
	РезультатЗапроса = РезультатЗапросаДанныхДляВыгрузкиВФНС(ОбъектыУчета, ТипыДокументовОтбор, ТипыЭлементовРегламентаОтбор);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ДанныеФайловПоОбъектамУчета;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		КНД = ФорматыЭДО.КНДПоИмениФайлаФНС(Выборка.ПолноеИмяФайла);
		Если ПустаяСтрока(КНД) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеФайлов = ДанныеФайловПоОбъектамУчета[Выборка.ОбъектУчета];
		Если ДанныеФайлов = Неопределено Тогда
			ДанныеФайлов = Новый Массив;
			ДанныеФайловПоОбъектамУчета.Вставить(Выборка.ОбъектУчета, ДанныеФайлов);
		КонецЕсли;
		
		ДанныеФайла = НовыеДанныеФайлаДляВыгрузкиВФНС();
		
		Если Выборка.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя Тогда
			ДанныеФайла.Тип = "ОсновнойТитул";
			ТипПодписи = "ОсновнаяПодпись";
		Иначе
			ДанныеФайла.Тип = "ОтветныйТитул";
			ТипПодписи = "ОтветнаяПодпись";
		КонецЕсли;
		
		ДанныеФайла.КНД = КНД;
		ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Файл);
		ДанныеФайла.Данные = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, УникальныйИдентификатор);
		ДанныеФайла.Имя = Выборка.ПолноеИмяФайла;
		ДанныеФайлов.Добавить(ДанныеФайла);
		
		УстановленныеПодписи = ЭлектроннаяПодпись.УстановленныеПодписи(Выборка.Файл);
		Для Каждого СвойстваПодписи Из УстановленныеПодписи Цикл
			ДанныеФайлов = ДанныеФайловПоОбъектамУчета[Выборка.ОбъектУчета];
			ДанныеФайла = НовыеДанныеФайлаДляВыгрузкиВФНС();
			ДанныеФайла.КНД = КНД;
			ДанныеФайла.Тип = ТипПодписи;
			ДанныеФайла.Данные = ПоместитьВоВременноеХранилище(СвойстваПодписи.Подпись, УникальныйИдентификатор);
			Если ЗначениеЗаполнено(СвойстваПодписи.ИмяФайлаПодписи) Тогда
				ДанныеФайла.Имя = СвойстваПодписи.ИмяФайлаПодписи;
			Иначе
				ДанныеФайла.Имя = ИмяФайлаПодписи(Выборка.ПолноеИмяФайла, СвойстваПодписи.ПорядковыйНомер);
			КонецЕсли;
			ДанныеФайлов.Добавить(ДанныеФайла);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ДанныеФайловПоОбъектамУчета;
	
КонецФункции

// Возвращает свойства основного титула для объектов учета с завершенным документооборотом.
// Данные получаются только для документов следующих типов: 
// УПД, СчетФактура, ТоварнаяНакладная, АктВыполненныхРабот, АктНаПередачуПрав,
// УКД, КорректировочныйСчетФактура, СоглашениеОбИзмененииСтоимости,
// АктОРасхождениях.
//
// Параметры:
//  ОбъектыУчета - Массив из Ссылка - ссылки на объекты учета.
//
// Возвращаемое значение:
//  ТаблицаЗначений - свойства документов. Колонки:
//    * ОбъектУчета - ДокументСсылка - объект учета, переданный в параметре ОбъектыУчета.
//    * Тип - ПеречислениеСсылка.ТипыДокументовЭДО - тип документа.
//    * КНД - Строка - КНД основного титула.  
//
Функция СвойстваЭлектронныхДокументовДляВыгрузкиВФНС(Знач ОбъектыУчета) Экспорт
	
	СвойстваДокументов = Новый ТаблицаЗначений;
	СвойстваДокументов.Колонки.Добавить("ОбъектУчета", ИнтеграцияЭДО.ОписаниеТиповОснованийЭлектронныхДокументов());
	СвойстваДокументов.Колонки.Добавить("Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыДокументовЭДО"));
	СвойстваДокументов.Колонки.Добавить("КНД", Новый ОписаниеТипов("Строка"));
	
	ТипыДокументовОтбор = Новый Массив;
	ТипыДокументовОтбор.Добавить(Перечисления.ТипыДокументовЭДО.УПД);
	ТипыДокументовОтбор.Добавить(Перечисления.ТипыДокументовЭДО.СчетФактура);
	ТипыДокументовОтбор.Добавить(Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная);
	ТипыДокументовОтбор.Добавить(Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот);
	ТипыДокументовОтбор.Добавить(Перечисления.ТипыДокументовЭДО.АктНаПередачуПрав);
	ТипыДокументовОтбор.Добавить(Перечисления.ТипыДокументовЭДО.УКД);
	ТипыДокументовОтбор.Добавить(Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура);
	ТипыДокументовОтбор.Добавить(Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости);
	ТипыДокументовОтбор.Добавить(Перечисления.ТипыДокументовЭДО.АктОРасхождениях);
	
	ТипыЭлементовРегламентаОтбор = Новый Массив;
	ТипыЭлементовРегламентаОтбор.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);
	
	РезультатЗапроса = РезультатЗапросаДанныхДляВыгрузкиВФНС(ОбъектыУчета, ТипыДокументовОтбор, ТипыЭлементовРегламентаОтбор);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СвойстваДокументов;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		КНД = ФорматыЭДО.КНДПоИмениФайлаФНС(Выборка.ПолноеИмяФайла);
		Если ПустаяСтрока(КНД) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = СвойстваДокументов.Добавить();
		НоваяСтрока.ОбъектУчета = Выборка.ОбъектУчета;
		НоваяСтрока.Тип = Выборка.ТипДокумента;
		НоваяСтрока.КНД = КНД;
		
	КонецЦикла;
	
	Возврат СвойстваДокументов;
	
КонецФункции

#КонецОбласти

#Область ОбновлениеКонфигурации

// См. ЭлектронноеВзаимодействие.ПриДобавленииОбработчиковОбновления.
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

#Область Версия_1_9_1

#Область Справочники_СообщениеЭДОПрисоединенныеФайлы_ОбработатьДанныеДляПереходаНаНовуюВерсию

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.9.1.1";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "Справочники.СообщениеЭДОПрисоединенныеФайлы.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("02be62d0-c9e3-4f2b-a938-7587178a649c");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Справочники.СообщениеЭДОПрисоединенныеФайлы.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.ЧитаемыеОбъекты = "Справочник.ВидыДокументовЭДО,"
		+ "Справочник.СообщениеЭДОПрисоединенныеФайлы";
	Обработчик.ИзменяемыеОбъекты = "Справочник.ВидыДокументовЭДО,"
		+ "Документ.СообщениеЭДО,"
		+ "Справочник.СообщениеЭДОПрисоединенныеФайлы";
	Обработчик.БлокируемыеОбъекты = "Справочник.ВидыДокументовЭДО,"
		+ "Справочник.СообщениеЭДОПрисоединенныеФайлы";
	Обработчик.Комментарий = НСтр("ru = '1С:Обмен с контрагентами: изменение параметров справочника Присоединенные файлы (Электронные документы).
	|Настройка и обмен электронными документами с контрагентами временно невозможен.'");
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Справочники.ВидыДокументовЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ЭлектронныйДокументВходящийЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ЭлектронныйДокументИсходящийЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

#КонецОбласти

#Область Справочники_ВидыДокументовЭДО_ОбработатьДанныеДляПереходаНаНовуюВерсию

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.9.1.16";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "Справочники.ВидыДокументовЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("009a7d70-3a90-43f9-87b2-10a776b5298a");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Справочники.ВидыДокументовЭДО.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.ЧитаемыеОбъекты = "Справочник.ВидыДокументовЭДО";
	Обработчик.ИзменяемыеОбъекты = "Справочник.ВидыДокументовЭДО";
	Обработчик.БлокируемыеОбъекты = "Справочник.ВидыДокументовЭДО";
	Обработчик.Комментарий = НСтр("ru = '1С:Обмен с контрагентами: изменение параметров справочника Виды документов ЭДО.
		|Настройка и обмен электронными документами с контрагентами временно невозможен.'");
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Справочники.СообщениеЭДОПрисоединенныеФайлы.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ЭлектронныйДокументВходящийЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ЭлектронныйДокументИсходящийЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

#КонецОбласти

#Область Документы_ЭлектронныйДокументВходящий_ОбработатьДанныеДляПереходаНаНовуюВерсию

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.9.1.1";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "Документы.ЭлектронныйДокументВходящийЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("dcafb44d-22d0-431a-aa23-995aa699a07b");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Документы.ЭлектронныйДокументВходящийЭДО.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.ЧитаемыеОбъекты = "Документ.ЭлектронныйДокументВходящийЭДО,"
		+ "РегистрСведений.УдалитьЖурналСобытийЭД,"
		+ "РегистрСведений.ПростыеЭлектронныеПодписи,"
		+ "РегистрСведений.ЭлектронныеПодписи,"
		+ "Справочник.УдалитьСоглашенияОбИспользованииЭД,"
		+ "Справочник.СообщениеЭДОПрисоединенныеФайлы,"
		+ "Документ.СообщениеЭДО";
	Обработчик.ИзменяемыеОбъекты = "Документ.ЭлектронныйДокументВходящийЭДО,"
		+ "РегистрСведений.ЖурналДействийПоЭДО,"
		+ "РегистрСведений.СостоянияДокументовЭДО";
	Обработчик.БлокируемыеОбъекты = "Документ.ЭлектронныйДокументВходящийЭДО";
	Обработчик.Комментарий = НСтр("ru = '1С:Обмен с контрагентами: обновление входящих электронных документов.'");
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РаботаСФайлами.ПеренестиЭлектронныеПодписиИСертификатыШифрованияВРегистрыСведений";
	НоваяСтрока.Порядок = "После";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Справочники.СообщениеЭДОПрисоединенныеФайлы.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";
	
#КонецОбласти

#Область Документы_ЭлектронныйДокументИсходящийЭДО_ОбработатьДанныеДляПереходаНаНовуюВерсию

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.9.1.1";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "Документы.ЭлектронныйДокументИсходящийЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a98bca9f-e5d2-42b9-9f0f-29a1aa2d4108");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Документы.ЭлектронныйДокументИсходящийЭДО.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.ЧитаемыеОбъекты = "Документ.ЭлектронныйДокументИсходящийЭДО,"
		+ "РегистрСведений.УдалитьЖурналСобытийЭД,"
		+ "РегистрСведений.ОператорыЭДО,"
		+ "РегистрСведений.ПростыеЭлектронныеПодписи,"
		+ "РегистрСведений.ЭлектронныеПодписи,"
		+ "Справочник.УдалитьПрофилиНастроекЭДО,"
		+ "Справочник.УдалитьСоглашенияОбИспользованииЭД,"
		+ "Справочник.СообщениеЭДОПрисоединенныеФайлы,"
		+ "Документ.СообщениеЭДО";
	Обработчик.ИзменяемыеОбъекты = "Документ.ЭлектронныйДокументИсходящийЭДО,"
		+ "РегистрСведений.ЖурналДействийПоЭДО,"
		+ "РегистрСведений.СостоянияДокументовЭДО";
	Обработчик.БлокируемыеОбъекты = "Документ.ЭлектронныйДокументИсходящийЭДО";
	Обработчик.Комментарий = НСтр("ru = '1С:Обмен с контрагентами: обновление исходящих электронных документов.'");
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Справочники.УдалитьСоглашенияОбИспользованииЭД.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Справочники.СообщениеЭДОПрисоединенныеФайлы.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РаботаСФайлами.ПеренестиЭлектронныеПодписиИСертификатыШифрованияВРегистрыСведений";
	НоваяСтрока.Порядок = "После";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ЭлектронныйДокументВходящийЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "Любой";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыСведений.ОператорыЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

#КонецОбласти

#Область РегистрыСведений_ФорматыЭлектронныхДокументов_ОбработатьДанныеДляПереходаНаНовуюВерсию

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.9.1.1";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "РегистрыСведений.ФорматыЭлектронныхДокументов.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("e1d44da2-5bec-4bd0-afa4-232aeed30114");
	Обработчик.Многопоточный = Ложь;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "ЭлектронноеВзаимодействие.ЗаполнениеДанныхОбновления";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.ЧитаемыеОбъекты = "РегистрСведений.ФорматыЭлектронныхДокументов";
	Обработчик.ИзменяемыеОбъекты = "РегистрСведений.ФорматыЭлектронныхДокументов";
	Обработчик.Комментарий = НСтр("ru = '1С:Обмен с контрагентами: обновление форматов электронных документов.'");
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "РегистрыСведений.ФорматыЭлектронныхДокументов.ОбработатьДанныеДляПереходаНаНовуюВерсиюНачальноеЗаполнение";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("3949552a-560d-4633-b79a-be1462f0258e");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "ЭлектронноеВзаимодействие.ЗаполнениеДанныхОбновления";
	Обработчик.ОчередьОтложеннойОбработки = 1;
	Обработчик.ПроцедураПроверки = "";
	Обработчик.ЧитаемыеОбъекты = "";
	Обработчик.ИзменяемыеОбъекты = "";
	Обработчик.БлокируемыеОбъекты = "";
	Обработчик.Комментарий = НСтр("ru = '1С:Обмен с контрагентами: обновление форматов электронных документов (начальное заполнение).'");

#КонецОбласти

#Область РегистрыСведений_СвязьВидовИФорматовДокументовЭДО_ОбработатьДанныеДляПереходаНаНовуюВерсию

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.9.1.8";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "РегистрыСведений.СвязьВидовИФорматовДокументовЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("21bf758a-3393-42d6-9f78-d9e498236c7c");
	Обработчик.Многопоточный = Ложь;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "ЭлектронноеВзаимодействие.ЗаполнениеДанныхОбновления";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.ЧитаемыеОбъекты = "РегистрСведений.СвязьВидовИФорматовДокументовЭДО,
		|РегистрСведений.ФорматыЭлектронныхДокументов";
	Обработчик.ИзменяемыеОбъекты = "РегистрСведений.СвязьВидовИФорматовДокументовЭДО";
	Обработчик.Комментарий = НСтр("ru = '1С:Обмен с контрагентами: обновление связей видов и форматов электронных документов.'");
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыСведений.ФорматыЭлектронныхДокументов.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "РегистрыСведений.СвязьВидовИФорматовДокументовЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсиюНачальноеЗаполнение";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0824dea2-1398-4cfd-96f9-a504682db8ed");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "ЭлектронноеВзаимодействие.ЗаполнениеДанныхОбновления";
	Обработчик.ОчередьОтложеннойОбработки = 1;
	Обработчик.ПроцедураПроверки = "";
	Обработчик.ЧитаемыеОбъекты = "";
	Обработчик.ИзменяемыеОбъекты = "";
	Обработчик.БлокируемыеОбъекты = "";
	Обработчик.Комментарий = НСтр("ru = '1С:Обмен с контрагентами: обновление связей видов и форматов электронных документов (начальное заполнение).'");

#КонецОбласти

#Область РегистрыСведений_СостояниеПодписанияЭД_ОбработатьДанныеДляПереходаНаНовуюВерсию

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыСведений.СостояниеПодписанияЭД.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "1.9.1.1";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("1974edaa-f51d-4a7c-8c8e-585eeb26e2ab");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.СостояниеПодписанияЭД.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = '1С:БЭД: обновление состояний подписания электронных документов'");
	Обработчик.ЧитаемыеОбъекты = "РегистрСведений.СостояниеПодписанияЭД,"
		+ "Справочник.СообщениеЭДОПрисоединенныеФайлы";
	Обработчик.ИзменяемыеОбъекты = "РегистрСведений.СостояниеПодписанияЭД";
	Обработчик.БлокируемыеОбъекты = "РегистрСведений.СостояниеПодписанияЭД";
	
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Справочники.СообщениеЭДОПрисоединенныеФайлы.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

#КонецОбласти

#КонецОбласти
	
	ФорматыЭДО.ПриДобавленииОбработчиковОбновления(Обработчики);	 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Обновление

Функция Обновление_ТипДокументаПоНовойАрхитекртуре(ТипДокументаДоОбновления) Экспорт
	
	ТипДокумента = ТипДокументаДоОбновления;
	Если ТипДокументаДоОбновления = Перечисления.ТипыДокументовЭДО.УдалитьАктЗаказчик
		ИЛИ ТипДокументаДоОбновления = Перечисления.ТипыДокументовЭДО.УдалитьАктИсполнитель Тогда
		ТипДокумента = Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот;
	ИначеЕсли ТипДокументаДоОбновления = Перечисления.ТипыДокументовЭДО.УдалитьСоглашениеОбИзмененииСтоимостиПолучатель Тогда
		ТипДокумента = Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости;
	ИначеЕсли ТипДокументаДоОбновления = Перечисления.ТипыДокументовЭДО.УдалитьТОРГ12
		ИЛИ ТипДокументаДоОбновления = Перечисления.ТипыДокументовЭДО.УдалитьТОРГ12Покупатель Тогда
		ТипДокумента = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная;
	КонецЕсли;
	
	Возврат ТипДокумента;
	
КонецФункции

Функция Обновление_ВыборкаСообщенийДляЗаменыОбъектовВСостоянииПодписания(ВыбранныеДанные) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВыбранныеДанные.Объект КАК Объект
		|ПОМЕСТИТЬ ВыбранныеДанные
		|ИЗ
		|	&ВыбранныеДанные КАК ВыбранныеДанные
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыбранныеДанные.Объект КАК Объект,
		|	ПрисоединенныеФайлы.ВладелецФайла КАК Сообщение
		|ИЗ
		|	ВыбранныеДанные КАК ВыбранныеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|		ПО ВыбранныеДанные.Объект = ПрисоединенныеФайлы.Ссылка";
	Запрос.УстановитьПараметр("ВыбранныеДанные", ВыбранныеДанные);
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроверкаПрав

Функция ВыполнениеДействийПоЭДОЗапрещено(КонтекстДиагностики = Неопределено)
	
	Если Не НастройкиЭДО.ИспользуетсяОбменЭлектроннымиДокументами(КонтекстДиагностики)
		ИЛИ Не ЕстьПравоОбработкиДокументов(КонтекстДиагностики)
		ИЛИ ИнтеграцияБСПБЭД.ПользовательНедействителен(КонтекстДиагностики) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Возвращает ошибку диагностики при отсутствии прав на обработку электронных документов.
// 
// Возвращаемое значение:
// 	Строка - идентификатор ошибки.
Функция ВидОшибкиНетПравНаОбработкуДокументов()
	
	ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.НовоеОписаниеВидаОшибки();
	ВидОшибки.Идентификатор = "НетПравНаОбработкуДокументов";
	ВидОшибки.ЗаголовокПроблемы = НСтр("ru = 'Не удалось выполнить действие по ЭДО'");
	ВидОшибки.ОписаниеПроблемы = НСтр("ru = 'Нет прав для выполнения действий по ЭДО'");
	ВидОшибки.ОписаниеРешения = НСтр("ru = 'Обратитесь к администратору'");
	
	Возврат ВидОшибки;
	
КонецФункции

#КонецОбласти

#Область ТипыДокументов

// Типы документов прямого обмена для фильтрации в алгоритмах.
// 
// Возвращаемое значение:
// 	Соответствие из КлючИЗначение:
// 	* Ключ - ПеречислениеСсылка.ТипыДокументовЭДО - Тип электронного документа.
// 	* Значение - Булево - Признак типа прямого обмена.
//
Функция ТипыДокументовПрямогоОбмена()
	
	ТипыДокументов = Новый Массив;
	
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.АктНаПередачуПрав);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.АктОРасхождениях);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.ЗаказТовара);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.ЗапросКоммерческихПредложений);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.КаталогТоваров);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.КоммерческоеПредложение);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.ОтветНаЗаказ);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.ОтчетОПродажахКомиссионногоТовара);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.ОтчетОСписанииКомиссионногоТовара);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.ПрайсЛист);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.СчетНаОплату);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.КаталогТоваров);
	
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.Прикладной);
	
	Возврат ТипыДокументов;
	
КонецФункции

// Типы документов прямого обмена для фильтрации в алгоритмах.
// 
// Возвращаемое значение:
// 	Соответствие из КлючИЗначение:
// 	* Ключ - ПеречислениеСсылка.ТипыДокументовЭДО - Тип электронного документа.
// 	* Значение - Булево - Признак типа прямого обмена.
//
Функция ТипыДокументовИнтеркампани()
	
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.ВозвратТоваровМеждуОрганизациями);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.ПередачаТоваровМеждуОрганизациями);
	Возврат ТипыДокументов;
	
КонецФункции

Функция ТипВидаДокументаСоотвествуетТипу(ВидДокумента, ТипДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИСТИНА КАК Выбран
		|ИЗ
		|	Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|ГДЕ
		|	ВидыДокументовЭДО.Ссылка = &Ссылка
		|	И ВидыДокументовЭДО.ТипДокумента = &ТипДокумента";
	
	Запрос.УстановитьПараметр("Ссылка", ВидДокумента);
	Запрос.УстановитьПараметр("ТипДокумента", ТипДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция КраткоеНаименованиеТипаДокумента(ТипДокумента)
	
	Наименование = "";
	
	Если ТипДокумента = Перечисления.ТипыДокументовЭДО.УПД Тогда
		Наименование = НСтр("ru = 'УПД'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.УКД Тогда
		Наименование = НСтр("ru = 'УКД'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.АктСверки Тогда
		Наименование = НСтр("ru = 'Сверка'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.АктНаПередачуПрав Тогда
		Наименование = НСтр("ru = 'Акт ПП'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот Тогда
		Наименование = НСтр("ru = 'Акт'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.АктОРасхождениях Тогда
		Наименование = НСтр("ru = 'Расхождения'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная
		ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.ПередачаТоваровМеждуОрганизациями Тогда
		Наименование = НСтр("ru = 'Накладная'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетФактура Тогда
		Наименование = НСтр("ru = 'СФ'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости Тогда
		Наименование = НСтр("ru = 'Корректировка'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура Тогда
		Наименование = НСтр("ru = 'Кор. СФ'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.КаталогТоваров Тогда
		Наименование = НСтр("ru = 'Каталог'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетНаОплату Тогда
		Наименование = НСтр("ru = 'Счет'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ПрайсЛист Тогда
		Наименование = НСтр("ru = 'Прайс'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ЗаказТовара Тогда
		Наименование = НСтр("ru = 'Заказ'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ОтветНаЗаказ Тогда
		Наименование = НСтр("ru = 'Заказ покупателя'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.АктВзаимозачета Тогда
		Наименование = НСтр("ru = 'Взаимозачет'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ГарантийноеПисьмо Тогда
		Наименование = НСтр("ru = 'Гар. письмо'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ДополнительноеСоглашение Тогда
		Наименование = НСтр("ru = 'Доп. согл.'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ПлатежноеПоручение Тогда
		Наименование = НСтр("ru = 'Пл. поруч.'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ПриложениеКАкту Тогда
		Наименование = НСтр("ru = 'Акт (прил.)'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.СоглашениеОбЭДО Тогда
		Наименование = НСтр("ru = 'Соглашение'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ИзвещениеОПолучении Тогда
		Наименование = НСтр("ru = 'Извещение'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ПредложениеОбАннулировании Тогда
		Наименование = НСтр("ru = 'ПОА'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.УведомлениеОбУточнении Тогда
		Наименование = НСтр("ru = 'УОУ'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ОтчетОПродажахКомиссионногоТовара Тогда
		Наименование = НСтр("ru = 'Продажа (комиссия)'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ОтчетОСписанииКомиссионногоТовара Тогда
		Наименование = НСтр("ru = 'Списание (комиссия)'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ВозвратТоваровМеждуОрганизациями Тогда
		Наименование = НСтр("ru = 'Возврат'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ЗапросКоммерческихПредложений Тогда
		Наименование = НСтр("ru = 'Запрос ком. пред.'");
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ПодтверждениеОператораЭДО Тогда
		Наименование = НСтр("ru = 'Подтв. оператора'");
	Иначе
		Наименование = Строка(ТипДокумента);
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции

// Возвращает приоритет типа при отображении в списках.
// 
// Параметры:
// 	ТипДокумента - ПеречислениеСсылка.ТипыДокументовЭДО - Тип электронного документа.
// Возвращаемое значение:
// 	Число - приоритет отображения типа электронного документа.
Функция ПриоритетТипаДокументаПриОтображенииВСписке(ТипДокумента)
	
	Приоритет = 100;
	
	Если ТипДокумента = Перечисления.ТипыДокументовЭДО.АктНаПередачуПрав Тогда
		Приоритет = 1;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот Тогда
		Приоритет = 2;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная Тогда
		Приоритет = 3;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетФактура Тогда
		Приоритет = 4;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.УПД Тогда
		Приоритет = 5;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.УКД Тогда
		Приоритет = 6;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости Тогда
		Приоритет = 7;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура Тогда
		Приоритет = 8;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.КаталогТоваров Тогда
		Приоритет = 9;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетНаОплату Тогда
		Приоритет = 10;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ПрайсЛист Тогда
		Приоритет = 11;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ЗаказТовара Тогда
		Приоритет = 12;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ОтветНаЗаказ Тогда
		Приоритет = 13;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.АктВзаимозачета Тогда
		Приоритет = 14;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.АктСверки Тогда
		Приоритет = 15;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.Ведомость Тогда
		Приоритет = 16;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ГарантийноеПисьмо Тогда
		Приоритет = 17;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.Договор Тогда
		Приоритет = 18;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ДополнительноеСоглашение Тогда
		Приоритет = 19;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.КС11 Тогда
		Приоритет = 20;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.КС2 Тогда
		Приоритет = 21;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.КС3 Тогда
		Приоритет = 22;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.Отчет Тогда
		Приоритет = 23;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ПлатежноеПоручение Тогда
		Приоритет = 24;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ПриложениеКАкту Тогда
		Приоритет = 25;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.Прочее Тогда
		Приоритет = 26;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.СоглашениеОбЭДО Тогда
		Приоритет = 27;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.Спецификация Тогда
		Приоритет = 28;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.Уведомление Тогда
		Приоритет = 29;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ЗапросКоммерческихПредложений Тогда
		Приоритет = 30;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.АктОРасхождениях Тогда
		Приоритет = 31;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.Прикладной Тогда
		Приоритет = 40;
	КонецЕсли;
	
	Возврат Приоритет;
	
КонецФункции

// Возвращает группу типа при отображении в списках.
// 
// Параметры:
// 	ТипДокумента - ПеречислениеСсылка.ТипыДокументовЭДО - Тип электронного документа.
// Возвращаемое значение:
// 	Строка - приоритет отображения типа электронного документа.
Функция ПараметрыГруппыТипаДокументаПриОтображенииВСписке(ТипДокумента)
	
	Параметры = Новый Структура;
	Параметры.Вставить("Группа", "");
	Параметры.Вставить("ПриоритетГруппы", 0);
	
	Если ТипДокумента = Перечисления.ТипыДокументовЭДО.АктНаПередачуПрав 
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот 
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная 
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетФактура
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.УПД
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.УКД
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.ОтчетОСписанииКомиссионногоТовара
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.ОтчетОПродажахКомиссионногоТовара
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.АктОРасхождениях Тогда
		Параметры.Группа = НСтр("ru = 'Первичные документы'");
		Параметры.ПриоритетГруппы = 1;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.КаталогТоваров
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетНаОплату
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.ПрайсЛист
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.ЗаказТовара
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.ОтветНаЗаказ
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.ЗапросКоммерческихПредложений
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.КоммерческоеПредложение
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.Прикладной Тогда
		Параметры.Группа = НСтр("ru = 'Оперативные документы'");
		Параметры.ПриоритетГруппы = 2;
	Иначе
		Параметры.Группа = НСтр("ru = 'Прочие'");
		Параметры.ПриоритетГруппы = 3;
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

Функция ЭтоИсправляющийТипДокумента(ТипДокумента)
	Возврат ТипДокумента = Перечисления.ТипыДокументовЭДО.УПД
		ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная
		ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот
		ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.АктНаПередачуПрав
		ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетФактура;
КонецФункции

Функция ЭтоКорректирующийТипДокумента(ТипДокумента)
	Возврат ТипДокумента = Перечисления.ТипыДокументовЭДО.УКД
		ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости
		ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура
КонецФункции

Функция КорректируемыеТипыДокументов()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Перечисления.ТипыДокументовЭДО.УПД, Перечисления.ТипыДокументовЭДО.УКД);
	Результат.Вставить(Перечисления.ТипыДокументовЭДО.УПД, Перечисления.ТипыДокументовЭДО.УКД);
	
	Результат.Вставить(Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная,
		Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости);
	Результат.Вставить(Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот,
		Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости);
	Результат.Вставить(Перечисления.ТипыДокументовЭДО.АктНаПередачуПрав,
		Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости);
	Результат.Вставить(Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости,
		Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости);
	
	Результат.Вставить(Перечисления.ТипыДокументовЭДО.СчетФактура,
		Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура);
	Результат.Вставить(Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура,
		Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура);
	
	Возврат Результат;
	
КонецФункции

Функция ПорядокСортировкиВПакете(ТипДокумента) Экспорт
	Порядок = 100;
	Если ТипДокумента = Перечисления.ТипыДокументовЭДО.УПД Тогда Порядок = 1;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.УКД Тогда Порядок = 2;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная Тогда Порядок = 3;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот Тогда Порядок = 4;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.АктНаПередачуПрав Тогда Порядок = 5;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости Тогда Порядок = 6;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетФактура Тогда Порядок = 7;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура Тогда Порядок = 8;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.АктОРасхождениях Тогда Порядок = 9;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ОтчетОПродажахКомиссионногоТовара Тогда Порядок = 10;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ОтчетОСписанииКомиссионногоТовара Тогда Порядок = 11;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.Прикладной Тогда Порядок = 12;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.КаталогТоваров Тогда Порядок = 13;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетНаОплату Тогда Порядок = 14;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ЗаказТовара Тогда Порядок = 15;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ОтветНаЗаказ Тогда Порядок = 16;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ЗапросКоммерческихПредложений Тогда Порядок = 17;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.КоммерческоеПредложение Тогда Порядок = 18;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.АктВзаимозачета Тогда Порядок = 19;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.АктСверки Тогда Порядок = 20;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.Ведомость Тогда Порядок = 21;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ГарантийноеПисьмо Тогда Порядок = 22;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.Договор Тогда Порядок = 23;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ДополнительноеСоглашение Тогда Порядок = 24;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.КС11 Тогда Порядок = 25;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.КС2 Тогда Порядок = 26;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.КС3 Тогда Порядок = 27;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.Отчет Тогда Порядок = 28;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ПлатежноеПоручение Тогда Порядок = 29;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ПриложениеКАкту Тогда Порядок = 30;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.СоглашениеОбЭДО Тогда Порядок = 31;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.Спецификация Тогда Порядок = 32;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.Уведомление Тогда Порядок = 33;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.Прочее Тогда Порядок = 34;
	КонецЕсли;
	Возврат Порядок;
КонецФункции

#КонецОбласти

#Область ВидыДокументов

Функция ВидыДокументовПоТипам(ТипыДокументов)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыДокументовЭДО.Ссылка КАК ВидДокумента,
		|	ВидыДокументовЭДО.ТипДокумента КАК ТипДокумента
		|ИЗ
		|	Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|ГДЕ
		|	ВидыДокументовЭДО.ТипДокумента В (&ТипыДокументов)";
	
	Запрос.УстановитьПараметр("ТипыДокументов", ТипыДокументов);
	
	ВидыДокументовПоТипам = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидыДокументовПоТипам.Вставить(Выборка.ТипДокумента, Выборка.ВидДокумента);
	КонецЦикла;
	
	Возврат ВидыДокументовПоТипам;
	
КонецФункции

Функция ВыгрузитьВидыДокументовПоТипам(ВидыДокументовПоТипам)
	ВидыДокументов = Новый Массив;
	Для Каждого ВидПоТипу Из ВидыДокументовПоТипам Цикл
		ВидыДокументов.Добавить(ВидПоТипу.Значение);
	КонецЦикла;
	Возврат ВидыДокументов;
КонецФункции

Функция НовыеПараметрыПоискаВидаДокумента(ТипДокумента)
	Параметры = Новый Структура;
	Параметры.Вставить("ТипДокумента", ТипДокумента);
	Параметры.Вставить("ПрикладнойТипДокумента", ИнтеграцияЭДО.ПустойПрикладнойТипЭлектронногоДокумента());
	Параметры.Вставить("ИдентификаторОбъектаУчета", ИнтеграцияБСПБЭД.ПустойИдентификаторОбъектаМетаданных());
	Параметры.Вставить("ИдентификаторКомандыПечати", "");
	Параметры.Вставить("ПредставлениеКомандыПечати", "");
	Возврат Параметры;
КонецФункции

Функция НайтиСоздатьВидДокумента(ПараметрыПоиска)
	
	ВидДокумента = НайтиВидДокумента(ПараметрыПоиска);
	Если Не ЗначениеЗаполнено(ВидДокумента) Тогда
		ВидДокумента = СоздатьВидДокумента(ПараметрыПоиска);
	КонецЕсли;
	
	Возврат ВидДокумента;
	
КонецФункции

Функция НайтиСоздатьВидыДокументов(ТипыДокументов)
	
	ВидыДокументовПоТипам = ВидыДокументовПоТипам(ТипыДокументов);
	
	Если ТипыДокументов.Количество() = ВидыДокументовПоТипам.Количество() Тогда
		Возврат ВидыДокументовПоТипам;
	КонецЕсли;
	
	Для Каждого ТипДокумента Из ТипыДокументов Цикл
		Если ВидыДокументовПоТипам[ТипДокумента] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ПараметрыПоиска = НовыеПараметрыПоискаВидаДокумента(ТипДокумента);
		ВидДокумента = СоздатьВидДокумента(ПараметрыПоиска);
		ВидыДокументовПоТипам.Вставить(ТипДокумента, ВидДокумента);
	КонецЦикла;
	
	Возврат ВидыДокументовПоТипам;
	
КонецФункции

Функция НайтиВидДокумента(ПараметрыПоиска)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыДокументовЭДО.Ссылка
		|ИЗ
		|	Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|ГДЕ
		|	ВидыДокументовЭДО.ТипДокумента = &ТипДокумента
		|	И ВидыДокументовЭДО.ПрикладнойТипДокумента = &ПрикладнойТипДокумента
		|	И ВидыДокументовЭДО.ИдентификаторКомандыПечати = &ИдентификаторКомандыПечати
		|	И ВидыДокументовЭДО.ИдентификаторОбъектаУчета = &ИдентификаторОбъектаУчета";
	
	Запрос.УстановитьПараметр("ТипДокумента", ПараметрыПоиска.ТипДокумента);
	Запрос.УстановитьПараметр("ПрикладнойТипДокумента", ПараметрыПоиска.ПрикладнойТипДокумента);
	Запрос.УстановитьПараметр("ИдентификаторОбъектаУчета", ПараметрыПоиска.ИдентификаторОбъектаУчета);
	Запрос.УстановитьПараметр("ИдентификаторКомандыПечати", ПараметрыПоиска.ИдентификаторКомандыПечати);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьВидДокумента(ПараметрыПоиска)
	
	ВидДокумента = Справочники.ВидыДокументовЭДО.ПустаяСсылка();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.ВидыДокументовЭДО");
	Если ПараметрыПоиска.ТипДокумента = Перечисления.ТипыДокументовЭДО.Прикладной Тогда
		ЭлементБлокировки.УстановитьЗначение("ПрикладнойТипДокумента", ПараметрыПоиска.ПрикладнойТипДокумента);
	ИначеЕсли ПараметрыПоиска.ТипДокумента = Перечисления.ТипыДокументовЭДО.Внутренний Тогда
		ЭлементБлокировки.УстановитьЗначение("ИдентификаторОбъектаУчета", ПараметрыПоиска.ИдентификаторОбъектаУчета);
		ЭлементБлокировки.УстановитьЗначение("ИдентификаторКомандыПечати", ПараметрыПоиска.ИдентификаторКомандыПечати);
	Иначе
		ЭлементБлокировки.УстановитьЗначение("ТипДокумента", ПараметрыПоиска.ТипДокумента);
	КонецЕсли;
	
	НачатьТранзакцию();
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Блокировка.Заблокировать();
		ВидДокумента = НайтиВидДокумента(ПараметрыПоиска);
		Если ЗначениеЗаполнено(ВидДокумента) Тогда
			ЗафиксироватьТранзакцию();
			Возврат ВидДокумента;
		КонецЕсли;
		
		НовыйЭлемент = Справочники.ВидыДокументовЭДО.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ПараметрыПоиска);
		ЗаполнитьНаименованиеВидаДокумента(НовыйЭлемент, ПараметрыПоиска.ПредставлениеКомандыПечати);
		НовыйЭлемент.ПорядокСортировкиВПакете = ПорядокСортировкиВПакете(ПараметрыПоиска.ТипДокумента);
		
		Если Не НовыйЭлемент.ПроверитьЗаполнение() Тогда
			ВызватьИсключение НСтр("ru = 'Ошибка заполнения нового вида документа'");
		КонецЕсли;
		
		НовыйЭлемент.Записать();
		ВидДокумента = НовыйЭлемент.Ссылка;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(НСтр("ru = 'Параметры поиска:'"));
		МассивСтрок.Добавить(ОбщегоНазначенияБЭДКлиентСервер.СтруктураВСтроку(ПараметрыПоиска,,Символы.ПС));
		МассивСтрок.Добавить(НСтр("ru = 'Описание ошибки:'"));
		МассивСтрок.Добавить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ТекстОшибки = СтрСоединить(МассивСтрок, Символы.ПС);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Поиск вида документа'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат ВидДокумента;
	
КонецФункции

// Возвращает виды документов связанные со стандартным форматом.
// 
// Параметры:
// 	Формат - Строка - Идентификатор формата.
// Возвращаемое значение:
// 	Массив из СправочникСсылка.ВидыДокументовЭДО - список видов по формату.
Функция ВидыДокументовПоФормату(Формат)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СвязьВидовИФорматовДокументовЭДО.ВидДокумента
		|ИЗ
		|	РегистрСведений.СвязьВидовИФорматовДокументовЭДО КАК СвязьВидовИФорматовДокументовЭДО
		|ГДЕ
		|	СвязьВидовИФорматовДокументовЭДО.Формат = &Формат";
	
	Запрос.УстановитьПараметр("Формат", Формат);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидДокумента");
	
КонецФункции

#КонецОбласти

#Область Настройки

Функция ТребуетсяОтветнаяПодписьПоУмолчанию(ТипДокумента)
	
	Результат = Ложь;
	
	Если Не (ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетФактура
		Или  ТипДокумента = Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура
		Или  ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетНаОплату
		Или  ТипДокумента = Перечисления.ТипыДокументовЭДО.КаталогТоваров
		Или  ТипДокумента = Перечисления.ТипыДокументовЭДО.ПрайсЛист
		Или  ТипДокумента = Перечисления.ТипыДокументовЭДО.АктОРасхождениях) Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТребуетсяИзвещениеПоУмолчанию(ТипДокумента)
	
	Результат = Ложь;
	
	Если Не (ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетФактура
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура) Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РедактироватьОтветнуюПодпись(ТипДокумента)
	
	Результат = Истина;
	
	Если ТипДокумента = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная Тогда
		
		Результат = Ложь;
		
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура
			Или ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетФактура Тогда
		
		Результат = Ложь;
		
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументовЭДО.ОтчетОПродажахКомиссионногоТовара
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.ОтчетОСписанииКомиссионногоТовара
		Или ТипДокумента = Перечисления.ТипыДокументовЭДО.АктОРасхождениях Тогда
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОписаниеСообщения

Функция ОписаниеСообщенияПолучателяПоОбъектуУчета(НаборОбъектовУчета, ДанныеОбъектаУчета, ПараметрыДокумента, СвойстваОсновногоФайла, Формат)
	
	ДанныеДляФормирования = ФорматыЭДО.НовыеДанныеДляФормированияОтветногоТитула();
	ДанныеДляФормирования.УникальныйИдентификатор = Строка(Новый УникальныйИдентификатор);
	ДанныеДляФормирования.ДанныеДокумента = ДанныеОбъектаУчета;
	ДанныеДляФормирования.Участники.ИдентификаторОтправителя = ПараметрыДокумента.ИдентификаторОрганизации;
	ДанныеДляФормирования.Участники.ИдентификаторПолучателя = ПараметрыДокумента.ИдентификаторКонтрагента;
	ДанныеДляФормирования.Участники.Оператор = СинхронизацияЭДО.СведенияОбОператоре(
		ПараметрыДокумента.ИдентификаторОрганизации);
	Файл = Новый Файл(СвойстваОсновногоФайла.ПолноеИмяФайла);
	ДанныеДляФормирования.Основание.ИмяБезРасширения = Файл.ИмяБезРасширения;
	ДанныеДляФормирования.Основание.ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(СвойстваОсновногоФайла.Ссылка);
	
	Подписи = ЭлектроннаяПодпись.УстановленныеПодписи(СвойстваОсновногоФайла.Ссылка);
	
	Если ЗначениеЗаполнено(Подписи) Тогда
		Для Каждого СвойстваПодписи Из Подписи Цикл
			ПодписьСтрокой = КриптографияБЭД.ДанныеПодписиВСтрокуБезПереносов(СвойстваПодписи.Подпись);
			ДанныеДляФормирования.ПодписиОснования.Добавить(ПодписьСтрокой);
		КонецЦикла;
	КонецЕсли;
	
	ДанныеСообщения = ФорматыЭДО.СформироватьДанныеОтветногоТитулаПоОбъектуУчета(НаборОбъектовУчета,
		Формат, ДанныеДляФормирования);
	
	ОписаниеСообщения = НовоеОписаниеСообщения();
	ОписаниеСообщения.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя;
	ОписаниеСообщения.ВидСообщения = ПараметрыДокумента.ВидДокумента;
	ОписаниеСообщения.Направление = Перечисления.НаправленияЭДО.Исходящий;
	ОписаниеСообщения.Данные = ДанныеСообщения;
	
	Возврат ОписаниеСообщения;
	
КонецФункции

Функция ОписаниеСлужебногоСообщения(ПараметрыДокумента, СвойстваФайлаОснования, ТипДокумента, ТипЭлементаРегламента, Комментарий = "")
	
	ДанныеДляФормирования = ФорматыЭДО.НовыеДанныеДляФормированияСлужебногоСообщения();
	ДанныеДляФормирования.УникальныйИдентификатор = Строка(Новый УникальныйИдентификатор);
	ДанныеДляФормирования.ТекстУточнения = Комментарий;
	ДанныеДляФормирования.Участники.Отправитель.Идентификатор = ПараметрыДокумента.ИдентификаторОрганизации;
	ДанныеДляФормирования.Участники.Отправитель.Ссылка = ПараметрыДокумента.Организация;
	
	Если ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя_ПДО_ИОП
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИОП_ПДО_ИОП
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПДО_ИОП
		ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПДП_ИОП Тогда
		
		ДанныеДляФормирования.Участники.Получатель.Тип = "Оператор";
		ДанныеДляФормирования.Участники.Получатель.Оператор = СинхронизацияЭДО.СведенияОбОператоре(
			ПараметрыДокумента.ИдентификаторОрганизации);
		ДанныеДляФормирования.Участники.Получатель.Абонент.Идентификатор = ПараметрыДокумента.ИдентификаторКонтрагента;
	Иначе
		ДанныеДляФормирования.Участники.Получатель.Тип = "Абонент";
		ДанныеДляФормирования.Участники.Получатель.Абонент.Идентификатор = ПараметрыДокумента.ИдентификаторКонтрагента;
		ДанныеДляФормирования.Участники.Получатель.Абонент.Ссылка = ПараметрыДокумента.Контрагент;
	КонецЕсли;
	
	Файл = Новый Файл(СвойстваФайлаОснования.ПолноеИмяФайла);
	ДанныеДляФормирования.Основание.ИмяБезРасширения = Файл.ИмяБезРасширения;
	ДанныеДляФормирования.Основание.ДатаВремяПолучения = СвойстваФайлаОснования.ДатаСоздания;
	
	Подписи = ЭлектроннаяПодпись.УстановленныеПодписи(СвойстваФайлаОснования.Ссылка);
	
	Если ЗначениеЗаполнено(Подписи) Тогда
		Для Каждого СвойстваПодписи Из Подписи Цикл
			ПодписьСтрокой = КриптографияБЭД.ДанныеПодписиВСтрокуБезПереносов(СвойстваПодписи.Подпись);
			ДанныеДляФормирования.ПодписиОснования.Добавить(ПодписьСтрокой);
		КонецЦикла;
	КонецЕсли;
	
	ДанныеСообщения = ФорматыЭДО.СформироватьДанныеСлужебногоСообщения(ТипДокумента, ДанныеДляФормирования);
	
	ОписаниеСообщения = НовоеОписаниеСообщения();
	ОписаниеСообщения.ТипЭлементаРегламента = ТипЭлементаРегламента;
	ОписаниеСообщения.Направление = Перечисления.НаправленияЭДО.Исходящий;
	ОписаниеСообщения.Данные = ДанныеСообщения;
	
	ПараметрыПоиска = НовыеПараметрыПоискаВидаДокумента(ТипДокумента);
	ОписаниеСообщения.ВидСообщения = НайтиСоздатьВидДокумента(ПараметрыПоиска);
	
	Возврат ОписаниеСообщения;
	
КонецФункции

#КонецОбласти

#Область ПредставлениеСообщения

// Возвращает представление сообщения ЭДО.
// 
// Параметры:
// 	СвойстваСообщения - Структура - Свойства сообщения для формирования представления:
//   * Дата - Дата
//   * ВидСообщения - СправочникСсылка.ВидыДокументовЭДО
// 	ЭтоНовый - Булево - Признак нового сообщения.
// Возвращаемое значение:
// 	Строка - Представление сообщения.
Функция ПредставлениеСообщенияПоСвойствам(СвойстваСообщения, ЭтоНовый = Ложь)
	Возврат СтрШаблон(НСтр("ru = '%1 от %2'"), СвойстваСообщения.ВидСообщения, Формат(СвойстваСообщения.Дата, "ДЛФ=D;"));
КонецФункции

#КонецОбласти

#Область ДанныеДокумента

Функция НовыеДанныеДокументовДляОтраженияВУчете()
	
	Возврат ИнтеграцияЭДОКлиентСервер.НовыеДанныеЭлектронногоДокументаДляОтраженияВУчете();
	
КонецФункции

#КонецОбласти

#Область Подписи

Функция УстановленныеПодписиФайла(ПрисоединенныйФайл, ВидПодписи = Неопределено)
	
	Подписи = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ВидПодписи)
		ИЛИ ВидПодписи = Перечисления.ВидыЭлектронныхПодписей.УсиленнаяКвалифицированная Тогда
		
		УстановленныеПодписи = ЭлектроннаяПодпись.УстановленныеПодписи(ПрисоединенныйФайл);
		ПорядковыйНомер = 0;
		Для Каждого Подпись Из УстановленныеПодписи Цикл
			ПорядковыйНомер = ПорядковыйНомер + 1;
			
			УстановленнаяПодпись = НовыеДанныеПодписи();
			ЗаполнитьЗначенияСвойств(УстановленнаяПодпись, Подпись);
			УстановленнаяПодпись.ВидПодписи = Перечисления.ВидыЭлектронныхПодписей.УсиленнаяКвалифицированная;
			УстановленнаяПодпись.Владелец = Подпись.КомуВыданСертификат;
			УстановленнаяПодпись.ПорядковыйНомер = ПорядковыйНомер;
			Подписи.Добавить(УстановленнаяПодпись);
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидПодписи)
		ИЛИ ВидПодписи = Перечисления.ВидыЭлектронныхПодписей.Простая Тогда
		
		УстановленныеПростыеПодписи = УстановленныеПростыеПодписи(ПрисоединенныйФайл);
		Для Каждого Подпись Из УстановленныеПростыеПодписи Цикл
			УстановленнаяПодпись = НовыеДанныеПодписи();
			ЗаполнитьЗначенияСвойств(УстановленнаяПодпись, Подпись);
			УстановленнаяПодпись.ВидПодписи = Перечисления.ВидыЭлектронныхПодписей.Простая;
			УстановленнаяПодпись.Владелец = Подпись.ВладелецПодписи;
			УстановленнаяПодпись.Должность = Подпись.Должность;
			УстановленнаяПодпись.ПодписьВерна = Истина;
			УстановленнаяПодпись.ДатаПроверкиПодписи = Подпись.ДатаПодписи;
			Подписи.Добавить(УстановленнаяПодпись);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Подписи;
	
КонецФункции

// Возвращает структуру данных подписи.
//
// Возвращаемое значение:
// 	Структура - данные подписи.
//     * Подпись             - ДвоичныеДанные - результат подписания.
//     * УстановившийПодпись - СправочникСсылка.Пользователи - пользователь, который
//                           подписал объект информационной базы.
//     * ВидПодписи          - Перечисление.ВидыЭлектронныхПодписей - вид подписи.
//     * Комментарий         - Строка - комментарий, если он был введен при подписании.
//     * ИмяФайлаПодписи     - Строка - если подпись добавлена из файла.
//     * ДатаПодписи         - Дата - дата, когда подпись была сделана. Имеет смысл для случаев,
//                           когда дату невозможно извлечь из данных подписи.
//     * ДатаПроверкиПодписи - Дата - дата последней проверки подписи.
//     * ПодписьВерна        - Булево - результат последней проверки подписи.
//     * ПорядковыйНомер     - Число - идентификатор подписи, по которому можно упорядочивать их в списке.
//     * Сертификат          - ХранилищеЗначения - содержит выгрузку сертификата,
//                           который использовался для подписания (содержится в подписи).
//     * Отпечаток           - Строка - отпечаток сертификата в формате строки Base64.
//     * КомуВыданСертификат - Строка - представление субъекта, полученное из двоичных данных сертификата.
//     * Должность - Строка - Должность лица, установившего подпись.
Функция НовыеДанныеПодписи()
	
	Данные = Новый Структура;
	Данные.Вставить("Подпись");
	Данные.Вставить("ВидПодписи");
	Данные.Вставить("УстановившийПодпись");
	Данные.Вставить("Комментарий");
	Данные.Вставить("ИмяФайлаПодписи");
	Данные.Вставить("ДатаПодписи");
	Данные.Вставить("ДатаПроверкиПодписи");
	Данные.Вставить("ПодписьВерна");
	Данные.Вставить("ПорядковыйНомер");
	Данные.Вставить("Сертификат");
	Данные.Вставить("Отпечаток");
	Данные.Вставить("Владелец");
	Данные.Вставить("Должность");
	Данные.Вставить("УникальныйИдентификатор");
	
	Возврат Данные;
	
КонецФункции

Функция УстановленныеПростыеПодписи(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПростыеЭлектронныеПодписи.ПорядковыйНомер КАК ПорядковыйНомер,
		|	ПростыеЭлектронныеПодписи.ДатаПодписи КАК ДатаПодписи,
		|	ПростыеЭлектронныеПодписи.ВладелецПодписи КАК ВладелецПодписи,
		|	ПростыеЭлектронныеПодписи.Должность КАК Должность,
		|	ПростыеЭлектронныеПодписи.Пользователь КАК УстановившийПодпись
		|ИЗ
		|	РегистрСведений.ПростыеЭлектронныеПодписи КАК ПростыеЭлектронныеПодписи
		|ГДЕ
		|	ПростыеЭлектронныеПодписи.ПодписанныйОбъект = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядковыйНомер";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура УдалитьПодписи(ФайлДокумента, ВидПодписи)
	
	Подписи = УстановленныеПодписиФайла(ФайлДокумента, ВидПодписи);
	
	Если ВидПодписи = Перечисления.ВидыЭлектронныхПодписей.Простая Тогда
		НаборЗаписей = РегистрыСведений.ПростыеЭлектронныеПодписи.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПодписанныйОбъект.Установить(ФайлДокумента);
		НаборЗаписей.Записать();
		Возврат;
	КонецЕсли;
	
	Для Каждого СвойстваПодписи Из Подписи Цикл
		ЭлектроннаяПодпись.УдалитьПодпись(ФайлДокумента, СвойстваПодписи.УникальныйИдентификатор);
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьНевалидныеПодписи(ФайлДокумента, КонтекстДиагностики = Неопределено)
	
	Результат = Ложь;
	
	УстановленныеПодписи = ЭлектроннаяПодпись.УстановленныеПодписи(ФайлДокумента);
	Для Каждого СвойстваПодписи Из УстановленныеПодписи Цикл
		Если Не СвойстваПодписи.ПодписьВерна Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Результат И КонтекстДиагностики <> Неопределено Тогда
		ШаблонТекста = НСтр("ru = 'Обработка электронного документа %1.
			|Документ не обработан, так как содержит невалидные подписи.'");
		Текст = СтрШаблон(ШаблонТекста, ФайлДокумента);
		Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(НСтр("ru = 'Определение валидности электронных подписей'"),
			КриптографияБЭД.ВидОшибкиПодписьНеверна(), Текст, Текст);
		ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, Ложь);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИмяФайлаПодписи(ПолноеИмяФайла, ПорядковыйНомерПодписи)
	Файл = Новый Файл(ПолноеИмяФайла);
	Возврат СтрШаблон("%1-%2.p7s", Файл.ИмяБезРасширения, ПорядковыйНомерПодписи);
КонецФункции

Функция ЭтоНоваяПодпись(УстановленныеПодписи, СвойстваПодписи)
	
	Если НЕ ЗначениеЗаполнено(УстановленныеПодписи) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого СвойстваУстановленнойПодписи Из УстановленныеПодписи Цикл
		Если СвойстваУстановленнойПодписи.Подпись = СвойстваПодписи.Подпись Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПодписиДокументаДляПроверкиНаКлиенте(ДвоичныеДанныеФайлов)
	
	Результат = Новый Массив;
	
	Для Каждого ДанныеФайла Из ДвоичныеДанныеФайлов Цикл
		
		УстановленныеПодписи = ЭлектроннаяПодпись.УстановленныеПодписи(ДанныеФайла.Ключ);
		
		Для Каждого СвойстваПописи Из УстановленныеПодписи Цикл
			ПараметрыПроверки = Новый Структура;
			ПараметрыПроверки.Вставить("ПрисоединенныйФайл", ДанныеФайла.Ключ);
			ПараметрыПроверки.Вставить("ДвоичныеДанныеФайла", ДанныеФайла.Значение);
			ПараметрыПроверки.Вставить("ДвоичныеДанныеПодписи", СвойстваПописи.Подпись);
			Результат.Добавить(ПараметрыПроверки);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьРезультатПроверкиПодписи(РезультатыПроверки, Подпись)
	
	РезультатПроверкиПодписи = Неопределено;
	
	Для Каждого РезультатПроверки Из РезультатыПроверки Цикл
		Если РезультатПроверки.Подпись = Подпись Тогда
			РезультатПроверкиПодписи = РезультатПроверки;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатПроверкиПодписи;
	
КонецФункции

#КонецОбласти

#Область ДокументыНаПодписи

Процедура ДобавитьУсловиеОтбораДокументовДляПодписания(Запрос, Условие, Отбор, ИмяТаблицы, ИмяСвойства)
	ЗначениеОтбора = Отбор[ИмяСвойства];
	Если Не ЗначениеЗаполнено(ЗначениеОтбора) Тогда
		Возврат;
	КонецЕсли;
	ИмяПараметра = "Отбор" + ИмяСвойства;
	Условие.Добавить(СтрШаблон("%1.%2 = &%3", ИмяТаблицы, ИмяСвойства, ИмяПараметра));
	Запрос.УстановитьПараметр(ИмяПараметра, ЗначениеОтбора);
КонецПроцедуры

#КонецОбласти

#Область СостояниеДокумента

Функция ТекстЗапросаПараметровОбновленияСостоянияДокумента(ЭтоВходящийЭДО)
	
	ТекстыЗапросов = Новый Массив;
	
	Если ЭтоВходящийЭДО Тогда
		ТекстыЗапросов.Добавить(
			"ВЫБРАТЬ
			|	ЭлектронныйДокументВходящийЭДО.Ссылка КАК Ссылка,
			|	ЭлектронныйДокументВходящийЭДО.ВидДокумента КАК ВидДокумента,
			|	ЭлектронныйДокументВходящийЭДО.Организация КАК Организация,
			|	ЭлектронныйДокументВходящийЭДО.Контрагент КАК Контрагент,
			|	ЭлектронныйДокументВходящийЭДО.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	ЭлектронныйДокументВходящийЭДО.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
			|	ЭлектронныйДокументВходящийЭДО.ИдентификаторКонтрагента КАК ИдентификаторКонтрагента,
			|	ЭлектронныйДокументВходящийЭДО.ТипРегламента КАК ТипРегламента,
			|	ЭлектронныйДокументВходящийЭДО.ТребуетсяИзвещение КАК ТребуетсяИзвещение,
			|	ЭлектронныйДокументВходящийЭДО.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
			|	ЭлектронныйДокументВходящийЭДО.ОбменБезПодписи КАК ОбменБезПодписи,
			|	ЭлектронныйДокументВходящийЭДО.СпособОбмена КАК СпособОбмена,
			|	ЗНАЧЕНИЕ(Перечисление.ВидыЭлектронныхПодписей.УсиленнаяКвалифицированная) КАК ВидПодписи,
			|	ЭлектронныйДокументВходящийЭДО.Остановлен КАК Остановлен,
			|	ЭлектронныйДокументВходящийЭДО.ПричинаОстановки КАК ПричинаОстановки,
			|	ЭлектронныйДокументВходящийЭДО.Исправлен КАК Исправлен,
			|	ЭлектронныйДокументВходящийЭДО.НаОзнакомлении КАК НаОзнакомлении,
			|	ЭлектронныйДокументВходящийЭДО.Ответственный КАК Ответственный
			|ИЗ
			|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
			|ГДЕ
			|	ЭлектронныйДокументВходящийЭДО.Ссылка = &ЭлектронныйДокумент");
	Иначе
		ТекстыЗапросов.Добавить(
			"ВЫБРАТЬ
			|	ЭлектронныйДокументИсходящийЭДО.Ссылка КАК Ссылка,
			|	ЭлектронныйДокументИсходящийЭДО.ВидДокумента КАК ВидДокумента,
			|	ЭлектронныйДокументИсходящийЭДО.Организация КАК Организация,
			|	ЭлектронныйДокументИсходящийЭДО.Контрагент КАК Контрагент,
			|	ЭлектронныйДокументИсходящийЭДО.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
			|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторКонтрагента КАК ИдентификаторКонтрагента,
			|	ЭлектронныйДокументИсходящийЭДО.ТипРегламента КАК ТипРегламента,
			|	ЭлектронныйДокументИсходящийЭДО.ТребуетсяИзвещение КАК ТребуетсяИзвещение,
			|	ЭлектронныйДокументИсходящийЭДО.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
			|	ЭлектронныйДокументИсходящийЭДО.ОбменБезПодписи КАК ОбменБезПодписи,
			|	ЭлектронныйДокументИсходящийЭДО.СпособОбмена КАК СпособОбмена,
			|	ЭлектронныйДокументИсходящийЭДО.ВидПодписи КАК ВидПодписи,
			|	ЭлектронныйДокументИсходящийЭДО.Остановлен КАК Остановлен,
			|	ЭлектронныйДокументИсходящийЭДО.ПричинаОстановки КАК ПричинаОстановки,
			|	ЭлектронныйДокументИсходящийЭДО.Исправлен КАК Исправлен,
			|	ЭлектронныйДокументИсходящийЭДО.НаОзнакомлении КАК НаОзнакомлении,
			|	ЭлектронныйДокументИсходящийЭДО.Ответственный КАК Ответственный
			|ИЗ
			|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
			|ГДЕ
			|	ЭлектронныйДокументИсходящийЭДО.Ссылка = &ЭлектронныйДокумент");
	КонецЕсли;
	
	ТекстыЗапросов.Добавить(ТекстЗапросаСостоянияСообщений());
	
	Возврат СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
КонецФункции

Функция ТекстЗапросаПараметровОбновленияСостоянияПоИдентификатору()
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторДокументооборота КАК ИдентификаторДокументооборота,
		|	ЭлектронныйДокументВходящийЭДО.Ссылка КАК Ссылка,
		|	ЭлектронныйДокументВходящийЭДО.Организация КАК Организация,
		|	ЭлектронныйДокументВходящийЭДО.Контрагент КАК Контрагент,
		|	ЭлектронныйДокументВходящийЭДО.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторКонтрагента КАК ИдентификаторКонтрагента,
		|	ЭлектронныйДокументВходящийЭДО.ТипРегламента КАК ТипРегламента,
		|	ЭлектронныйДокументВходящийЭДО.ТребуетсяИзвещение КАК ТребуетсяИзвещение,
		|	ЭлектронныйДокументВходящийЭДО.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
		|	ЭлектронныйДокументВходящийЭДО.ОбменБезПодписи КАК ОбменБезПодписи,
		|	ЭлектронныйДокументВходящийЭДО.СпособОбмена КАК СпособОбмена,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыЭлектронныхПодписей.УсиленнаяКвалифицированная) КАК ВидПодписи,
		|	ЭлектронныйДокументВходящийЭДО.Остановлен КАК Остановлен,
		|	ЭлектронныйДокументВходящийЭДО.ПричинаОстановки КАК ПричинаОстановки,
		|	ЭлектронныйДокументВходящийЭДО.Исправлен КАК Исправлен,
		|	ЭлектронныйДокументВходящийЭДО.НаОзнакомлении КАК НаОзнакомлении,
		|	ЭлектронныйДокументВходящийЭДО.Ответственный КАК Ответственный,
		|	ЭлектронныйДокументВходящийЭДО.ВидДокумента КАК ВидДокумента,
		|	ЭлектронныйДокументВходящийЭДО.ВидДокумента.ТипДокумента КАК ТипДокумента
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|ГДЕ
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторДокументооборота = &ИдентификаторДокументооборота
		|	И ЭлектронныйДокументВходящийЭДО.ИдентификаторОрганизации = &ИдентификаторОрганизации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокументооборота КАК ИдентификаторДокументооборота,
		|	ЭлектронныйДокументИсходящийЭДО.Ссылка КАК Ссылка,
		|	ЭлектронныйДокументИсходящийЭДО.Организация КАК Организация,
		|	ЭлектронныйДокументИсходящийЭДО.Контрагент КАК Контрагент,
		|	ЭлектронныйДокументИсходящийЭДО.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторКонтрагента КАК ИдентификаторКонтрагента,
		|	ЭлектронныйДокументИсходящийЭДО.ТипРегламента КАК ТипРегламента,
		|	ЭлектронныйДокументИсходящийЭДО.ТребуетсяИзвещение КАК ТребуетсяИзвещение,
		|	ЭлектронныйДокументИсходящийЭДО.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
		|	ЭлектронныйДокументИсходящийЭДО.ОбменБезПодписи КАК ОбменБезПодписи,
		|	ЭлектронныйДокументИсходящийЭДО.СпособОбмена КАК СпособОбмена,
		|	ЭлектронныйДокументИсходящийЭДО.ВидПодписи КАК ВидПодписи,
		|	ЭлектронныйДокументИсходящийЭДО.Остановлен КАК Остановлен,
		|	ЭлектронныйДокументИсходящийЭДО.ПричинаОстановки КАК ПричинаОстановки,
		|	ЭлектронныйДокументИсходящийЭДО.Исправлен КАК Исправлен,
		|	ЭлектронныйДокументИсходящийЭДО.НаОзнакомлении КАК НаОзнакомлении,
		|	ЭлектронныйДокументИсходящийЭДО.Ответственный КАК Ответственный,
		|	ЭлектронныйДокументИсходящийЭДО.ВидДокумента КАК ВидДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.ВидДокумента.ТипДокумента КАК ТипДокумента
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|ГДЕ
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокументооборота = &ИдентификаторДокументооборота
		|	И ЭлектронныйДокументИсходящийЭДО.ИдентификаторОрганизации = &ИдентификаторОрганизации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Ссылка,
		|	СообщениеЭДО.Дата КАК Дата,
		|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента,
		|	СообщениеЭДО.Состояние КАК Состояние,
		|	СообщениеЭДО.Статус КАК Статус,
		|	СообщениеЭДО.Направление КАК Направление
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|		ПО СообщениеЭДО.ЭлектронныйДокумент = ЭлектронныйДокументВходящийЭДО.Ссылка
		|		И ЭлектронныйДокументВходящийЭДО.ИдентификаторДокументооборота = &ИдентификаторДокументооборота
		|		И ЭлектронныйДокументВходящийЭДО.ИдентификаторОрганизации = &ИдентификаторОрганизации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Ссылка,
		|	СообщениеЭДО.Дата КАК Дата,
		|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента,
		|	СообщениеЭДО.Состояние КАК Состояние,
		|	СообщениеЭДО.Статус КАК Статус,
		|	СообщениеЭДО.Направление КАК Направление
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|		ПО СообщениеЭДО.ЭлектронныйДокумент = ЭлектронныйДокументИсходящийЭДО.Ссылка
		|		И ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокументооборота = &ИдентификаторДокументооборота
		|		И ЭлектронныйДокументИсходящийЭДО.ИдентификаторОрганизации = &ИдентификаторОрганизации";
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапросаСостоянийДокументов()
	Возврат
		"ВЫБРАТЬ
		|	СостоянияДокументовЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
		|	СостоянияДокументовЭДО.Состояние КАК Состояние,
		|	СостоянияДокументовЭДО.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|ГДЕ
		|	СостоянияДокументовЭДО.ЭлектронныйДокумент В (&ЭлектронныеДокументы)";
КонецФункции

Функция ТекстЗапросаКомментарияКСостояниюДокумента()
	Возврат
		"ВЫБРАТЬ
		|	СостоянияДокументовЭДО.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|ГДЕ
		|	СостоянияДокументовЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент";
КонецФункции

Функция КомментарийКСостояниюДокумента(РезультатЗапроса)
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Комментарий;
	КонецЕсли;
	Возврат ""
КонецФункции

Функция ЭтоВходящийЭДО(ЭлектронныйДокумент)
	Возврат ТипЗнч(ЭлектронныйДокумент) = Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО");
КонецФункции

Функция НовыеДополненияСостоянийЭДО()
	Возврат Новый Соответствие;
КонецФункции

Функция ДополненияСостоянийЭДОПриПодписании(СвойстваДокумента, ВидПодписи, ВесМаршрута)
	
	ДополненияСостоянийЭДО = Новый Соответствие;
	
	Если Не ЗначениеЗаполнено(ВесМаршрута) Тогда
		Возврат ДополненияСостоянийЭДО;
	КонецЕсли;
	
	Если СвойстваДокумента.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя
		ИЛИ СвойстваДокумента.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя Тогда
		
		Подписи = УстановленныеПодписиФайла(СвойстваДокумента.ОсновнойФайл);
		ПрогрессПодписания = СтрШаблон("%1 / %2", Подписи.Количество(), ВесМаршрута);
		ДополненияСостоянийЭДО.Вставить(Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание, ПрогрессПодписания);
		
	КонецЕсли;
	
	Возврат ДополненияСостоянийЭДО;
	
КонецФункции

Функция ДополнениеСостоянияЭДО(ДополненияСостоянийЭДО, СостояниеДокумента)
	
	Если Не ЗначениеЗаполнено(ДополненияСостоянийЭДО) Тогда
		Возврат "";
	КонецЕсли;
	
	Дополнение = ДополненияСостоянийЭДО[СостояниеДокумента];
	Если Дополнение = Неопределено Тогда
		Дополнение = "";
	КонецЕсли;
	
	Возврат Дополнение;
	
КонецФункции

Процедура ЗаписатьСостояниеДокумента(ЭлектронныйДокумент, Состояние, СостояниеДополнение, ДатаИзменения, Комментарий = "")
	МенеджерЗаписи = РегистрыСведений.СостоянияДокументовЭДО.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЭлектронныйДокумент = ЭлектронныйДокумент;
	МенеджерЗаписи.Состояние = Состояние;
	МенеджерЗаписи.СостояниеДополнение = СостояниеДополнение;
	МенеджерЗаписи.ДатаИзменения = ДатаИзменения;
	МенеджерЗаписи.Комментарий = Комментарий;
	МенеджерЗаписи.Записать();
КонецПроцедуры

Функция УстановитьСостояниеДокументаПриФормировании(ДокументОбъект, СостоянияЭлементовРегламента, ДатаИзменения, НаборОбъектовУчета, КонтекстДиагностики, ДополненияСостоянийЭДО = Неопределено)
	
	СостояниеДокумента = ОбновитьСостояниеДокумента(ДокументОбъект, СостоянияЭлементовРегламента,
		ДополненияСостоянийЭДО, ДатаИзменения, КонтекстДиагностики);
	
	ЭлектронныеДокументыЭДОСобытия.ПриФормированииЭлектронногоДокумента(ДокументОбъект.Ссылка,
		ДокументОбъект.ВидДокумента, СостояниеДокумента, НаборОбъектовУчета, КонтекстДиагностики);
	
	Возврат СостояниеДокумента;
	
КонецФункции

Функция УстановитьСостояниеДокументаПриИзменении(ПараметрыДокумента, СостоянияЭлементовРегламента, ДатаИзменения, КонтекстДиагностики, ДополненияСостоянийЭДО = Неопределено, Комментарий = "")
	
	СостояниеДокумента = ОбновитьСостояниеДокумента(ПараметрыДокумента, СостоянияЭлементовРегламента,
		ДополненияСостоянийЭДО, ДатаИзменения, КонтекстДиагностики, Комментарий);
	
	ЭлектронныеДокументыЭДОСобытия.ПриИзмененииСостоянияЭлектронногоДокумента(ПараметрыДокумента.Ссылка, СостояниеДокумента,
		КонтекстДиагностики);
	
	Возврат СостояниеДокумента;
	
КонецФункции

Функция УстановитьСостояниеДокументаПриЗагрузке(ПараметрыДокумента, СостоянияЭлементовРегламента, ДатаИзменения, КонтекстДиагностики, ДополненияСостоянийЭДО = Неопределено)
	
	СостояниеДокумента = ОбновитьСостояниеДокумента(ПараметрыДокумента, СостоянияЭлементовРегламента,
		ДополненияСостоянийЭДО, ДатаИзменения, КонтекстДиагностики);
	
	ЭлектронныеДокументыЭДОСобытия.ПриЗагрузкеНовогоЭлектронногоДокумента(ПараметрыДокумента.Ссылка, СостояниеДокумента,
		КонтекстДиагностики);
	
	Возврат СостояниеДокумента;
	
КонецФункции

Функция ОбновитьСостояниеДокумента(ПараметрыДокумента, СостоянияЭлементовРегламента, ДополненияСостоянийЭДО, ДатаИзменения, КонтекстДиагностики, Комментарий = "")
	
	ЭтоВходящийЭДО = ЭтоВходящийЭДО(ПараметрыДокумента.Ссылка); 
	
	СостояниеДокумента = РегламентыЭДО.СостояниеДокумента(ПараметрыДокумента,
		СостоянияЭлементовРегламента, ЭтоВходящийЭДО);
	
	ДополнениеСостоянияЭДО = ДополнениеСостоянияЭДО(ДополненияСостоянийЭДО, СостояниеДокумента);
	
	ЗаписатьСостояниеДокумента(ПараметрыДокумента.Ссылка, СостояниеДокумента, ДополнениеСостоянияЭДО,
		ДатаИзменения, Комментарий);
	
	Возврат СостояниеДокумента;
	
КонецФункции

Функция СостоянияПоДокументам(НаборДокументов)
	Результат = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СостоянияДокументовЭДО.ЭлектронныйДокумент,
		|	СостоянияДокументовЭДО.Состояние
		|ИЗ
		|	РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|ГДЕ
		|	СостоянияДокументовЭДО.ЭлектронныйДокумент В (&НаборДокументов)";
	Запрос.УстановитьПараметр("НаборДокументов", НаборДокументов);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ЭлектронныйДокумент, Выборка.Состояние);
	КонецЦикла;
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СостояниеСообщения

Функция ТекстЗапросаСостоянияСообщений()
	Возврат
		"ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Ссылка,
		|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента,
		|	СообщениеЭДО.Состояние КАК Состояние,
		|	СообщениеЭДО.Статус КАК Статус,
		|	СообщениеЭДО.Направление КАК Направление
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент";
КонецФункции

Процедура УстановитьСостояниеХранение(СостоянияСообщений, ДатаИзмененияСтатуса)
	Для Каждого СвойстваСообщения Из СостоянияСообщений Цикл
		Если СвойстваСообщения.Состояние = Перечисления.СостоянияСообщенийЭДО.Хранение Тогда
			Продолжить;
		КонецЕсли;
		СообщениеОбъект = СвойстваСообщения.Ссылка.ПолучитьОбъект();
		СообщениеОбъект.Состояние = Перечисления.СостоянияСообщенийЭДО.Хранение;
		СообщениеОбъект.ДатаИзмененияСтатуса = ДатаИзмененияСтатуса;
		СообщениеОбъект.Записать();
		СвойстваСообщения.Состояние = СообщениеОбъект.Состояние;
	КонецЦикла;
КонецПроцедуры

Процедура ПересчитатьСостоянияСообщений(СостоянияСообщений, ПараметрыДокумента)
	ИспользоватьУтверждение = НастройкиЭДО.ОтправлятьВходящиеДокументыНаУтверждение();
	Для Каждого СвойстваСообщения Из СостоянияСообщений Цикл
		СообщениеОбъект = СвойстваСообщения.Ссылка.ПолучитьОбъект();
		СообщениеОбъект.Состояние = РегламентыЭДО.СостояниеСообщения(
			СвойстваСообщения, ПараметрыДокумента, ИспользоватьУтверждение);
		СообщениеОбъект.Записать();
		СвойстваСообщения.Состояние = СообщениеОбъект.Состояние;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СвязанныеДокументы

Процедура ОбновитьСвязанныеДокументы(ТипДокумента, ИдентификаторыОснований, Действие, КонтекстДиагностики, ЭтоВходящийЭДО = Ложь)
	
	ЭтоИсправляющийТипДокумента = ЭтоИсправляющийТипДокумента(ТипДокумента);
	
	ЭтоКорректирующийТипДокумента = ЭтоКорректирующийТипДокумента(ТипДокумента);
	
	Если Не ЭтоИсправляющийТипДокумента
		И Не ЭтоКорректирующийТипДокумента Тогда
		Возврат;
	КонецЕсли;
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(
		"ВЫБРАТЬ
		|	ИдентификаторыОснований.ИдентификаторСвязи КАК ИдентификаторСвязи,
		|	ИдентификаторыОснований.ИдентификаторДокументооборота КАК ИдентификаторДокументооборота
		|ПОМЕСТИТЬ ВТ_ИдентификаторыОснований
		|ИЗ
		|	&ИдентификаторыОснований КАК ИдентификаторыОснований");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Ссылка,
		|	СообщениеЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
		|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента,
		|	СообщениеЭДО.Состояние КАК Состояние,
		|	СообщениеЭДО.Статус КАК Статус,
		|	ВидыДокументовЭДО.ТипДокумента КАК ТипДокумента
		|ИЗ
		|	ВТ_ИдентификаторыОснований
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИмяТаблицыДокумента КАК ДокументЭДО
		|		ПО ВТ_ИдентификаторыОснований.ИдентификаторДокументооборота = ДокументЭДО.ИдентификаторДокументооборота
		|		И ВТ_ИдентификаторыОснований.ИдентификаторДокументооборота <> """"
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ПО ДокументЭДО.Ссылка = СообщениеЭДО.ЭлектронныйДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|		ПО СообщениеЭДО.ВидСообщения = ВидыДокументовЭДО.Ссылка";
	
	ИмяТаблицыДокументаЭДО = ИмяТаблицыДокументаЭДО(ЭтоВходящийЭДО);
	ТекстЗапросаДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		СтрЗаменить(ТекстЗапроса, "ИмяТаблицыДокумента", ИмяТаблицыДокументаЭДО));
	
	Если ЭтоВходящийЭДО Тогда
		ТекстЗапросаДокументов.Добавить("
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|");
		
		ТекстЗапросаДокументов.Добавить(
			"ВЫБРАТЬ
			|	СообщениеЭДО.Ссылка КАК Ссылка,
			|	СообщениеЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
			|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента,
			|	СообщениеЭДО.Состояние КАК Состояние,
			|	СообщениеЭДО.Статус КАК Статус,
			|	ВидыДокументовЭДО.ТипДокумента КАК ТипДокумента
			|ИЗ
			|	ВТ_ИдентификаторыОснований КАК ВТ_ИдентификаторыОснований
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящийЭДО КАК ДокументЭДО
			|		ПО ВТ_ИдентификаторыОснований.ИдентификаторСвязи = ДокументЭДО.ИдентификаторСвязи
			|		И ВТ_ИдентификаторыОснований.ИдентификаторСвязи <> """"
			|		И ВТ_ИдентификаторыОснований.ИдентификаторДокументооборота = """"
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
			|		ПО ДокументЭДО.Ссылка = СообщениеЭДО.ЭлектронныйДокумент
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
			|		ПО СообщениеЭДО.ВидСообщения = ВидыДокументовЭДО.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыОснований КАК ИдентификаторыДокументооборотов
			|		ПО ДокументЭДО.ИдентификаторДокументооборота = ИдентификаторыДокументооборотов.ИдентификаторДокументооборота
			|ГДЕ
			|	ИдентификаторыДокументооборотов.ИдентификаторДокументооборота ЕСТЬ NULL");
	КонецЕсли;
	
	ТекстЗапросаДокументов.Добавить("
		|ИТОГИ
		|ПО
		|	ЭлектронныйДокумент");
	
	ТекстыЗапросов.Добавить(СтрСоединить(ТекстЗапросаДокументов));
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос.УстановитьПараметр("ИдентификаторыОснований", ИдентификаторыОснований);
	
	Блокировка = Новый БлокировкаДанных;
	Для Каждого СтрокаТаблицы Из ИдентификаторыОснований Цикл
		ЭлементБлокировки = Блокировка.Добавить(ИмяТаблицыДокументаЭДО);
		Если ЗначениеЗаполнено(СтрокаТаблицы.ИдентификаторДокументооборота) Тогда
			ЭлементБлокировки.УстановитьЗначение("ИдентификаторДокументооборота",
				СтрокаТаблицы.ИдентификаторДокументооборота);
		ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.ИдентификаторСвязи) Тогда
			ЭлементБлокировки.УстановитьЗначение("ИдентификаторСвязи", СтрокаТаблицы.ИдентификаторСвязи);
		КонецЕсли;
	КонецЦикла;
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
	
		КорректируемыеТипыДокументов = КорректируемыеТипыДокументов();
		
		СвойстваСообщения = Новый Структура("Ссылка, Статус");
		
		ВыборкаДокументов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДокументов.Следующий() Цикл
			
			ПропуститьДокумент = Ложь;
			СостоянияЭлементовРегламента = РегламентыЭДО.НовыеСостоянияЭлементовРегламента();
			Выборка = ВыборкаДокументов.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(СостоянияЭлементовРегламента.Добавить(), Выборка);
				Если Выборка.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя Тогда
					Если ЭтоИсправляющийТипДокумента И ТипДокумента <> Выборка.ТипДокумента
						ИЛИ ЭтоКорректирующийТипДокумента
							И ТипДокумента <> КорректируемыеТипыДокументов[Выборка.ТипДокумента] Тогда
						ПропуститьДокумент = Истина;
						Прервать;
					КонецЕсли;
					ЗаполнитьЗначенияСвойств(СвойстваСообщения, Выборка);
				КонецЕсли;
			КонецЦикла;
			
			Если ПропуститьДокумент Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументОбъектов = ВыборкаДокументов.ЭлектронныйДокумент.ПолучитьОбъект();
			ДокументОбъектов.Исправлен = Истина;
			ДокументОбъектов.Записать();
			
			ДатаИзменения = ТекущаяДатаСеанса();
			
			СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(ДокументОбъектов, СостоянияЭлементовРегламента,
				ДатаИзменения, КонтекстДиагностики);
			
			ЗаписатьДействиеВЖурнал(Действие, ДокументОбъектов, СостояниеДокумента, ДатаИзменения, СвойстваСообщения);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СтатусДокумента

Функция ДоступныеСтатусыДокумента()
	Статусы = Новый Структура;
	Статусы.Вставить("ЭДОНеНастроен", "ЭДОНеНастроен");
	Статусы.Вставить("НеНачат", "НеНачат");
	Статусы.Вставить("ВОбработке", "ВОбработке");
	Статусы.Вставить("Получен", "Получен");
	Статусы.Вставить("ОтклонениеВОбработке", "ОтклонениеВОбработке");
	Статусы.Вставить("Отклонен", "Отклонен");
	Статусы.Вставить("УтверждениеВОбработке", "УтверждениеВОбработке");
	Статусы.Вставить("Утвержден", "Утвержден");
	Статусы.Вставить("Ошибка", "Ошибка");
	Возврат Статусы;
КонецФункции

#КонецОбласти

#Область ДействияПоЭДО

Функция ДоступныеДействияПоЭДО(СостояниеДокумента, СвойстваДокумента)
	
	Действия = Новый Соответствие;
	
	Если СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.НеСформирован Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Сформировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Подписать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.ПодготовитьКОтправке, Истина);
		Если ДействиеОтправитьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.Отправить, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание Тогда
		
		Если ДействиеПодписатьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.Подписать, Истина);
			Действия.Вставить(Перечисления.ДействияПоЭДО.ПодготовитьКОтправке, Истина);
			Если ДействиеОтправитьДоступно(СвойстваДокумента) Тогда
				Действия.Вставить(Перечисления.ДействияПоЭДО.Отправить, Истина);
			КонецЕсли;
			Действия.Вставить(Перечисления.ДействияПоЭДО.ОтклонитьПодписание, Истина);
		КонецЕсли;
		Действия.Вставить(Перечисления.ДействияПоЭДО.Переформировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ЭтоВходящийЭДО(СвойстваДокумента.Ссылка) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.Аннулировать, Истина);
			Действия.Вставить(Перечисления.ДействияПоЭДО.СформироватьОтвет, Истина);
		КонецЕсли;
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправке Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.ПодготовитьКОтправке, Истина);
		Если ДействиеОтправитьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.Отправить, Истина);
		КонецЕсли;
		Действия.Вставить(Перечисления.ДействияПоЭДО.Переформировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправка Тогда
		
		Если ДействиеОтправитьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.Отправить, Истина);
		КонецЕсли;
		Действия.Вставить(Перечисления.ДействияПоЭДО.ОтменитьОтправку, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяУтверждение Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Утвердить, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Отклонить, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Аннулировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.СформироватьОтвет, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеОтклонения Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Подписать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.ПодготовитьКОтправке, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Отправить, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Переформировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправкеОтклонения Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.ПодготовитьКОтправке, Истина);
		Если ДействиеОтправитьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.Отправить, Истина);
		КонецЕсли;
		Действия.Вставить(Перечисления.ДействияПоЭДО.Переформировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправкаОтклонения Тогда
		
		Если ДействиеОтправитьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.Отправить, Истина);
		КонецЕсли;
		Действия.Вставить(Перечисления.ДействияПоЭДО.ОтменитьОтправку, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодтверждениеАннулирования Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.ПринятьАннулирование, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.ОтклонитьАннулирование, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеАннулирования Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Подписать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.ПодготовитьКОтправке, Истина);
		Если ДействиеОтправитьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.Отправить, Истина);
		КонецЕсли;
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправкеАннулирования Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.ПодготовитьКОтправке, Истина);
		Если ДействиеОтправитьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.Отправить, Истина);
		КонецЕсли;
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправкаАннулирования Тогда
		
		Если ДействиеОтправитьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.Отправить, Истина);
		КонецЕсли;
		Действия.Вставить(Перечисления.ДействияПоЭДО.ОтменитьОтправку, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяИзвещениеОПолучении Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Сформировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Подписать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.ПодготовитьКОтправке, Истина);
		Если ДействиеОтправитьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.Отправить, Истина);
		КонецЕсли;
		Действия.Вставить(Перечисления.ДействияПоЭДО.Аннулировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещения Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Подписать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.ПодготовитьКОтправке, Истина);
		Если Не НастройкиЭДО.ОтложеннаяОтправкаЭлектронныхДокументов() Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.Отправить, Истина);
		КонецЕсли;
		Действия.Вставить(Перечисления.ДействияПоЭДО.Аннулировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Переформировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправкеИзвещения Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.ПодготовитьКОтправке, Истина);
		Если ДействиеОтправитьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.Отправить, Истина);
		КонецЕсли;
		Действия.Вставить(Перечисления.ДействияПоЭДО.Аннулировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Переформировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправкаИзвещения Тогда
		
		Если ДействиеОтправитьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.Отправить, Истина);
		КонецЕсли;
		Действия.Вставить(Перечисления.ДействияПоЭДО.ОтменитьОтправку, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Аннулировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяИзвещениеПоОтклонению Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Сформировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Подписать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.ПодготовитьКОтправке, Истина);
		Если ДействиеОтправитьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.Отправить, Истина);
		КонецЕсли;
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещенияПоОтклонению Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Подписать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.ПодготовитьКОтправке, Истина);
		Если ДействиеОтправитьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.Отправить, Истина);
		КонецЕсли;
		Действия.Вставить(Перечисления.ДействияПоЭДО.Переформировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправкеИзвещенияПоОтклонению Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.ПодготовитьКОтправке, Истина);
		Если Не НастройкиЭДО.ОтложеннаяОтправкаЭлектронныхДокументов() Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.Отправить, Истина);
		КонецЕсли;
		Действия.Вставить(Перечисления.ДействияПоЭДО.Переформировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправкаИзвещенияПоОтклонению Тогда
		
		Если ДействиеОтправитьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.Отправить, Истина);
		КонецЕсли;
		Действия.Вставить(Перечисления.ДействияПоЭДО.ОтменитьОтправку, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяУточнение Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.СформироватьИсправление, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяИсправлениеОшибкиПередачи Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.СформироватьИсправление, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяПовторнаяОтправка Тогда
		
		Если ДействиеОтправитьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.Отправить, Истина);
		КонецЕсли;
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ЗакрытСОтклонениемПриглашения Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеОператора Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Аннулировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОжидаетсяИзвещениеОПолучении Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Аннулировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОжидаетсяПодтверждение Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Аннулировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеАннулирования Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
	
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОжидаетсяИзвещениеПоОтклонению Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОжидаетсяОтветНаПриглашение Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		Если ДействиеЗакрытьДоступно(СвойстваДокумента) Тогда
			Действия.Вставить(Перечисления.ДействияПоЭДО.ЗакрытьПринудительно, Истина);
		КонецЕсли;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОбменЗавершен Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Аннулировать, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОбменЗавершенСИсправлением Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ЗакрытПринудительно Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.ВернутьВРаботу, Истина);
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ЗакрытСОтклонением Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ЗакрытСОшибкойПередачи Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.Аннулирован Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.Перенаправить, Истина);
		
	КонецЕсли;
	
	Если СвойстваДокумента.НаОзнакомлении Тогда
		
		Действия.Вставить(Перечисления.ДействияПоЭДО.ОтправитьВАрхив, Истина);
		
	КонецЕсли;
	
	Возврат Действия;
	
КонецФункции

Функция ДействиеПодписатьДоступно(СвойстваДокумента)
	
	Если ЭтоВходящийЭДО(СвойстваДокумента.Ссылка) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ОписанияЗапросов = Новый Массив;
	
	ОписаниеЗапроса = ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса();
	ОписаниеЗапроса.Текст = 
		"ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ СообщенияДляОбработки
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент = &ОтборЭлектронныйДокумент
		|	И СообщениеЭДО.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенийЭДО.Подписание)
		|	И СообщениеЭДО.ТипЭлементаРегламента В (ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя))";
	ОписаниеЗапроса.СлужебныеПараметры.Вставить("ОтборЭлектронныйДокумент", СвойстваДокумента.Ссылка);
	ОписанияЗапросов.Добавить(ОписаниеЗапроса);
	
	Отбор = МаршрутыПодписанияБЭД.НовыйОтборОбъектовДляПодписания();
	Отбор.Объект = "ВЫБРАТЬ Ссылка ИЗ СообщенияДляОбработки";
	ОписанияЗапросов.Добавить(МаршрутыПодписанияБЭД.ЗапросОбъектовДляПодписания("ОбъектыДляПодписания", Отбор));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбъектыДляПодписания.Объект
		|ИЗ
		|	ОбъектыДляПодписания";
	
	Запрос = ОбщегоНазначенияБЭД.СоединитьЗапросы(Запрос, ОписанияЗапросов);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция ДействиеОтправитьДоступно(СвойстваДокумента)
	Возврат Не СинхронизацияЭДО.ЭтоВнутреннийОбмен(СвойстваДокумента.СпособОбмена)
		И Не НастройкиЭДО.ОтложеннаяОтправкаЭлектронныхДокументов();
КонецФункции

Функция ДействиеЗакрытьДоступно(СвойстваДокумента)
	Возврат Не СинхронизацияЭДО.ЭтоВнутреннийОбмен(СвойстваДокумента.СпособОбмена);
КонецФункции

Функция ДействиеДоступно(Действие, СостояниеДокумента, СвойстваДокумента, КонтекстДиагностики)
	Возврат Действие = Перечисления.ДействияПоЭДО.Загрузить
		ИЛИ ДоступныеДействияПоЭДО(СостояниеДокумента, СвойстваДокумента)[Действие] <> Неопределено;
КонецФункции

#КонецОбласти

#Область РаботаСПакетами

Функция НовоеОписаниеПакета()
	ОписаниеПакета = Новый Структура;
	ОписаниеПакета.Вставить("ИдентификаторПакета");
	ОписаниеПакета.Вставить("Организация");
	ОписаниеПакета.Вставить("Контрагент");
	ОписаниеПакета.Вставить("ДоговорКонтрагента");
	ОписаниеПакета.Вставить("Дата", '00010101');
	Возврат ОписаниеПакета;
КонецФункции

Функция РезультатЗапросаДокументовПакета(ИдентификаторПакета)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторПакета", ИдентификаторПакета);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СоставПакетовЭлектронныхДокументов.ЭлектронныйДокумент КАК ЭлектронныйДокумент
		|ИЗ
		|	РегистрСведений.СоставПакетовДокументовЭДО КАК СоставПакетовЭлектронныхДокументов
		|ГДЕ
		|	СоставПакетовЭлектронныхДокументов.ИдентификаторПакета = &ИдентификаторПакета";
	Возврат Запрос.Выполнить();
КонецФункции

Функция ПараметрыИзмененияПакетаДокументов(ИдентификаторПакета, ЭлектронныйДокумент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторПакета", ИдентификаторПакета);
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СоставПакетовДокументовЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
		|	СостоянияДокументовЭДО.Состояние КАК Состояние,
		|	ЭлектронныйДокументИсходящийЭДО.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.СоставПакетовДокументовЭДО КАК СоставПакетовДокументовЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|		ПО СоставПакетовДокументовЭДО.ЭлектронныйДокумент = СостоянияДокументовЭДО.ЭлектронныйДокумент
		|		И СоставПакетовДокументовЭДО.ИдентификаторПакета = &ИдентификаторПакета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|		ПО СоставПакетовДокументовЭДО.ЭлектронныйДокумент = ЭлектронныйДокументИсходящийЭДО.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭлектронныйДокументИсходящийЭДО.Дата КАК Дата,
		|	ЭлектронныйДокументИсходящийЭДО.Организация КАК Организация,
		|	ЭлектронныйДокументИсходящийЭДО.Контрагент КАК Контрагент,
		|	ЭлектронныйДокументИсходящийЭДО.ДоговорКонтрагента КАК ДоговорКонтрагента
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|ГДЕ
		|	ЭлектронныйДокументИсходящийЭДО.Ссылка = &ЭлектронныйДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПакетыДокументовЭДО.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.ПакетыДокументовЭДО КАК ПакетыДокументовЭДО
		|ГДЕ
		|	ПакетыДокументовЭДО.ИдентификаторПакета = &ИдентификаторПакета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СостоянияДокументовЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
		|	СостоянияДокументовЭДО.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|ГДЕ
		|	СостоянияДокументовЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	СостоянияДокументов = Новый Соответствие;
	ДатаПервогоДокумента = '00010101';
	
	ВыборкаСостояний = РезультатыЗапроса[0].Выбрать();
	Пока ВыборкаСостояний.Следующий() Цикл
		СостоянияДокументов.Вставить(ВыборкаСостояний.ЭлектронныйДокумент, ВыборкаСостояний.Состояние);
		Если Не ЗначениеЗаполнено(ДатаПервогоДокумента)
			ИЛИ ВыборкаСостояний.Дата < ДатаПервогоДокумента Тогда
			ДатаПервогоДокумента = ВыборкаСостояний.Дата;
		КонецЕсли;
	КонецЦикла;
	
	ВыборкаДокумента = РезультатыЗапроса[1].Выбрать();
	Если ВыборкаДокумента.Следующий() Тогда
		Если Не ЗначениеЗаполнено(ДатаПервогоДокумента)
			ИЛИ ВыборкаДокумента.Дата < ДатаПервогоДокумента Тогда
			ДатаПервогоДокумента = ВыборкаСостояний.Дата;
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеПакета = Неопределено;
	
	ВыборкаПакета = РезультатыЗапроса[2].Выбрать();
	Если Не ВыборкаПакета.Следующий()
		ИЛИ ВыборкаПакета.Дата > ДатаПервогоДокумента Тогда
		ВыборкаДокумента.Сбросить();
		Если ВыборкаДокумента.Следующий() Тогда
			ОписаниеПакета = НовоеОписаниеПакета();
			ОписаниеПакета.ИдентификаторПакета = ИдентификаторПакета;
			ОписаниеПакета.Организация = ВыборкаДокумента.Организация;
			ОписаниеПакета.Контрагент = ВыборкаДокумента.Контрагент;
			ОписаниеПакета.ДоговорКонтрагента = ВыборкаДокумента.ДоговорКонтрагента;
			ОписаниеПакета.Дата = ДатаПервогоДокумента;
		КонецЕсли;
	КонецЕсли;
	
	Выборка = РезультатыЗапроса[3].Выбрать();
	Если Выборка.Следующий() Тогда
		СостоянияДокументов.Вставить(Выборка.ЭлектронныйДокумент, Выборка.Состояние);
	КонецЕсли;
	
	Параметры = Новый Структура;
	Параметры.Вставить("СостоянияДокументов", СостоянияДокументов);
	Параметры.Вставить("ОписаниеПакета", ОписаниеПакета);
	
	Возврат Параметры;
	
КонецФункции

Функция ИзменениеСоставаПакетаНедоступно(СостоянияДокументов, КонтекстДиагностики = Неопределено)
	
	Результат = Ложь;
	
	СостоянияИзмененияПакета = СостоянияДокументовДляИзмененияПакета();
	
	БлокирующиеДокументы = Новый Массив;
	
	Для Каждого СостояниеДокумента Из СостоянияДокументов Цикл
		Если СостоянияИзмененияПакета.Найти(СостояниеДокумента.Значение) = Неопределено Тогда
			Результат = Истина;
			БлокирующиеДокументы.Добавить(СостояниеДокумента.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Если КонтекстДиагностики <> Неопределено И Результат Тогда
		СвойстваДокументов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(БлокирующиеДокументы,
			"ВидДокумента, НомерДокумента, ДатаДокумента");
		ПредставленияДокументов = Новый Массив;
		Для Каждого СвойстваДокумента Из СвойстваДокументов Цикл
			ПредставленияДокументов.Добавить(ПредставлениеДокументаПоСвойствам(СвойстваДокумента.Значение));
		КонецЦикла;
		ВидОперации = НСтр("ru = 'Изменение состава пакета документов'");
		КраткоеПредставление = НСтр("ru = 'Изменение состава пакета недоступно.'");
		ПодробноеПредставление = СтрШаблон(
			НСтр("ru = 'Изменение состава пакета доступно для документов в состоянии: %1.
			|Документы %2 находятся в другом состоянии.'"),
			СтрСоединить(СостоянияИзмененияПакета, ", "),
			СтрСоединить(ПредставленияДокументов, ", "));
		Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации, ВидОшибкиИзменениеСоставаПакетаНедоступно(),
			ПодробноеПредставление, КраткоеПредставление);
		ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
		ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СостоянияДокументовДляИзмененияПакета()
	СостоянияИзмененияПакета = Новый Массив;
	СостоянияИзмененияПакета.Добавить(Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание);
	СостоянияИзмененияПакета.Добавить(Перечисления.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправке);
	Возврат СостоянияИзмененияПакета;
КонецФункции

Функция ВидОшибкиИзменениеСоставаПакетаНедоступно()
	
	ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.НовоеОписаниеВидаОшибки();
	ВидОшибки.Идентификатор = "ИзменениеСоставаПакетаНедоступно";
	ВидОшибки.ЗаголовокПроблемы = НСтр("ru = 'Изменение пакета недоступно'");
	
	Возврат ВидОшибки;
	
КонецФункции

Процедура ДобавитьОшибкуИзмененияСоставаПакетаИсходящегоЭДО(КонтекстДиагностики, ВидОперации, ИдентификаторПакета, ЭлектронныйДокумент, ТекстОшибки)
	
	Если КонтекстДиагностики = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка();
	
	СвойстваДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйДокумент,
		"ВидДокумента, НомерДокумента, ДатаДокумента, ИдентификаторДокументооборота, Номер");
	КраткоеПредставление = СтрШаблон(НСтр("ru = 'Не удалось выполнить %1 для %2.'"),
		НРег(ВидОперации), ПредставлениеДокументаПоСвойствам(СвойстваДокумента));
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(КраткоеПредставление);
	МассивСтрок.Добавить(СтрШаблон(НСтр("ru = 'Идентификатор пакета: %1'"), ИдентификаторПакета));
	МассивСтрок.Добавить(СтрШаблон(НСтр("ru = 'Внутренний номер документа: %1'"), СвойстваДокумента.Номер));
	МассивСтрок.Добавить(СтрШаблон(НСтр("ru = 'Идентификатор документооборота: %1'"),
		СвойстваДокумента.ИдентификаторДокументооборота));
	МассивСтрок.Добавить(ТекстОшибки);
	ПодробноеПредставление = СтрСоединить(МассивСтрок, Символы.ПС);
	
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации, ВидОшибки, ПодробноеПредставление, КраткоеПредставление);
	ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	
КонецПроцедуры

Процедура ДобавитьОшибкуИзмененияСоставаПакетаВходящегоЭДО(КонтекстДиагностики, ВидОперации, ЭлектронныйДокумент)
		
	Если КонтекстДиагностики = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВидОшибки = ВидОшибкиИзменениеСоставаПакетаНедоступно();
	
	КраткоеПредставление = СтрШаблон(НСтр("ru = 'Не удалось выполнить %1 для %2.'"),
		НРег(ВидОперации), ПредставлениеДокумента(ЭлектронныйДокумент));
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(КраткоеПредставление);
	МассивСтрок.Добавить(НСтр("ru = 'Изменение состава пакета входящих документов недоступно.'"));
	ПодробноеПредставление = СтрСоединить(МассивСтрок, Символы.ПС);
	
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации, ВидОшибки, ПодробноеПредставление, КраткоеПредставление);
	ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	
КонецПроцедуры

Функция ВидОшибкиДокументыВСоставеДругогоПакета()
	
	ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.НовоеОписаниеВидаОшибки();
	ВидОшибки.Идентификатор = "ДокументыВСоставеДругогоПакета";
	ВидОшибки.ЗаголовокПроблемы = НСтр("ru = 'Документы в составе другого пакета'");
	
	Возврат ВидОшибки;

КонецФункции

Процедура ДобавитьОшибкуДокументыВСоставеДругогоПакета(ДокументыВСоставеДругогоПакета, КонтекстДиагностики)
	
	ВидОперации = НСтр("ru = 'Создание пакета документов'");
	
	ВидОшибки = ВидОшибкиДокументыВСоставеДругогоПакета();
	
	КраткоеПредставление = НСтр("ru = 'Не удалось создать пакет документов по причине:
		|электронные документы входят в состав другого пакета.'");
	
	ПредставленияДокументов = Новый Массив;
	Для Каждого ЭлектронныйДокумент Из ДокументыВСоставеДругогоПакета Цикл
		ПредставленияДокументов.Добавить(ПредставлениеДокумента(ЭлектронныйДокумент));
	КонецЦикла;
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(КраткоеПредставление);
	МассивСтрок.Добавить(СтрСоединить(ПредставленияДокументов, ", "));
	ПодробноеПредставление = СтрСоединить(МассивСтрок, Символы.ПС);
	
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации, ВидОшибки, ПодробноеПредставление, КраткоеПредставление);
	ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	
КонецПроцедуры

Процедура ОбновитьОписаниеПакета(ОписаниеПакета)
	НоваяЗапись = РегистрыСведений.ПакетыДокументовЭДО.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(НоваяЗапись, ОписаниеПакета);
	НоваяЗапись.Записать();
КонецПроцедуры

Функция СостоянияДокументовПакетаОднородны(МассивСостояний, ИдентификаторПакета, Действие, КонтекстДиагностики)
	
	Если РегламентыЭДО.СостояниеПакета(МассивСостояний) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПредставлениеДействия = НРег(Действие);
	ВидОперации = ВидОперацииПриДобавленииОшибки(ПредставлениеДействия);
	ВидОшибки = ВидОшибкиСостоянияДокументовПакетаНеоднородны();
	
	КраткоеПредставление = СтрШаблон(НСтр("ru = 'Операция ""%1"" недоступна для документов пакета.
		|Состояния документов пакета неоднородны.'"), ПредставлениеДействия);
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(КраткоеПредставление);
	МассивСтрок.Добавить(СтрШаблон(НСтр("ru = 'Идентификатор пакета: %1'"), ИдентификаторПакета));
	ПодробноеПредставление = СтрСоединить(МассивСтрок, Символы.ПС);
	
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации, ВидОшибки, ПодробноеПредставление, КраткоеПредставление);
	ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	
	Возврат Ложь;
	
КонецФункции

Функция ТекстЗапросаНабораСостоянийДокументов()
	Возврат 
		"ВЫБРАТЬ
		|	СостоянияДокументовЭДО.Состояние
		|ИЗ
		|	РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|ГДЕ
		|	СостоянияДокументовЭДО.ЭлектронныйДокумент В (&ЭлектронныеДокументы)";
КонецФункции

Функция ТекстЗапросаИдентификатораПакетаДокумента()
	Возврат 
		"ВЫБРАТЬ
		|	СоставПакетовЭлектронныхДокументов.ИдентификаторПакета КАК ИдентификаторПакета
		|ИЗ
		|	РегистрСведений.СоставПакетовДокументовЭДО КАК СоставПакетовЭлектронныхДокументов
		|ГДЕ
		|	СоставПакетовЭлектронныхДокументов.ЭлектронныйДокумент = &ЭлектронныйДокумент";
КонецФункции

Функция НаборСостоянийДокументов(ЭлектронныеДокументы)
	Запрос = Новый Запрос(ТекстЗапросаНабораСостоянийДокументов());
	Запрос.УстановитьПараметр("ЭлектронныеДокументы", ЭлектронныеДокументы);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Состояние")
КонецФункции

Функция НовыйОтборСообщенийДокументов()
	Отбор = Новый Структура;
	Отбор.Вставить("Состояние", "");
	Отбор.Вставить("ТипЭлементаРегламента", "");
	Возврат Отбор;
КонецФункции

Функция ТекстЗапросаСообщенийДокументов(Отбор = Неопределено)
	
	ТекстЗапроса =  
		"ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент В (&ЭлектронныеДокументы)
		|	И &УсловиеОтбора";
	
	Если ТекстЗапроса = Неопределено Тогда
		Возврат ТекстЗапроса;
	КонецЕсли;
	
	УсловиеОтбора = Новый Массив;
	Если ЗначениеЗаполнено(Отбор.Состояние) Тогда
		УсловиеОтбора.Добавить("СообщениеЭДО.Состояние " + Отбор.Состояние);
	КонецЕсли;
	Если ЗначениеЗаполнено(Отбор.ТипЭлементаРегламента) Тогда
		УсловиеОтбора.Добавить("СообщениеЭДО.ТипЭлементаРегламента " + Отбор.ТипЭлементаРегламента);
	КонецЕсли;
	Если ЗначениеЗаполнено(УсловиеОтбора) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбора", СтрСоединить(УсловиеОтбора, " И "));
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВидОшибкиСостоянияДокументовПакетаНеоднородны()
	
	ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.НовоеОписаниеВидаОшибки();
	ВидОшибки.Идентификатор = "СостоянияДокументовПакетаНеоднородны";
	ВидОшибки.ЗаголовокПроблемы = НСтр("ru = 'Состояние документов пакета неоднородно'");
	ВидОшибки.ОписаниеРешения = НСтр("ru = 'Выполнить действие отдельно для электронного документа'");
	
	Возврат ВидОшибки;
	
КонецФункции

#КонецОбласти

#Область ОбработкаДействийПоЭДО

#Область ОбщегоНазначения

Процедура ПродолжитьВыполнениеДействийПоЭДО(ПараметрыВыполнения, РезультатДействий)
	
	Если ВыполнениеДействийПоЭДОЗапрещено(РезультатДействий.КонтекстДиагностики) Тогда
		Возврат;
	КонецЕсли;
	
	НаборДействий = ПараметрыВыполнения.НаборДействий;
	
	Если НачатьДействие(НаборДействий, Перечисления.ДействияПоЭДО.ЗакрытьПринудительно) Тогда
		
		ВыполнитьДействиеЗакрыть(ПараметрыВыполнения, РезультатДействий);
		
	КонецЕсли;
	
	Если НачатьДействие(НаборДействий, Перечисления.ДействияПоЭДО.ВернутьВРаботу) Тогда
		
		ВыполнитьДействиеВернутьВРаботу(ПараметрыВыполнения, РезультатДействий);
		
	КонецЕсли;
	
	Если НачатьДействие(НаборДействий, Перечисления.ДействияПоЭДО.ОтправитьВАрхив) Тогда
		
		ВыполнитьДействиеОтправитьВАрхив(ПараметрыВыполнения, РезультатДействий);
		
	КонецЕсли;
	
	Если НачатьДействие(НаборДействий, Перечисления.ДействияПоЭДО.ОтклонитьПодписание) Тогда
		
		ВыполнитьДействиеОтклонитьПодписание(ПараметрыВыполнения, РезультатДействий);
		
	КонецЕсли;
	
	Если НачатьДействие(НаборДействий, Перечисления.ДействияПоЭДО.Сформировать) Тогда
		
		ВыполнитьДействиеСформировать(ПараметрыВыполнения, РезультатДействий);
		
		Если ЗначениеЗаполнено(РезультатДействий.ОшибкиФормирования) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НачатьДействие(НаборДействий, Перечисления.ДействияПоЭДО.СформироватьИсправление) Тогда
		
		ВыполнитьДействиеСформироватьИсправление(ПараметрыВыполнения, РезультатДействий);
		
		Если ЗначениеЗаполнено(РезультатДействий.ОшибкиФормирования) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НачатьДействие(НаборДействий, Перечисления.ДействияПоЭДО.Переформировать) Тогда
		
		ВыполнитьДействиеПереформировать(ПараметрыВыполнения, РезультатДействий);
		
		Если ЗначениеЗаполнено(РезультатДействий.ОшибкиФормирования) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НачатьДействие(НаборДействий, Перечисления.ДействияПоЭДО.Отклонить) Тогда
		
		ВыполнитьДействиеОтклонить(ПараметрыВыполнения, РезультатДействий);
		
	КонецЕсли;
	
	Если НачатьДействие(НаборДействий, Перечисления.ДействияПоЭДО.Аннулировать) Тогда
		
		ВыполнитьДействиеАннулировать(ПараметрыВыполнения, РезультатДействий);
		
	КонецЕсли;
	
	Если НачатьДействие(НаборДействий, Перечисления.ДействияПоЭДО.ПринятьАннулирование) Тогда
		
		ВыполнитьДействиеПринятьАннулирование(ПараметрыВыполнения, РезультатДействий);
		
	КонецЕсли;
	
	Если НачатьДействие(НаборДействий, Перечисления.ДействияПоЭДО.ОтклонитьАннулирование) Тогда
		
		ВыполнитьДействиеОтклонитьАннулирование(ПараметрыВыполнения, РезультатДействий);
		
	КонецЕсли;
	
	Если НачатьДействие(НаборДействий, Перечисления.ДействияПоЭДО.Перенаправить) Тогда
		
		ВыполнитьДействиеПеренаправить(ПараметрыВыполнения, РезультатДействий);
		
	КонецЕсли;
	
	Если НачатьДействие(НаборДействий, Перечисления.ДействияПоЭДО.Утвердить) Тогда
		
		ВыполнитьДействиеУтвердить(ПараметрыВыполнения, РезультатДействий);
		
	КонецЕсли;
	
	Если НачатьДействие(НаборДействий, Перечисления.ДействияПоЭДО.СформироватьОтвет) Тогда
		
		ВыполнитьДействиеСформироватьОтвет(ПараметрыВыполнения, РезультатДействий);
		
	КонецЕсли;
	
	Если НачатьДействие(НаборДействий, Перечисления.ДействияПоЭДО.Подписать) Тогда
		
		ВыполнитьДействиеПодписать(ПараметрыВыполнения, РезультатДействий);
		
		Если ЗначениеЗаполнено(РезультатДействий.КонтекстПодписания) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НачатьДействие(НаборДействий, Перечисления.ДействияПоЭДО.ОтменитьОтправку) Тогда
		
		ВыполнитьДействиеОтменитьОтправку(ПараметрыВыполнения, РезультатДействий);
		
	КонецЕсли;
	
	Если НачатьДействие(НаборДействий, Перечисления.ДействияПоЭДО.ПодготовитьКОтправке) Тогда
		
		ВыполнитьДействиеПодготовитьКОтправке(ПараметрыВыполнения, РезультатДействий);
		
		Если ЗначениеЗаполнено(РезультатДействий.КонтекстОтправки) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НачатьДействие(НаборДействий, Перечисления.ДействияПоЭДО.Отправить) Тогда
		
		ВыполнитьДействиеОтправить(ПараметрыВыполнения, РезультатДействий);
		
		Если ЗначениеЗаполнено(РезультатДействий.КонтекстОтправки) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция НовыйРезультатДействийПоЭДО(КонтекстДиагностики)
	РезультатДействий = Новый Структура;
	РезультатДействий.Вставить("Итог", ЭлектронныеДокументыЭДОКлиентСервер.НовыйИтогВыполненияДействийПоЭДО());
	РезультатДействий.Вставить("ОшибкиФормирования", Новый Массив);
	РезультатДействий.Вставить("КонтекстДиагностики", КонтекстДиагностики);
	РезультатДействий.Вставить("КонтекстПодписания", Неопределено);
	РезультатДействий.Вставить("КонтекстОтправки", Неопределено);
	Возврат РезультатДействий;
КонецФункции

Процедура ЗаполнитьИтогВыполненияДействияПоЭДО(ИтогДействийПоЭДО, Действие, ЭлектронныйДокумент)
	
	ИтогДействийПоЭДО.ОбработанныеДокументы.Вставить(ЭлектронныйДокумент, Истина);
	
	Обработано = ИтогДействийПоЭДО.ОбработаноПоДействиям[Действие];
	ИтогДействийПоЭДО.ОбработаноПоДействиям.Вставить(Действие, ?(Обработано = Неопределено, 1, Обработано + 1));
	
КонецПроцедуры

Функция ОтсутствуютОбъектыДействий(ОбъектыДействий)
	Для Каждого Элемент Из ОбъектыДействий Цикл
		Если ЗначениеЗаполнено(Элемент.Значение) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

Процедура ЗаполнитьОтпечакиСертификатов(ПараметрыВыполнения, КонтекстДиагностики)
	
	Если Не ЕстьДействие(ПараметрыВыполнения.НаборДействий, Перечисления.ДействияПоЭДО.Подписать)
		И Не ЕстьДействие(ПараметрыВыполнения.НаборДействий, Перечисления.ДействияПоЭДО.Отправить) Тогда
		Возврат;
	КонецЕсли;
	
	ВидОперации = НСтр("ru = 'Выполнение действий по ЭДО'");
	ПараметрыВыполнения.ОтпечаткиСертификатов = КриптографияБЭД.ПолучитьОтпечаткиСертификатов(ВидОперации,
		Неопределено, ПараметрыВыполнения.ОтпечаткиСертификатов);
	
КонецПроцедуры

Функция ЕстьДействие(НаборДействий, Действие)
	Возврат ЭлектронныеДокументыЭДОКлиентСервер.ЕстьДействие(НаборДействий, Действие);
КонецФункции

Процедура ОтметитьНачалоОбработкиДействия(НаборДействий, Действие)
	НаборДействий.Вставить(Действие, Ложь);
КонецПроцедуры

Функция НачатьДействие(НаборДействий, Действие)
	ЕстьДействие = ЭлектронныеДокументыЭДОКлиентСервер.ЕстьДействие(НаборДействий, Действие);
	Если ЕстьДействие Тогда
		ОтметитьНачалоОбработкиДействия(НаборДействий, Действие);
	КонецЕсли;
	Возврат ЕстьДействие;
КонецФункции

Функция НовыйОтборСообщенийДляОбработкиДействия()
	Отбор = Новый Структура;
	Отбор.Вставить("Состояние", Новый Массив);
	Отбор.Вставить("ТипЭлементаРегламента", Новый Массив);
	Отбор.Вставить("ИспользоватьИдентификаторыОрганизаций", Ложь);
	Возврат Отбор;
КонецФункции

Функция ЗапросСообщенийДляОбработкиДействия(ОбъектыДействий, Отбор, ИмяВременнойТаблицы = "", СвойстваСообщения = "Ссылка")
	
	ОписаниеЗапроса = ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса();
	
	МеткаВременнойТаблицы = "ПОМЕСТИТЬ ИмяВременнойТаблицы";
	ЗначениеВременнойТаблицы = "";
	Если ЗначениеЗаполнено(ИмяВременнойТаблицы) Тогда
		ЗначениеВременнойТаблицы = СтрЗаменить(МеткаВременнойТаблицы, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	КонецЕсли;
	
	ТекстыЗапросов = Новый Массив;
	ТекстыВспомогательныхЗапросов = Новый Массив;
	
	Если ЗначениеЗаполнено(ОбъектыДействий.ОбъектыУчета) Тогда
		
		ОтборДокументов = ИнтеграцияЭДО.НовыйОтборАктуальныхЭлектронныхДокументов();
		ОтборДокументов.ОбъектыУчета = "&ОтборОбъектыУчета";
		ТекстыВспомогательныхЗапросов.Добавить(ИнтеграцияЭДО.ЗапросАктуальныхЭлектронныхДокументов(
			"ЭлектронныеДокументыОбъектовУчета", ОтборДокументов).Текст);
		
		ОписаниеЗапроса.СлужебныеПараметры.Вставить("ОтборОбъектыУчета", ОбъектыДействий.ОбъектыУчета);
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	&СвойстваСообщения
			|ПОМЕСТИТЬ ИмяВременнойТаблицы
			|ИЗ
			|	Документ.СообщениеЭДО КАК СообщениеЭДО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЭлектронныеДокументыОбъектовУчета КАК ЭлектронныеДокументыОбъектовУчета
			|		ПО СообщениеЭДО.ЭлектронныйДокумент = ЭлектронныеДокументыОбъектовУчета.ЭлектронныйДокумент
			|		И &УсловиеОтбора";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, МеткаВременнойТаблицы,
			?(ЗначениеЗаполнено(ТекстыЗапросов), "", ЗначениеВременнойТаблицы));
		
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектыДействий.ЭлектронныеДокументы) Тогда
		
		ОписаниеЗапроса.СлужебныеПараметры.Вставить("ОтборЭлектронныеДокументы", ОбъектыДействий.ЭлектронныеДокументы);
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	&СвойстваСообщения
			|ПОМЕСТИТЬ ИмяВременнойТаблицы
			|ИЗ
			|	Документ.СообщениеЭДО КАК СообщениеЭДО
			|ГДЕ
			|	СообщениеЭДО.ЭлектронныйДокумент В (&ОтборЭлектронныеДокументы)
			|	И &УсловиеОтбора";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, МеткаВременнойТаблицы,
			?(ЗначениеЗаполнено(ТекстыЗапросов), "", ЗначениеВременнойТаблицы));
		
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектыДействий.Сообщения) Тогда
		
		ОписаниеЗапроса.СлужебныеПараметры.Вставить("ОтборСообщения", ОбъектыДействий.Сообщения);
		
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	&СвойстваСообщения
			|ПОМЕСТИТЬ ИмяВременнойТаблицы
			|ИЗ
			|	Документ.СообщениеЭДО КАК СообщениеЭДО
			|ГДЕ
			|	СообщениеЭДО.Ссылка В (&ОтборСообщения)
			|	И &УсловиеОтбора";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, МеткаВременнойТаблицы,
			?(ЗначениеЗаполнено(ТекстыЗапросов), "", ЗначениеВременнойТаблицы));
		
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если Отбор.ИспользоватьИдентификаторыОрганизаций
		И ЗначениеЗаполнено(ОбъектыДействий.ИдентификаторыОрганизаций) Тогда
		
		ОписаниеЗапроса.СлужебныеПараметры.Вставить("ИдентификаторыОрганизаций", ОбъектыДействий.ИдентификаторыОрганизаций);
		
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	&СвойстваСообщения
			|ПОМЕСТИТЬ ИмяВременнойТаблицы
			|ИЗ
			|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
			|		ПО ЭлектронныйДокументИсходящийЭДО.Ссылка = СообщениеЭДО.ЭлектронныйДокумент
			|		И &УсловиеОтбора
			|ГДЕ
			|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторОрганизации В (&ИдентификаторыОрганизаций)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&СвойстваСообщения
			|ИЗ
			|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
			|		ПО ЭлектронныйДокументВходящийЭДО.Ссылка = СообщениеЭДО.ЭлектронныйДокумент
			|		И &УсловиеОтбора
			|ГДЕ
			|	ЭлектронныйДокументВходящийЭДО.ИдентификаторОрганизации В (&ИдентификаторыОрганизаций)";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, МеткаВременнойТаблицы,
			?(ЗначениеЗаполнено(ТекстыЗапросов), "", ЗначениеВременнойТаблицы));
		
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	ОписаниеЗапроса.Текст = СтрСоединить(ТекстыЗапросов, "
		|
		|ОБЪЕДИНИТЬ
		|");
	
	УстановитьПоляВыбораСвойствСообщенийДляОбработкиДействия(ОписаниеЗапроса, СвойстваСообщения);
	
	УстановитьУсловиеОтбораСообщенийДляОбработкиДействия(ОписаниеЗапроса, Отбор);
	
	Если ЗначениеЗаполнено(ТекстыВспомогательныхЗапросов) Тогда
		ТекстыВспомогательныхЗапросов.Добавить(ОписаниеЗапроса.Текст);
		ОписаниеЗапроса.Текст = СтрСоединить(ТекстыВспомогательныхЗапросов,
			ОбщегоНазначения.РазделительПакетаЗапросов());
	КонецЕсли;
	
	Возврат ОписаниеЗапроса;
	
КонецФункции

Процедура УстановитьПоляВыбораСвойствСообщенийДляОбработкиДействия(ОписаниеЗапроса, СвойстваСообщения)
	
	ПоляВыбора = Новый Массив;
	СтруктураСвойств = Новый Структура(СвойстваСообщения);
	Разделитель = "," + Символы.ПС;
	Для Каждого Элемент Из СтруктураСвойств Цикл
		ПоляВыбора.Добавить("СообщениеЭДО." + Элемент.Ключ);
	КонецЦикла;
	ОписаниеЗапроса.Текст = СтрЗаменить(ОписаниеЗапроса.Текст, "&СвойстваСообщения", СтрСоединить(ПоляВыбора, Разделитель));
	
КонецПроцедуры

Процедура УстановитьУсловиеОтбораСообщенийДляОбработкиДействия(ОписаниеЗапроса, Отбор)
	
	УсловиеОтбора = Новый Массив;
	
	ДобавитьУсловиеОтбораСообщенийДляОбработкиДействия(ОписаниеЗапроса, УсловиеОтбора, Отбор, "Состояние");
	
	ДобавитьУсловиеОтбораСообщенийДляОбработкиДействия(ОписаниеЗапроса, УсловиеОтбора, Отбор, "ТипЭлементаРегламента");
	
	Если ЗначениеЗаполнено(УсловиеОтбора) Тогда
		ОписаниеЗапроса.Текст = СтрЗаменить(ОписаниеЗапроса.Текст, "&УсловиеОтбора", СтрСоединить(УсловиеОтбора, " И "));
	Иначе
		ОписаниеЗапроса.СлужебныеПараметры.Вставить("УсловиеОтбора", Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьУсловиеОтбораСообщенийДляОбработкиДействия(ОписаниеЗапроса, УсловиеОтбора, Отбор, ИмяСвойства)
	ЗначениеОтбора = Отбор[ИмяСвойства];
	КоличествоЗначений = ЗначениеОтбора.Количество();
	Если КоличествоЗначений = 0 Тогда
		Возврат;
	КонецЕсли;
	ИмяПараметра = "Отбор" + ИмяСвойства;
	ОдноЗначение = КоличествоЗначений = 1;
	УсловиеОтбора.Добавить(СтрШаблон("СообщениеЭДО.%1 %2 (&%3)", ИмяСвойства, ?(ОдноЗначение,"=","В"), ИмяПараметра));
	ОписаниеЗапроса.СлужебныеПараметры.Вставить(ИмяПараметра, ?(ОдноЗначение, ЗначениеОтбора[0], ЗначениеОтбора));
КонецПроцедуры

Функция ВыборкаСообщенийДляОбработкиДействия(ОбъектыДействий, Отбор)
	ОписаниеЗапроса = ЗапросСообщенийДляОбработкиДействия(ОбъектыДействий, Отбор);
	Возврат ОбщегоНазначенияБЭД.ВыполнитьЗапрос(ОписаниеЗапроса).Выбрать();
КонецФункции

Функция ВыборкаДокументовДляОбработкиДействия(ОбъектыДействий)
	Отбор = НовыйОтборСообщенийДляОбработкиДействия();
	Отбор.ТипЭлементаРегламента.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);
	ОписаниеЗапроса = ЗапросСообщенийДляОбработкиДействия(ОбъектыДействий, Отбор,,"ЭлектронныйДокумент");
	Возврат ОбщегоНазначенияБЭД.ВыполнитьЗапрос(ОписаниеЗапроса).Выбрать();
КонецФункции

Функция СвойстваФайлаОснованияСлужебногоДокумента()
	Свойства = Новый Структура;
	Свойства.Вставить("Ссылка", Справочники.СообщениеЭДОПрисоединенныеФайлы.ПустаяСсылка());
	Свойства.Вставить("ПолноеИмяФайла", "");
	Свойства.Вставить("ДатаСоздания", Дата(1,1,1));
	Возврат Свойства;
КонецФункции

Функция СоздатьСлужебноеСообщение(ПараметрыДокумента, СвойстваФайлаОснования, ТипДокумента, ТипЭлементаРегламента, Комментарий = "")
	
	ОписаниеСообщения = ОписаниеСлужебногоСообщения(ПараметрыДокумента, СвойстваФайлаОснования,
		ТипДокумента, ТипЭлементаРегламента, Комментарий);
	
	Если ОписаниеСообщения.Данные.ЕстьОшибки Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СообщениеОбъект = СоздатьСообщение(ОписаниеСообщения, ПараметрыДокумента.Ссылка, ПараметрыДокумента);
	
	Возврат СообщениеОбъект;
	
КонецФункции

Функция ТекстЗапросаСвойствОсновногоФайла()
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПрисоединенныеФайлы.Ссылка,
		|	ПрисоединенныеФайлы.ПолноеИмяФайла,
		|	ПрисоединенныеФайлы.ДатаСоздания
		|ИЗ
		|	Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|ГДЕ
		|	ПрисоединенныеФайлы.Ссылка = &ОсновнойФайл";
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапросаСвойствСообщенияИнформацииОтправителя()
	Возврат
		"ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка,
		|	СообщениеЭДО.Статус
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент
		|	И СообщениеЭДО.ТипЭлементаРегламента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя)";
КонецФункции

Функция КомментарийДействия(ПараметрыВыполнения, Действие)
	Комментарий = "";
	ДополнительныеПараметры = ПараметрыВыполнения.ДополнительныеПараметрыДействий[Действие];
	Если ДополнительныеПараметры <> Неопределено
		И ЗначениеЗаполнено(ДополнительныеПараметры.Комментарий) Тогда
		Комментарий = ДополнительныеПараметры.Комментарий;
	КонецЕсли;
	Возврат Комментарий;
КонецФункции

Функция ИмяТаблицыДокументаЭДО(ЭтоВходящийЭДО)
	Возврат ?(ЭтоВходящийЭДО, "Документ.ЭлектронныйДокументВходящийЭДО", "Документ.ЭлектронныйДокументИсходящийЭДО");
КонецФункции

Процедура ЗаблокироватьДанныеДокументаДляИзменения(ЭлектронныйДокумент, ЭтоВходящийЭДО)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Документ.СообщениеЭДО");
	ЭлементБлокировки.УстановитьЗначение("ЭлектронныйДокумент", ЭлектронныйДокумент);
	
	ИмяТаблицыДокумента = ИмяТаблицыДокументаЭДО(ЭтоВходящийЭДО);
	ЭлементБлокировки = Блокировка.Добавить(ИмяТаблицыДокумента);
	ЭлементБлокировки.УстановитьЗначение("Ссылка", ЭлектронныйДокумент);
	Блокировка.Заблокировать();
	
КонецПроцедуры

Процедура ЗаблокироватьДанныеСообщенияДляИзменения(СообщениеОбъект, ЭтоВходящийЭДО)
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("Документ.СообщениеЭДО");
	ЭлементБлокировки.УстановитьЗначение("ЭлектронныйДокумент", СообщениеОбъект.ЭлектронныйДокумент);
	
	ЭлементБлокировки = Блокировка.Добавить(ИмяТаблицыДокументаЭДО(ЭтоВходящийЭДО));
	ЭлементБлокировки.УстановитьЗначение("Ссылка", СообщениеОбъект.ЭлектронныйДокумент);
	
	Блокировка.Заблокировать();
	
КонецПроцедуры

Процедура ЗаблокироватьПакетДокументовДляИзменения(ИдентификаторПакета)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПакетыДокументовЭДО");
	ЭлементБлокировки.УстановитьЗначение("ИдентификаторПакета", ИдентификаторПакета);
	Блокировка.Заблокировать();
	
КонецПроцедуры

Процедура ЗаблокироватьДокументыПакетаДляИзменения(ДокументыПакета)
	
	Блокировка = Новый БлокировкаДанных;
	ИмяТаблицыДокументаЭДО = "";
	Для Каждого ЭлектронныйДокумент Из ДокументыПакета Цикл
		Если ПустаяСтрока(ИмяТаблицыДокументаЭДО) Тогда
			ЭтоВходящийЭДО = ЭтоВходящийЭДО(ЭлектронныйДокумент);
			ИмяТаблицыДокументаЭДО = ИмяТаблицыДокументаЭДО(ЭтоВходящийЭДО);
		КонецЕсли;
		ЭлементБлокировки = Блокировка.Добавить(ИмяТаблицыДокументаЭДО);
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ЭлектронныйДокумент);
	КонецЦикла;
	Блокировка.Заблокировать();
	
КонецПроцедуры

Процедура ЗаблокироватьСообщенияПакетаДляИзменения(ДокументыПакета)
	
	Блокировка = Новый БлокировкаДанных;
	ИмяТаблицыДокументаЭДО = "";
	Для Каждого ЭлектронныйДокумент Из ДокументыПакета Цикл
		Если ПустаяСтрока(ИмяТаблицыДокументаЭДО) Тогда
			ЭтоВходящийЭДО = ЭтоВходящийЭДО(ЭлектронныйДокумент);
			ИмяТаблицыДокументаЭДО = ИмяТаблицыДокументаЭДО(ЭтоВходящийЭДО);
		КонецЕсли;
		ЭлементБлокировки = Блокировка.Добавить(ИмяТаблицыДокументаЭДО);
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ЭлектронныйДокумент);
		
		ЭлементБлокировки = Блокировка.Добавить("Документ.СообщениеЭДО");
		ЭлементБлокировки.УстановитьЗначение("ЭлектронныйДокумент", ЭлектронныйДокумент);
	КонецЦикла;
	Блокировка.Заблокировать();
	
КонецПроцедуры

Функция ДокументыПакетаДляИзменения(ПакетДокументов, Действие, КонтекстДиагностики)
	
	ЗаблокироватьПакетДокументовДляИзменения(ПакетДокументов);
	
	ДокументыПакета = ДокументыПакета(ПакетДокументов);
	
	ЗаблокироватьДокументыПакетаДляИзменения(ДокументыПакета);
	
	НаборСостояний = НаборСостоянийДокументов(ДокументыПакета);
	
	Если Не СостоянияДокументовПакетаОднородны(НаборСостояний, ПакетДокументов, Действие, КонтекстДиагностики) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДокументыПакета;
	
КонецФункции

Функция СообщенияПакетаДляИзменения(ПакетДокументов, Действие, КонтекстДиагностики, Состояние = Неопределено, ТипЭлементаРегламента = Неопределено)
	
	ЗаблокироватьПакетДокументовДляИзменения(ПакетДокументов);
	
	ДокументыПакета = ДокументыПакета(ПакетДокументов);
	
	ЗаблокироватьСообщенияПакетаДляИзменения(ДокументыПакета);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭлектронныеДокументы", ДокументыПакета);
	
	Отбор = НовыйОтборСообщенийДокументов();
	Если ЗначениеЗаполнено(Состояние) Тогда
		Отбор.Состояние = "= &Состояние";
		Запрос.УстановитьПараметр("Состояние", Состояние);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТипЭлементаРегламента) Тогда
		Отбор.ТипЭлементаРегламента = "= &ТипЭлементаРегламента";
		Запрос.УстановитьПараметр("ТипЭлементаРегламента", ТипЭлементаРегламента);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапросаСообщенийДокументов(Отбор);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти

#Область РаботаСМаршрутамиПодписания

Функция СписокПодписантовИнтеркампани(Отправитель, Получатель)
	
	СписокПодписантов = Новый ТаблицаЗначений;
	СписокПодписантов.Колонки.Добавить("Подписант", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	СписокПодписантов.Колонки.Добавить("Сертификат", 
		Новый ОписаниеТипов("СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования"));
	СписокПодписантов.Колонки.Добавить("Организация", Метаданные.ОпределяемыеТипы.Организация.Тип);
	
	СписокПодписантов.Добавить().Организация = Отправитель;
	СписокПодписантов.Добавить().Организация = Получатель;
	
	Возврат СписокПодписантов;
	
КонецФункции

Функция НовыеПараметрыМаршрутаПодписания()
	ПараметрыМаршрута = Новый Структура;
	ПараметрыМаршрута.Вставить("ВесМаршрута", 0);
	ПараметрыМаршрута.Вставить("ТаблицаПодписания", Новый ТаблицаЗначений);
	Возврат ПараметрыМаршрута;
КонецФункции

Функция СформироватьМаршрутПодписания(СвойстваСообщения, МаршрутПодписания = Неопределено, СписокПодписантов = Неопределено)
	
	ПараметрыМаршрута = НовыеПараметрыМаршрутаПодписания();
	
	Если СвойстваСообщения.Состояние <> Перечисления.СостоянияСообщенийЭДО.Подписание Тогда
		Возврат ПараметрыМаршрута;
	КонецЕсли;
	
	Если МаршрутПодписания = Неопределено Тогда
		МаршрутПодписания = МаршрутыПодписанияБЭД.МаршрутОднойДоступнойПодписью();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СписокПодписантов) Тогда
		ПараметрыМаршрута.ТаблицаПодписания = МаршрутыПодписанияБЭД.СформироватьМаршрутПодписанияЭД(
			СвойстваСообщения.Ссылка, МаршрутПодписания, Перечисления.ТребованияКПодписаниюЭД.И,
			СписокПодписантов, ПараметрыМаршрута.ВесМаршрута);
	Иначе
		ПараметрыМаршрута.ТаблицаПодписания = МаршрутыПодписанияБЭД.СформироватьМаршрутПодписанияЭД(
			СвойстваСообщения.Ссылка, МаршрутПодписания,,,ПараметрыМаршрута.ВесМаршрута);
	КонецЕсли;
	
	Возврат ПараметрыМаршрута;
	
КонецФункции

Функция ОбновитьМаршрутПодписания(СвойстваДокумента, Сертификат)
	
	ПараметрыМаршрута = НовыеПараметрыМаршрутаПодписания();
	
	Если СвойстваДокумента.Состояние <> Перечисления.СостоянияСообщенийЭДО.Подписание Тогда
		Возврат ПараметрыМаршрута;
	КонецЕсли;
	
	ПараметрыМаршрута.ТаблицаПодписания = МаршрутыПодписанияБЭД.ОбновитьМаршрутПриПодписании(СвойстваДокумента.Ссылка,
		Сертификат, ПараметрыМаршрута.ВесМаршрута);
	
	Возврат ПараметрыМаршрута;
	
КонецФункции

Процедура ОповеститьОДокументеКПодписанию(СообщениеОбъект, ТаблицаПодписантов)
	
	Если Не ЗначениеЗаполнено(ТаблицаПодписантов) Тогда
		Возврат;
	КонецЕсли;
	
	ПодписантыДляОповещения = МаршрутыПодписанияБЭД.ПодписантыДляОповещения(ТаблицаПодписантов, СообщениеОбъект.Ссылка);
	Если Не ЗначениеЗаполнено(ПодписантыДляОповещения) Тогда
		Возврат;
	КонецЕсли;
	
	СписокДокументов = Новый СписокЗначений;
	СвойстваДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СообщениеОбъект.ЭлектронныйДокумент,
		"ВидДокумента, НомерДокумента, ДатаДокумента");
	СписокДокументов.Добавить(СообщениеОбъект.Ссылка, ПредставлениеДокументаПоСвойствам(СвойстваДокумента));
	
	ОповещенияОСобытияхЭДО.ОповеститьОДокументахКПодписанию(ПодписантыДляОповещения, СписокДокументов);
	
	Для Каждого Подписант Из ПодписантыДляОповещения Цикл
		МаршрутыПодписанияБЭД.ЗафиксироватьФактОповещенияУчастникаМаршрута(СообщениеОбъект.Ссылка, Подписант);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Сформировать

Процедура ВыполнитьДействиеСформировать(ПараметрыВыполнения, РезультатДействий)
	
	РезультатПроверки = ИнтеграцияЭДО.ПроверкаГотовностиКДокументообороту(
		ПараметрыВыполнения.ОбъектыДействий.ОбъектыУчета);
	
	РезультатыЗапросаНастроек = РезультатыЗапросаНастроекОбъектовУчета(ПараметрыВыполнения, РезультатПроверки.Готовые);
	
	НаборПараметровФормирования = ПараметрыФормирванияДокумента(ПараметрыВыполнения,
		РезультатыЗапросаНастроек, РезультатДействий);
	
	Если ЗначениеЗаполнено(РезультатДействий.ОшибкиФормирования) Тогда
		Возврат;
	КонецЕсли;
	
	ОбработанныеОбъектыУчета = Новый Соответствие;
	
	Для Каждого ПараметрыФормирвания Из НаборПараметровФормирования Цикл
		
		ОписаниеСообщения = ПараметрыФормирвания.ОписаниеСообщения;
		
		Если ОписаниеСообщения.Направление <> Перечисления.НаправленияЭДО.Внутренний
			И ОбработанныеОбъектыУчета[ПараметрыФормирвания.ОбъектУчета] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка 
			ДокументОбъект = СоздатьИсходящийДокумент(ПараметрыФормирвания.НастройкиДокумента, ОписаниеСообщения,
				РезультатДействий.КонтекстДиагностики, ПараметрыФормирвания.ОбъектУчета, ПараметрыФормирвания.Основания,
				ПараметрыФормирвания.ИдентификаторыОснований);
			ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Перечисления.ДействияПоЭДО.Сформировать,
				ДокументОбъект.Ссылка);
		Исключение
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось начать новый электронный ЭлектронныйДокумент на основании %1.'"),
				ПараметрыФормирвания.ОбъектУчета);
			ПодробныйТекстОшибки = ТекстОшибки + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(НСтр("ru = 'Формирование электронных документов.'"),
				ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
				ПодробныйТекстОшибки, ТекстОшибки);
			ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
			ОбработкаНеисправностейБЭД.ДобавитьОшибку(РезультатДействий.КонтекстДиагностики, Ошибка,
				ПодсистемыБЭД.ОбменСКонтрагентами);
		КонецПопытки;
		
		Для Каждого ОбъектУчета Из ПараметрыФормирвания.Основания Цикл
			ОбработанныеОбъектыУчета.Вставить(ОбъектУчета, Истина);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция РезультатыЗапросаНастроекОбъектовУчета(ПараметрыВыполнения, ОбъектыУчета)
	
	Результат = Новый Структура;
	Результат.Вставить("НастройкиОтправки");
	Результат.Вставить("НастройкиВнутреннегоЭДО");
	Результат.Вставить("НастройкиВнутреннегоЭДОПоУмолчанию");
	
	Если Не ЗначениеЗаполнено(ОбъектыУчета) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОписанияОбъектовУчета = ИнтеграцияЭДО.ОписанияОбъектовУчета(ОбъектыУчета);
	
	СоставДокументов = Новый Структура;
	СоставДокументов.Вставить("ЕстьДокументыДляОтправки", ЗначениеЗаполнено(ОписанияОбъектовУчета));
	СоставДокументов.Вставить("ЕстьВнутренниеДокументыПоВидам", Ложь);
	СоставДокументов.Вставить("ЕстьВнутренниеДокументыПоУмолчанию", Ложь);
	
	ДополнитьОписанияОбъектовУчетаПоВнутреннемуЭДО(ОписанияОбъектовУчета, ПараметрыВыполнения.КлючиНастроекОбъектов,
		СоставДокументов);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОписанияОбъектовУчета", ОписанияОбъектовУчета);
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить( 
		"ВЫБРАТЬ
		|	ОписанияОбъектовУчета.ОбъектУчета КАК ОбъектУчета,
		|	ОписанияОбъектовУчета.Направление КАК Направление,
		|	ОписанияОбъектовУчета.ТипДокумента КАК ТипДокумента,
		|	ОписанияОбъектовУчета.ПрикладнойТипДокумента КАК ПрикладнойТипДокумента,
		|	ОписанияОбъектовУчета.Организация КАК Организация,
		|	ОписанияОбъектовУчета.Контрагент КАК Контрагент,
		|	ОписанияОбъектовУчета.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	&ВидВнутреннегоДокумента КАК ВидВнутреннегоДокумента,
		|	&ИдентификаторОбъектаУчета КАК ИдентификаторОбъектаУчета
		|ПОМЕСТИТЬ ОписанияОбъектовУчета
		|ИЗ
		|	&ОписанияОбъектовУчета КАК ОписанияОбъектовУчета");
	
	Если СоставДокументов.ЕстьДокументыДляОтправки Тогда
		
		ТекстыЗапросов.Добавить(ТекстЗапросаНастроекОтправкиОбъектовУчета());
		
		НаправленияНастроекОтправки = Новый Массив();
		НаправленияНастроекОтправки.Добавить(Перечисления.НаправленияЭДО.Исходящий);
		Если НастройкиЭДО.ОбменЭлектроннымиДокументамиМеждуОрганизациями() Тогда
			НаправленияНастроекОтправки.Добавить(Перечисления.НаправленияЭДО.Интеркампани);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ПустойДоговор", 
			Метаданные.ОпределяемыеТипы.ДоговорСКонтрагентомЭДО.Тип.ПривестиЗначение());
		Запрос.УстановитьПараметр("НаправленияНастроекОтправки", НаправленияНастроекОтправки);
		Запрос.УстановитьПараметр("ИдентификаторОбъектаУчета", "");
		Запрос.УстановитьПараметр("ВидВнутреннегоДокумента", "");
		
	КонецЕсли;
	
	Если СоставДокументов.ЕстьВнутренниеДокументыПоВидам
		ИЛИ СоставДокументов.ЕстьВнутренниеДокументыПоУмолчанию Тогда
		
		ТекстыЗапросов[0] = СтрЗаменить(ТекстыЗапросов[0], "&ВидВнутреннегоДокумента",
			"ОписанияОбъектовУчета.ВидВнутреннегоДокумента");
		ТекстыЗапросов[0] = СтрЗаменить(ТекстыЗапросов[0], "&ИдентификаторОбъектаУчета",
			"ОписанияОбъектовУчета.ИдентификаторОбъектаУчета");
		
		Если СоставДокументов.ЕстьВнутренниеДокументыПоВидам Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаНастроекВнутреннегоЭДООбъектовУчета());
		КонецЕсли;
		
		Если СоставДокументов.ЕстьВнутренниеДокументыПоУмолчанию Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаНастроекВнутреннегоЭДООбъектовУчетаПоУмолчанию());
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НаправлениеВнутренний", Перечисления.НаправленияЭДО.Внутренний);
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	СдвигИндексаЗапроса = 0;
	
	Если СоставДокументов.ЕстьДокументыДляОтправки Тогда
		Результат.НастройкиОтправки = РезультатыЗапроса[1];
		СдвигИндексаЗапроса = СдвигИндексаЗапроса + 1;
	КонецЕсли;
	
	Если СоставДокументов.ЕстьВнутренниеДокументыПоВидам Тогда
		Результат.НастройкиВнутреннегоЭДО = РезультатыЗапроса[1 + СдвигИндексаЗапроса];
		СдвигИндексаЗапроса = СдвигИндексаЗапроса + 1;
	КонецЕсли;
	
	Если СоставДокументов.ЕстьВнутренниеДокументыПоУмолчанию Тогда
		Результат.НастройкиВнутреннегоЭДОПоУмолчанию = РезультатыЗапроса[2 + СдвигИндексаЗапроса];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьОписанияОбъектовУчетаПоВнутреннемуЭДО(ОписанияОбъектовУчета, КлючиНастроекОбъектов, СоставДокументов)
	
	Если Не НастройкиЭДО.ИспользуютсяВнутренниеДокументы() Тогда
		Возврат;
	КонецЕсли;
	
	ОписанияОбъектовУчета.Колонки.Добавить("ВидВнутреннегоДокумента", 
		Новый ОписаниеТипов("СправочникСсылка.ВидыДокументовЭДО"));
	ОписанияОбъектовУчета.Колонки.Добавить("ИдентификаторОбъектаУчета", 
		ИнтеграцияБСПБЭД.ОписаниеТипаИдентификатораОбъектаМетаданных());
	ОписанияОбъектовУчета.Колонки.Добавить("ПолноеИмяОбъектаУчета", Новый ОписаниеТипов("Строка"));
	
	Отбор = Новый Структура("Направление", Перечисления.НаправленияЭДО.Внутренний);
	ОписанияОбъектовУчетаВнутреннегоЭДО = ОписанияОбъектовУчета.НайтиСтроки(Отбор);
	
	Если Не ЗначениеЗаполнено(ОписанияОбъектовУчетаВнутреннегоЭДО) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОписанияОбъектовУчета.Количество() = ОписанияОбъектовУчетаВнутреннегоЭДО.Количество() Тогда
		СоставДокументов.ЕстьДокументыДляОтправки = Ложь;
	КонецЕсли;
	
	УникальныеИменаОбъектовУчета = Новый Соответствие;
	
	Для Каждого ОписаниеОбъектаУчета Из ОписанияОбъектовУчетаВнутреннегоЭДО Цикл
		
		КлючиНастроек = КлючиНастроекОбъектов[ОписаниеОбъектаУчета.ОбъектУчета];
		Если КлючиНастроек = Неопределено Тогда
			ОписаниеОбъектаУчета.ПолноеИмяОбъектаУчета = ОписаниеОбъектаУчета.ОбъектУчета.Метаданные().ПолноеИмя();
			УникальныеИменаОбъектовУчета.Вставить(ОписаниеОбъектаУчета.ПолноеИмяОбъектаУчета, Истина);
			СоставДокументов.ЕстьВнутренниеДокументыПоУмолчанию = Истина;
			Продолжить;
		КонецЕсли;
		
		ОписаниеОбъектаУчета.ВидВнутреннегоДокумента = КлючиНастроек[0].ВидВнутреннегоДокумента;
		СоставДокументов.ЕстьВнутренниеДокументыПоВидам = Истина;
		
		Количество = КлючиНастроек.Количество();
		Если Количество > 1 Тогда
			Для Счетчик = 1 По Количество - 1 Цикл
				НовоеОписаниеОбъектаУчета = ОписанияОбъектовУчета.Добавить();
				ЗаполнитьЗначенияСвойств(НовоеОписаниеОбъектаУчета, ОписаниеОбъектаУчета);
				НовоеОписаниеОбъектаУчета.ВидВнутреннегоДокумента = КлючиНастроек[Счетчик].ВидВнутреннегоДокумента;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(УникальныеИменаОбъектовУчета) Тогда
		Возврат;
	КонецЕсли;
	
	ИменаОбъектовМетаданных = Новый Массив;
	Для Каждого ЭлементКоллекции Из УникальныеИменаОбъектовУчета Цикл
		ИменаОбъектовМетаданных.Добавить(ЭлементКоллекции.Ключ);
	КонецЦикла;
	
	ИдентификаторыОбъектов = ОбщегоНазначения.ИдентификаторыОбъектовМетаданных(ИменаОбъектовМетаданных, Ложь);
	Для Каждого Описание Из ОписанияОбъектовУчетаВнутреннегоЭДО Цикл
		ИдентификаторОбъектаУчета = ИдентификаторыОбъектов[Описание.ПолноеИмяОбъектаУчета];
		Если ИдентификаторОбъектаУчета <> Неопределено Тогда
			Описание.ИдентификаторОбъектаУчета = ИдентификаторОбъектаУчета;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаНастроекОтправкиОбъектовУчета()
	Возврат
		"ВЫБРАТЬ
		|	ОписанияОбъектовУчета.ОбъектУчета КАК ОбъектУчета,
		|	ОписанияОбъектовУчета.Организация КАК Отправитель,
		|	ОписанияОбъектовУчета.Контрагент КАК Получатель,
		|	ЕСТЬNULL(НастройкиОтправки.Договор, ОписанияОбъектовУчета.ДоговорКонтрагента) КАК Договор,
		|	ОписанияОбъектовУчета.Направление КАК Направление,
		|	ОписанияОбъектовУчета.ТипДокумента КАК ТипДокумента,
		|	ВидыДокументовЭДО.Ссылка КАК ВидДокумента,
		|	НастройкиОтправки.ВерсияФормата КАК Формат,
		|	НастройкиОтправки.МаршрутПодписания КАК МаршрутПодписания,
		|	НастройкиОтправки.СпособОбменаЭД КАК СпособОбмена,
		|	НастройкиОтправки.ИдентификаторОтправителя КАК ИдентификаторОтправителя,
		|	НастройкиОтправки.ИдентификаторПолучателя КАК ИдентификаторПолучателя,
		|	НастройкиОтправки.ТребуетсяОтветнаяПодпись КАК ТребуетсяОтветнаяПодпись,
		|	НастройкиОтправки.ТребуетсяИзвещениеОПолучении КАК ТребуетсяИзвещениеОПолучении,
		|	НастройкиОтправки.ВыгружатьДополнительныеСведения КАК ВыгружатьДополнительныеСведения,
		|	НастройкиОтправки.ОбменБезПодписи КАК ОбменБезПодписи,
		|	НастройкиОтправки.Формировать КАК Формировать,
		|	НастройкиОтправки.ЗаполнениеКодаТовара КАК ЗаполнениеКодаТовара
		|ИЗ
		|	ОписанияОбъектовУчета КАК ОписанияОбъектовУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|		ПО ОписанияОбъектовУчета.ТипДокумента = ВидыДокументовЭДО.ТипДокумента
		|		И ОписанияОбъектовУчета.ПрикладнойТипДокумента = ВидыДокументовЭДО.ПрикладнойТипДокумента
		|		И ОписанияОбъектовУчета.Направление <> &НаправлениеВнутренний
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеДокументыЭДО КАК АктуальныеДокументыЭДО
		|		ПО ОписанияОбъектовУчета.ОбъектУчета = АктуальныеДокументыЭДО.ОбъектУчета
		|		И ВидыДокументовЭДО.Ссылка = АктуальныеДокументыЭДО.ВидЭлектронногоДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам КАК НастройкиОтправки
		|		ПО ОписанияОбъектовУчета.Организация = НастройкиОтправки.Отправитель
		|		И ОписанияОбъектовУчета.Контрагент = НастройкиОтправки.Получатель
		|		И ВидыДокументовЭДО.Ссылка = НастройкиОтправки.ВидДокумента
		|		И НастройкиОтправки.Договор В (ОписанияОбъектовУчета.ДоговорКонтрагента, &ПустойДоговор)
		|ГДЕ
		|	ОписанияОбъектовУчета.Направление В (&НаправленияНастроекОтправки)
		|	И АктуальныеДокументыЭДО.ЭлектронныйДокумент ЕСТЬ NULL
		|УПОРЯДОЧИТЬ ПО
		|	Договор УБЫВ";
КонецФункции

Функция ТекстЗапросаНастроекВнутреннегоЭДООбъектовУчета()
	Возврат
		"ВЫБРАТЬ
		|	ОписанияОбъектовУчета.ОбъектУчета КАК ОбъектУчета,
		|	ОписанияОбъектовУчета.Организация КАК Организация,
		|	ОписанияОбъектовУчета.Направление КАК Направление,
		|	ОписанияОбъектовУчета.ВидВнутреннегоДокумента КАК ВидДокумента,
		|	ВидыДокументовЭДО.Наименование КАК НаименованиеВидаДокумента,
		|	ВидыДокументовЭДО.ИдентификаторКомандыПечати КАК ИдентификаторКомандыПечати,
		|	ВидыДокументовЭДО.ИдентификаторОбъектаУчета КАК ИдентификаторОбъектаУчета,
		|	ВидыДокументовЭДО.ИдентификаторОбъектаУчета.Синоним КАК СинонимОбъектаУчета,
		|	НастройкиВнутреннегоЭДО.Формировать КАК Формировать,
		|	НастройкиВнутреннегоЭДО.ВидПодписи КАК ВидПодписи,
		|	НастройкиВнутреннегоЭДО.МаршрутПодписания КАК МаршрутПодписания,
		|	НастройкиВнутреннегоЭДО.ЭтоОсновнойВидДокумента КАК ЭтоОсновнойВидДокумента,
		|	ЗНАЧЕНИЕ(Перечисление.СпособыОбменаЭД.Внутренний) КАК СпособОбмена
		|ИЗ
		|		ОписанияОбъектовУчета КАК ОписанияОбъектовУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|		ПО ОписанияОбъектовУчета.ВидВнутреннегоДокумента = ВидыДокументовЭДО.Ссылка
		|		И ОписанияОбъектовУчета.Направление = &НаправлениеВнутренний
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиВнутреннегоЭДО КАК НастройкиВнутреннегоЭДО
		|		ПО ОписанияОбъектовУчета.Организация = НастройкиВнутреннегоЭДО.Организация
		|		И ОписанияОбъектовУчета.ВидВнутреннегоДокумента = НастройкиВнутреннегоЭДО.ВидВнутреннегоДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеДокументыЭДО КАК АктуальныеДокументыЭДО
		|		ПО ОписанияОбъектовУчета.ОбъектУчета = АктуальныеДокументыЭДО.ОбъектУчета
		|		И ОписанияОбъектовУчета.ВидВнутреннегоДокумента = АктуальныеДокументыЭДО.ВидЭлектронногоДокумента
		|ГДЕ
		|	ОписанияОбъектовУчета.Направление = &НаправлениеВнутренний
		|	И АктуальныеДокументыЭДО.ЭлектронныйДокумент ЕСТЬ NULL";
КонецФункции

Функция ТекстЗапросаНастроекВнутреннегоЭДООбъектовУчетаПоУмолчанию()
	Возврат
		"ВЫБРАТЬ
		|	НастройкиВнутреннегоЭДО.Организация КАК Организация,
		|	НастройкиВнутреннегоЭДО.ВидВнутреннегоДокумента КАК ВидВнутреннегоДокумента,
		|	НастройкиВнутреннегоЭДО.Формировать КАК Формировать,
		|	НастройкиВнутреннегоЭДО.ВидПодписи КАК ВидПодписи,
		|	НастройкиВнутреннегоЭДО.МаршрутПодписания КАК МаршрутПодписания,
		|	НастройкиВнутреннегоЭДО.ЭтоОсновнойВидДокумента КАК ЭтоОсновнойВидДокумента,
		|	ВидыДокументовЭДО.Наименование КАК НаименованиеВидаДокумента,
		|	ВидыДокументовЭДО.ИдентификаторКомандыПечати КАК ИдентификаторКомандыПечати,
		|	ВидыДокументовЭДО.ИдентификаторОбъектаУчета КАК ИдентификаторОбъектаУчета,
		|	ВидыДокументовЭДО.ИдентификаторОбъектаУчета.Синоним КАК СинонимОбъектаУчета
		|ПОМЕСТИТЬ НастройкиОсновныхВидовВнутреннегоЭДО
		|ИЗ
		|	РегистрСведений.НастройкиВнутреннегоЭДО КАК НастройкиВнутреннегоЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|		ПО НастройкиВнутреннегоЭДО.ВидВнутреннегоДокумента = ВидыДокументовЭДО.Ссылка
		|		И НастройкиВнутреннегоЭДО.ЭтоОсновнойВидДокумента
		|ГДЕ
		|	НастройкиВнутреннегоЭДО.ЭтоОсновнойВидДокумента
		|	И (НастройкиВнутреннегоЭДО.Организация, ВидыДокументовЭДО.ИдентификаторОбъектаУчета) В
		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ОписанияОбъектовУчета.Организация,
		|			ОписанияОбъектовУчета.ИдентификаторОбъектаУчета
		|		ИЗ
		|			ОписанияОбъектовУчета
		|		ГДЕ
		|			ОписанияОбъектовУчета.Направление = &НаправлениеВнутренний
		|			И ОписанияОбъектовУчета.ВидВнутреннегоДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовЭДО.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОписанияОбъектовУчета.ОбъектУчета КАК ОбъектУчета,
		|	ОписанияОбъектовУчета.Организация КАК Организация,
		|	ОписанияОбъектовУчета.Направление КАК Направление,
		|	ОписанияОбъектовУчета.ИдентификаторОбъектаУчета КАК ИдентификаторОбъектаУчета,
		|	НастройкиОсновныхВидовВнутреннегоЭДО.ИдентификаторКомандыПечати КАК ИдентификаторКомандыПечати,
		|	НастройкиОсновныхВидовВнутреннегоЭДО.СинонимОбъектаУчета КАК СинонимОбъектаУчета,
		|	НастройкиОсновныхВидовВнутреннегоЭДО.НаименованиеВидаДокумента КАК НаименованиеВидаДокумента,
		|	НастройкиОсновныхВидовВнутреннегоЭДО.ВидВнутреннегоДокумента КАК ВидДокумента,
		|	НастройкиОсновныхВидовВнутреннегоЭДО.Формировать КАК Формировать,
		|	НастройкиОсновныхВидовВнутреннегоЭДО.ВидПодписи КАК ВидПодписи,
		|	НастройкиОсновныхВидовВнутреннегоЭДО.МаршрутПодписания КАК МаршрутПодписания,
		|	НастройкиОсновныхВидовВнутреннегоЭДО.ЭтоОсновнойВидДокумента КАК ЭтоОсновнойВидДокумента,
		|	ЗНАЧЕНИЕ(Перечисление.СпособыОбменаЭД.Внутренний) КАК СпособОбмена
		|ИЗ
		|	ОписанияОбъектовУчета КАК ОписанияОбъектовУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиОсновныхВидовВнутреннегоЭДО КАК НастройкиОсновныхВидовВнутреннегоЭДО
		|		ПО ОписанияОбъектовУчета.Организация = НастройкиОсновныхВидовВнутреннегоЭДО.Организация
		|		И ОписанияОбъектовУчета.ИдентификаторОбъектаУчета = НастройкиОсновныхВидовВнутреннегоЭДО.ИдентификаторОбъектаУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеДокументыЭДО КАК АктуальныеДокументыЭДО
		|		ПО ОписанияОбъектовУчета.ОбъектУчета = АктуальныеДокументыЭДО.ОбъектУчета
		|		И НастройкиОсновныхВидовВнутреннегоЭДО.ВидВнутреннегоДокумента = АктуальныеДокументыЭДО.ВидЭлектронногоДокумента
		|ГДЕ
		|	ОписанияОбъектовУчета.Направление = &НаправлениеВнутренний
		|	И ОписанияОбъектовУчета.ВидВнутреннегоДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовЭДО.ПустаяСсылка)
		|	И АктуальныеДокументыЭДО.ЭлектронныйДокумент ЕСТЬ NULL";
КонецФункции

Функция ПараметрыФормирванияДокумента(ПараметрыВыполнения, РезультатыЗапросаНастроек, РезультатДействий)
	
	НаборПараметровФормирвания = Новый Массив;
	
	Если РезультатыЗапросаНастроек.НастройкиОтправки <> Неопределено Тогда
		ЗаполнитьПараметрыФормированияИсходящихДокументов(ПараметрыВыполнения,
			РезультатыЗапросаНастроек.НастройкиОтправки, НаборПараметровФормирвания, РезультатДействий);
	КонецЕсли;
	
	Если РезультатыЗапросаНастроек.НастройкиВнутреннегоЭДО <> Неопределено Тогда
		ЗаполнитьПараметрыФормированияВнутреннихДокументов(ПараметрыВыполнения,
			РезультатыЗапросаНастроек.НастройкиВнутреннегоЭДО, НаборПараметровФормирвания, РезультатДействий);
	КонецЕсли;
	
	Если РезультатыЗапросаНастроек.НастройкиВнутреннегоЭДОПоУмолчанию <> Неопределено Тогда
		ЗаполнитьПараметрыФормированияВнутреннихДокументовПоУмолчанию(ПараметрыВыполнения,
			РезультатыЗапросаНастроек.НастройкиВнутреннегоЭДОПоУмолчанию, НаборПараметровФормирвания, РезультатДействий);
	КонецЕсли;
	
	Возврат НаборПараметровФормирвания;
	
КонецФункции

Процедура ЗаполнитьПараметрыФормированияИсходящихДокументов(ПараметрыВыполнения, РезультатЗапросаНастроек, НаборПараметровФормирвания, РезультатДействий)
	
	Если РезультатЗапросаНастроек.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСвязанныхОбъектовУчета = НоваяТаблицаСвязанныхОбъектовУчета();
	
	ОбработанныеОбъектыУчета = Новый Соответствие;
	ВыборкаНастроек = РезультатЗапросаНастроек.Выбрать();
	Пока ВыборкаНастроек.Следующий() Цикл
		Если ОбработанныеОбъектыУчета[ВыборкаНастроек.ОбъектУчета] = Неопределено Тогда
			ОбработанныеОбъектыУчета.Вставить(ВыборкаНастроек.ОбъектУчета, Истина);
			ДобавитьПараметрыФормированияИсходящегоДокумента(ПараметрыВыполнения, ВыборкаНастроек,
				НаборПараметровФормирвания, ТаблицаСвязанныхОбъектовУчета, РезультатДействий);
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ТаблицаСвязанныхОбъектовУчета) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = РезультатЗапросаИдентификаторовДокументоборотовОбъектовУчета(ТаблицаСвязанныхОбъектовУчета);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭлементКоллекции = НовыйЭлементКоллекцииИдентификаторыОснованияДокумента();
		ЗаполнитьЭлементКоллекцииИдентификаторыОснованияДокумента(ЭлементКоллекции, Выборка);
		ПараметрыФормирования = НаборПараметровФормирвания[Выборка.ИндексПараметров];
		Если ПараметрыФормирования.ИдентификаторыОснований = Неопределено Тогда
			ПараметрыФормирования.ИдентификаторыОснований = Новый Массив;
		КонецЕсли;
		ПараметрыФормирования.ИдентификаторыОснований.Добавить(ЭлементКоллекции);
	КонецЦикла;
	
КонецПроцедуры

Функция НоваяТаблицаСвязанныхОбъектовУчета()
	ТаблицаСвязанныхОбъектовУчета = Новый ТаблицаЗначений;
	ТаблицаСвязанныхОбъектовУчета.Колонки.Добавить("ИндексПараметров", Новый ОписаниеТипов("Число",
		Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаСвязанныхОбъектовУчета.Колонки.Добавить("ОбъектУчета", 
		ИнтеграцияЭДО.ОписаниеТиповОснованийЭлектронныхДокументов());
	Возврат ТаблицаСвязанныхОбъектовУчета;
КонецФункции

Процедура ДобавитьПараметрыФормированияИсходящегоДокумента(ПараметрыВыполнения, ВыборкаНастроек, НаборПараметровФормирвания, ТаблицаСвязанныхОбъектовУчета, РезультатДействий)
	
	Формировать = ФормироватьДокумент(ВыборкаНастроек, РезультатДействий);
	Если Не Формировать Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	МаршрутПодписания = ПараметрыВыполнения.МаршрутыПодписанияОбъектов[ВыборкаНастроек.ОбъектУчета];
	Если Не ЗначениеЗаполнено(МаршрутПодписания) Тогда
		МаршрутПодписания = ВыборкаНастроек.МаршрутПодписания;
	КонецЕсли;
	
	Подписанты = Неопределено;
	Если МаршрутПодписания = МаршрутыПодписанияБЭД.МаршрутУказыватьПриСоздании() Тогда
		Подписанты = ПараметрыВыполнения.ПодписантыОбъектов[ВыборкаНастроек.ОбъектУчета];
		Если Не ЗначениеЗаполнено(Подписанты) Тогда
			ОписаниеОшибки = НовоеОписаниеОшибкиФормирования();
			ЗаполнитьЗначенияСвойств(ОписаниеОшибки.ОписаниеОбъектаУчета, ВыборкаНастроек);
			ОписаниеОшибки.ОписаниеОбъектаУчета.Организация = ВыборкаНастроек.Отправитель;
			ОписаниеОшибки.ОписаниеОбъектаУчета.Контрагент = ВыборкаНастроек.Получатель;
			ОписаниеОшибки.ВидДокумента = ВыборкаНастроек.ВидДокумента;
			ОписаниеОшибки.ОтсутствуютПодписанты = Истина;
			РезультатДействий.ОшибкиФормирования.Добавить(ОписаниеОшибки);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеДанные = ПараметрыВыполнения.ДополнительныеДанныеОбъектов[ВыборкаНастроек.ОбъектУчета];
	
	НастройкиОтправки = ВыборкаНастроек;
	
	НастройкиОбъекта = ПараметрыВыполнения.НастройкиОбъектов[ВыборкаНастроек.ОбъектУчета];
	Если НастройкиОбъекта <> Неопределено Тогда
		НастройкиОтправки = НастройкиОбъекта;
		НастройкиОтправки.Вставить("ТипДокумента", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			НастройкиОбъекта.ВидДокумента, "ТипДокумента"));
	КонецЕсли;
	
	ОписаниеДанных = ИнтеграцияЭДО.ОписаниеДанныхОбъектаУчета(ВыборкаНастроек.ОбъектУчета, НастройкиОтправки,
		ДополнительныеДанные);
	
	ОписаниеСообщения = ОписаниеСообщенияОтправителя(ВыборкаНастроек.ОбъектУчета, ОписаниеДанных.Данные, НастройкиОтправки,
		ДополнительныеДанные);
	
	Если ОписаниеСообщения.Данные.ЕстьОшибки Тогда
		ОписаниеОшибки = НовоеОписаниеОшибкиФормирования();
		ЗаполнитьЗначенияСвойств(ОписаниеОшибки.ОписаниеОбъектаУчета, ВыборкаНастроек);
		ОписаниеОшибки.ОписаниеОбъектаУчета.Организация = ВыборкаНастроек.Отправитель;
		ОписаниеОшибки.ОписаниеОбъектаУчета.Контрагент = ВыборкаНастроек.Получатель;
		ОписаниеОшибки.ВидДокумента = ВыборкаНастроек.ВидДокумента;
		ОписаниеОшибки.ОшибкиДанных = ОписаниеСообщения.Данные.Ошибки;
		РезультатДействий.ОшибкиФормирования.Добавить(ОписаниеОшибки);
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиДокумента = НовыеНастройкиОтправкиДокумента();
	НастройкиДокумента.ИдентификаторОрганизации = НастройкиОтправки.ИдентификаторОтправителя;
	НастройкиДокумента.ИдентификаторКонтрагента = НастройкиОтправки.ИдентификаторПолучателя;
	НастройкиДокумента.Организация = НастройкиОтправки.Отправитель;
	НастройкиДокумента.Контрагент = НастройкиОтправки.Получатель;
	НастройкиДокумента.ДоговорКонтрагента = НастройкиОтправки.Договор;
	НастройкиДокумента.СпособОбмена = НастройкиОтправки.СпособОбмена;
	НастройкиДокумента.ОбменБезПодписи = НастройкиОтправки.ОбменБезПодписи;
	НастройкиДокумента.МаршрутПодписания = МаршрутПодписания;
	НастройкиДокумента.Подписанты = Подписанты;
	НастройкиДокумента.ТребуетсяИзвещение = НастройкиОтправки.ТребуетсяИзвещениеОПолучении;
	НастройкиДокумента.ТребуетсяПодтверждение = НастройкиОтправки.ТребуетсяОтветнаяПодпись;
	НастройкиДокумента.ВыгружатьДополнительныеСведения = НастройкиОтправки.ВыгружатьДополнительныеСведения;
	
	ПараметрыФормирования = НовыеПараметрыФормированияДокумента(
		ОписаниеДанных.СвязующийОбъектУчета, НастройкиДокумента, ОписаниеСообщения, ОписаниеДанных.Основания);
	
	НаборПараметровФормирвания.Добавить(ПараметрыФормирования);
	
	СвязанныеОбъектыУчета = ОписаниеДанных.СвязанныеОбъектыУчета;
	
	Если Не ЗначениеЗаполнено(СвязанныеОбъектыУчета) Тогда
		Возврат;
	КонецЕсли;
	
	ИндексПараметров = НаборПараметровФормирвания.Количество() - 1;
	Для Каждого ОбъектУчета Из СвязанныеОбъектыУчета Цикл
		СтрокаТаблицы = ТаблицаСвязанныхОбъектовУчета.Добавить();
		СтрокаТаблицы.ИндексПараметров = ИндексПараметров;
		СтрокаТаблицы.ОбъектУчета = ОбъектУчета;
	КонецЦикла;
	
КонецПроцедуры

Функция РезультатЗапросаИдентификаторовДокументоборотовОбъектовУчета(СвязанныеОбъектыУчета)
	
	ОписанияЗапросов = Новый Массив;
	
	ОписаниеЗапроса = ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса();
	ОписаниеЗапроса.Текст = 
		"ВЫБРАТЬ
		|	СвязанныеОбъектыУчета.ИндексПараметров КАК ИндексПараметров,
		|	СвязанныеОбъектыУчета.ОбъектУчета КАК ОбъектУчета
		|ПОМЕСТИТЬ СвязанныеОбъектыУчета
		|ИЗ
		|	&ТаблицаОбъектовУчета КАК СвязанныеОбъектыУчета";
	ОписаниеЗапроса.СлужебныеПараметры.Вставить("ТаблицаОбъектовУчета", СвязанныеОбъектыУчета);
	ОписанияЗапросов.Добавить(ОписаниеЗапроса);
	
	Отбор = ИнтеграцияЭДО.НовыйОтборАктуальныхЭлектронныхДокументов();
	Отбор.ОбъектыУчета = "ВЫБРАТЬ ОбъектУчета Из СвязанныеОбъектыУчета";
	ОписаниеЗапроса = ИнтеграцияЭДО.ЗапросАктуальныхЭлектронныхДокументов("АктуальныеДокументыЭДООбъектовУчета", Отбор);
	ОписанияЗапросов.Добавить(ОписаниеЗапроса);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвязанныеОбъектыУчета.ИндексПараметров КАК ИндексПараметров,
		|	АктуальныеДокументыЭДООбъектовУчета.ОбъектУчета КАК ОбъектУчета,
		|	АктуальныеДокументыЭДООбъектовУчета.ЭлектронныйДокумент.ИдентификаторДокументооборота КАК ИдентификаторДокументооборота
		|ИЗ
		|	АктуальныеДокументыЭДООбъектовУчета КАК АктуальныеДокументыЭДООбъектовУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СвязанныеОбъектыУчета КАК СвязанныеОбъектыУчета
		|		ПО АктуальныеДокументыЭДООбъектовУчета.ОбъектУчета = СвязанныеОбъектыУчета.ОбъектУчета";
	
	Запрос = ОбщегоНазначенияБЭД.СоединитьЗапросы(Запрос, ОписанияЗапросов);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция НовыйЭлементКоллекцииИдентификаторыОснованияДокумента()
	ИдентификаторыОснований = Новый Структура;
	ИдентификаторыОснований.Вставить("ИдентификаторСвязи", "");
	ИдентификаторыОснований.Вставить("ИдентификаторДокументооборота", "");
	Возврат ИдентификаторыОснований;
КонецФункции

Процедура ЗаполнитьЭлементКоллекцииИдентификаторыОснованияДокумента(ЭлементКоллекции, ВыборкаИдентификаторов)
	ЭлементКоллекции.ИдентификаторСвязи = Строка(ВыборкаИдентификаторов.ОбъектУчета.УникальныйИдентификатор());
	ЭлементКоллекции.ИдентификаторДокументооборота = ВыборкаИдентификаторов.ИдентификаторДокументооборота;
КонецПроцедуры

Процедура ЗаполнитьПараметрыФормированияВнутреннихДокументов(ПараметрыВыполнения, РезультатЗапросаНастроек, НаборПараметровФормирвания, РезультатДействий)
	
	Если РезультатЗапросаНастроек.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаНастроек = РезультатЗапросаНастроек.Выбрать();
	
	Пока ВыборкаНастроек.Следующий() Цикл
		
		ДобавитьПараметрыФормированияВнутреннегоДокумента(ПараметрыВыполнения,
			ВыборкаНастроек, НаборПараметровФормирвания, РезультатДействий);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыФормированияВнутреннихДокументовПоУмолчанию(ПараметрыВыполнения, РезультатЗапросаНастроек, НаборПараметровФормирвания, РезультатДействий)
	
	Если РезультатЗапросаНастроек.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработанныеОбъектыУчета = Новый Соответствие;
	
	ВыборкаНастроек = РезультатЗапросаНастроек.Выбрать();
	
	Пока ВыборкаНастроек.Следующий() Цикл
		
		Если ОбработанныеОбъектыУчета[ВыборкаНастроек.ОбъектУчета] <> Неопределено Тогда
			ОписаниеОшибки = НовоеОписаниеОшибкиФормирования();
			ЗаполнитьЗначенияСвойств(ОписаниеОшибки.ОписаниеОбъектаУчета, ВыборкаНастроек);
			ОписаниеОшибки.ОсновнойВидНеУстановлен = Истина;
			РезультатДействий.ОшибкиФормирования.Добавить(ОписаниеОшибки);
		КонецЕсли;
		
		ДобавитьПараметрыФормированияВнутреннегоДокумента(ПараметрыВыполнения,
			ВыборкаНастроек, НаборПараметровФормирвания, РезультатДействий);
		
		ОбработанныеОбъектыУчета.Вставить(ВыборкаНастроек.ОбъектУчета, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ФормироватьДокумент(ПараметрыОбъектаУчета, РезультатДействий)
	
	Результат = Истина;
	
	Если ПараметрыОбъектаУчета.Формировать = Null Тогда
		
		ОписаниеОшибки = НовоеОписаниеОшибкиФормирования();
		ЗаполнитьЗначенияСвойств(ОписаниеОшибки.ОписаниеОбъектаУчета, ПараметрыОбъектаУчета);
		ОписаниеОшибки.ОписаниеОбъектаУчета.Организация = ПараметрыОбъектаУчета.Отправитель;
		ОписаниеОшибки.ОписаниеОбъектаУчета.Контрагент = ПараметрыОбъектаУчета.Получатель;
		ОписаниеОшибки.ВидДокумента = ПараметрыОбъектаУчета.ВидДокумента;
		ОписаниеОшибки.ОтсутствуютНастройки = Истина;
		РезультатДействий.ОшибкиФормирования.Добавить(ОписаниеОшибки);
		Результат = Ложь;
		
	ИначеЕсли Не ПараметрыОбъектаУчета.Формировать Тогда
		
		ОписаниеОшибки = НовоеОписаниеОшибкиФормирования();
		ЗаполнитьЗначенияСвойств(ОписаниеОшибки.ОписаниеОбъектаУчета, ПараметрыОбъектаУчета);
		ОписаниеОшибки.ОписаниеОбъектаУчета.Организация = ПараметрыОбъектаУчета.Отправитель;
		ОписаниеОшибки.ОписаниеОбъектаУчета.Контрагент = ПараметрыОбъектаУчета.Получатель;
		ОписаниеОшибки.ВидДокумента = ПараметрыОбъектаУчета.ВидДокумента;
		ОписаниеОшибки.ФормированиеЗапрещено = Истина;
		РезультатДействий.ОшибкиФормирования.Добавить(ОписаниеОшибки);
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ФормироватьВнутреннийДокумент(ПараметрыОбъектаУчета, РезультатДействий)
	
	Результат = Истина;
	
	Если ПараметрыОбъектаУчета.Формировать = Null Тогда
		
		ОписаниеОшибки = НовоеОписаниеОшибкиФормирования();
		ЗаполнитьЗначенияСвойств(ОписаниеОшибки.ОписаниеОбъектаУчета, ПараметрыОбъектаУчета);
		ОписаниеОшибки.ОписаниеОбъектаУчета.Организация = ПараметрыОбъектаУчета.Организация;
		ОписаниеОшибки.ВидДокумента = ПараметрыОбъектаУчета.ВидДокумента;
		ОписаниеОшибки.ОтсутствуютНастройки = Истина;
		РезультатДействий.ОшибкиФормирования.Добавить(ОписаниеОшибки);
		Результат = Ложь;
		
	ИначеЕсли Не ПараметрыОбъектаУчета.Формировать Тогда
		
		ОписаниеОшибки = НовоеОписаниеОшибкиФормирования();
		ЗаполнитьЗначенияСвойств(ОписаниеОшибки.ОписаниеОбъектаУчета, ПараметрыОбъектаУчета);
		ОписаниеОшибки.ОписаниеОбъектаУчета.Организация = ПараметрыОбъектаУчета.Организация;
		ОписаниеОшибки.ВидДокумента = ПараметрыОбъектаУчета.ВидДокумента;
		ОписаниеОшибки.ФормированиеЗапрещено = Истина;
		РезультатДействий.ОшибкиФормирования.Добавить(ОписаниеОшибки);
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьПараметрыФормированияВнутреннегоДокумента(ПараметрыВыполнения, ВыборкаНастроек, НаборПараметровФормирвания, РезультатДействий)
	
	Формировать = ФормироватьВнутреннийДокумент(ВыборкаНастроек, РезультатДействий);
	Если Не Формировать Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	МаршрутПодписания = ПараметрыВыполнения.МаршрутыПодписанияОбъектов[ВыборкаНастроек.ОбъектУчета];
	Если Не ЗначениеЗаполнено(МаршрутПодписания) Тогда
		МаршрутПодписания = ВыборкаНастроек.МаршрутПодписания;
	КонецЕсли;
	
	Подписанты = Неопределено;
	Если МаршрутПодписания = МаршрутыПодписанияБЭД.МаршрутУказыватьПриСоздании() Тогда
		Подписанты = ПараметрыВыполнения.ПодписантыОбъектов[ВыборкаНастроек.ОбъектУчета];
		Если Не ЗначениеЗаполнено(Подписанты) Тогда
			ОписаниеОшибки = НовоеОписаниеОшибкиФормирования();
			ЗаполнитьЗначенияСвойств(ОписаниеОшибки.ОписаниеОбъектаУчета, ВыборкаНастроек);
			ОписаниеОшибки.ВидДокумента = ВыборкаНастроек.ВидДокумента;
			ОписаниеОшибки.ОтсутствуютПодписанты = Истина;
			РезультатДействий.ОшибкиФормирования.Добавить(ОписаниеОшибки);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеСообщения = ОписаниеСообщенияВнутреннегоЭДО(ВыборкаНастроек.ОбъектУчета, ВыборкаНастроек);
	Если ОписаниеСообщения.Данные.ЕстьОшибки Тогда
		ОписаниеОшибки = НовоеОписаниеОшибкиФормирования();
		ЗаполнитьЗначенияСвойств(ОписаниеОшибки.ОписаниеОбъектаУчета, ВыборкаНастроек);
		ОписаниеОшибки.ВидДокумента = ВыборкаНастроек.ВидДокумента;
		ОписаниеОшибки.ОшибкиДанных = ОписаниеСообщения.Данные.Ошибки;
		РезультатДействий.ОшибкиФормирования.Добавить(ОписаниеОшибки);
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиДокумента = НовыеНастройкиОтправкиДокумента();
	ЗаполнитьЗначенияСвойств(НастройкиДокумента, ВыборкаНастроек);
	НастройкиДокумента.МаршрутПодписания = МаршрутПодписания;
	НастройкиДокумента.Подписанты = Подписанты;
	
	Онования = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыборкаНастроек.ОбъектУчета);
	
	ПараметрыФормирования = НовыеПараметрыФормированияДокумента(ВыборкаНастроек.ОбъектУчета,
		НастройкиДокумента, ОписаниеСообщения, Онования);
	НаборПараметровФормирвания.Добавить(ПараметрыФормирования);
	
КонецПроцедуры

Функция НовоеОписаниеОшибкиФормирования()
	ОписаниеОшибки = Новый Структура;
	ОписаниеОшибки.Вставить("ОписаниеОбъектаУчета", ИнтеграцияЭДО.НовоеОписаниеОбъектаУчета());
	ОписаниеОшибки.Вставить("ВидДокумента", Справочники.ВидыДокументовЭДО.ПустаяСсылка());
	ОписаниеОшибки.Вставить("ОтсутствуютНастройки", Ложь);
	ОписаниеОшибки.Вставить("ОтсутствуютПодписанты", Ложь);
	ОписаниеОшибки.Вставить("ФормированиеЗапрещено", Ложь);
	ОписаниеОшибки.Вставить("ОсновнойВидНеУстановлен", Ложь);
	ОписаниеОшибки.Вставить("ОшибкиДанных", Неопределено);
	Возврат ОписаниеОшибки;
КонецФункции

Функция НовыеПараметрыФормированияДокумента(ОбъектУчета, НастройкиДокумента, ОписаниеСообщения, Основания = Неопределено, ИдентификаторыОснований = Неопределено)
	Параметры = Новый Структура;
	Параметры.Вставить("ОбъектУчета", ОбъектУчета);
	Параметры.Вставить("НастройкиДокумента", НастройкиДокумента);
	Параметры.Вставить("ОписаниеСообщения", ОписаниеСообщения);
	Параметры.Вставить("Основания", ?(Основания = Неопределено, Новый Массив, Основания));
	Параметры.Вставить("ИдентификаторыОснований", ИдентификаторыОснований);
	Возврат Параметры;
КонецФункции

Функция СоздатьИсходящийДокумент(НастройкиОтправки, ОписаниеСообщения, КонтекстДиагностики, СвязующийОбъектУчета = Неопределено, ОбъектыУчета = Неопределено, ИдентификаторыОснований = Неопределено)
	
	Если ЗначениеЗаполнено(СвязующийОбъектУчета) Тогда
		ИдентификаторСвязи = Строка(СвязующийОбъектУчета.УникальныйИдентификатор());
	Иначе
		ИдентификаторСвязи = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	ДокументОбъект = НовыйИсходящийДокументОбъект(НастройкиОтправки, ОписаниеСообщения, ИдентификаторСвязи, ИдентификаторыОснований);
	
	ПередЗаписьюНовогоДокумента(ДокументОбъект, ОписаниеСообщения);
	
	Если Не ДокументОбъект.ПроверитьЗаполнение() Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка заполнения исходящего электронного документа'");
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		ДокументОбъект.Записать();
		
		ПриЗаписиНовогоДокумента(ДокументОбъект, ОписаниеСообщения, КонтекстДиагностики, ОбъектыУчета);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ПослеЗаписиНовогоДокумента(ДокументОбъект, КонтекстДиагностики);
	
	Возврат ДокументОбъект;
	
КонецФункции

Функция НовыйИсходящийДокументОбъект(НастройкиОтправки, ОписаниеСообщения, ИдентификаторСвязи, ИдентификаторыОснований = Неопределено)
	
	ДокументОбъект = Документы.ЭлектронныйДокументИсходящийЭДО.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	
	ДокументОбъект.Организация = НастройкиОтправки.Организация;
	ДокументОбъект.Контрагент = НастройкиОтправки.Контрагент;
	ДокументОбъект.ДоговорКонтрагента = НастройкиОтправки.ДоговорКонтрагента;
	
	ДокументОбъект.ИдентификаторДокументооборота = НовыйИдентификаторДокументооборота();
	ДокументОбъект.ИдентификаторОрганизации = НастройкиОтправки.ИдентификаторОрганизации;
	ДокументОбъект.ИдентификаторКонтрагента = НастройкиОтправки.ИдентификаторКонтрагента;
	ДокументОбъект.ИдентификаторСвязи = ИдентификаторСвязи;
	ДокументОбъект.СпособОбмена = НастройкиОтправки.СпособОбмена;
	ДокументОбъект.ОбменБезПодписи = НастройкиОтправки.ОбменБезПодписи;
	ДокументОбъект.МаршрутПодписания = НастройкиОтправки.МаршрутПодписания;
	ДокументОбъект.ВидПодписи = НастройкиОтправки.ВидПодписи;
	ДокументОбъект.ТребуетсяИзвещение = НастройкиОтправки.ТребуетсяИзвещение;
	ДокументОбъект.ТребуетсяПодтверждение = НастройкиОтправки.ТребуетсяПодтверждение;
	ДокументОбъект.ВыгружатьДополнительныеСведения = НастройкиОтправки.ВыгружатьДополнительныеСведения;
	
	ДокументОбъект.ТипРегламента = ОписаниеСообщения.Данные.Содержание.ТипРегламента;
	
	Если ЗначениеЗаполнено(НастройкиОтправки.Подписанты) Тогда
		Для Каждого Подписант Из НастройкиОтправки.Подписанты Цикл
			ДокументОбъект.СписокПодписантов.Добавить().Подписант = Подписант;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторыОснований) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИдентификаторыОснований, ДокументОбъект.ИдентификаторыОснований);
	КонецЕсли;
	
	Возврат ДокументОбъект;
	
КонецФункции

Функция СоздатьСообщение(ОписаниеСообщения, ЭлектронныйДокумент, НастройкиДокумента)
	
	СообщениеОбъект = Документы.СообщениеЭДО.СоздатьДокумент();
	СообщениеОбъект.Дата = ТекущаяДатаСеанса();
	СообщениеОбъект.ЭлектронныйДокумент = ЭлектронныйДокумент;
	СообщениеОбъект.ТипЭлементаРегламента = ОписаниеСообщения.ТипЭлементаРегламента;
	СообщениеОбъект.Направление = ОписаниеСообщения.Направление;
	СообщениеОбъект.ДополнительнаяИнформация = ОписаниеСообщения.ДополнительнаяИнформация;
	СообщениеОбъект.ВидСообщения = ОписаниеСообщения.ВидСообщения;
	
	Если ОписаниеСообщения.Направление = Перечисления.НаправленияЭДО.Входящий Тогда
		СообщениеОбъект.Статус = Перечисления.СтатусыСообщенийЭДО.Получен;
	Иначе
		СообщениеОбъект.Статус = Перечисления.СтатусыСообщенийЭДО.Сформирован;
	КонецЕсли;
	
	СообщениеОбъект.ДатаИзмененияСтатуса = СообщениеОбъект.Дата;
	
	ИспользоватьУтверждение = СообщениеОбъект.Направление = Перечисления.НаправленияЭДО.Входящий
		И СообщениеОбъект.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя
		И НастройкиЭДО.ОтправлятьВходящиеДокументыНаУтверждение(); 
	
	СообщениеОбъект.Состояние = РегламентыЭДО.СостояниеСообщения(СообщениеОбъект, НастройкиДокумента,
		ИспользоватьУтверждение);
	
	СообщениеОбъект.ОсновнойФайл = Справочники.СообщениеЭДОПрисоединенныеФайлы.ПолучитьСсылку();
	
	Если Не СообщениеОбъект.ПроверитьЗаполнение() Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка заполнения сообщения ЭДО'");
	КонецЕсли;
	
	СообщениеОбъект.Записать();
	
	СоздатьПрисоединенныйФайл(СообщениеОбъект.Ссылка, ОписаниеСообщения.Данные.Документ, СообщениеОбъект.ОсновнойФайл);
	
	Если ОписаниеСообщения.Данные.ДополнительныйДокумент.ДвоичныеДанные <> Неопределено Тогда
		СоздатьПрисоединенныйФайл(СообщениеОбъект.Ссылка, ОписаниеСообщения.Данные.ДополнительныйДокумент);
	КонецЕсли;
	
	Возврат СообщениеОбъект;
	
КонецФункции

Функция СоздатьПрисоединенныйФайл(Владелец, ОписаниеДанных, НоваяСсылкаНаФайл = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыДобавленияФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
	ПараметрыДобавленияФайла.ВладелецФайлов = Владелец;
	ПараметрыДобавленияФайла.Служебный = Истина;
	ПараметрыДобавленияФайла.Автор = Пользователи.ТекущийПользователь();
	
	Файл = Новый Файл(ОписаниеДанных.ИмяФайла);
	ПараметрыДобавленияФайла.ИмяБезРасширения = Файл.ИмяБезРасширения;
	ПараметрыДобавленияФайла.РасширениеБезТочки = СтрЗаменить(Файл.Расширение,".","");
	ПараметрыДобавленияФайла.Вставить("ПолноеИмяФайла", Файл.ПолноеИмя);
	
	АдресДвоичныхДанных = ПоместитьВоВременноеХранилище(ОписаниеДанных.ДвоичныеДанные);
	
	ПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыДобавленияФайла, АдресДвоичныхДанных,,,НоваяСсылкаНаФайл);
	
	УдалитьИзВременногоХранилища(АдресДвоичныхДанных);
	
	Возврат ПрисоединенныйФайл;
	
КонецФункции

Функция НовыеНастройкиОтправкиДокумента()
	
	НастройкиОтправки = Новый Структура;
	НастройкиОтправки.Вставить("Организация", Неопределено);
	НастройкиОтправки.Вставить("Контрагент", Неопределено);
	НастройкиОтправки.Вставить("ДоговорКонтрагента", Неопределено);
	НастройкиОтправки.Вставить("ИдентификаторОрганизации", "");
	НастройкиОтправки.Вставить("ИдентификаторКонтрагента", "");
	НастройкиОтправки.Вставить("СпособОбмена", Перечисления.СпособыОбменаЭД.ПустаяСсылка());
	НастройкиОтправки.Вставить("ВидПодписи", Перечисления.ВидыЭлектронныхПодписей.ПустаяСсылка());
	НастройкиОтправки.Вставить("МаршрутПодписания", Справочники.МаршрутыПодписания.ПустаяСсылка());
	НастройкиОтправки.Вставить("Подписанты", Неопределено);
	НастройкиОтправки.Вставить("ОбменБезПодписи", Ложь);
	НастройкиОтправки.Вставить("ТребуетсяИзвещение", Ложь);
	НастройкиОтправки.Вставить("ТребуетсяПодтверждение", Ложь);
	НастройкиОтправки.Вставить("ВыгружатьДополнительныеСведения", Ложь);
	
	Возврат НастройкиОтправки;
	
КонецФункции

#КонецОбласти

#Область СформироватьИсправление

Процедура ВыполнитьДействиеСформироватьИсправление(ПараметрыВыполнения, РезультатДействий)
	
	Выборка = ВыборкаДокументовДляОбработкиДействия(ПараметрыВыполнения.ОбъектыДействий);
	Пока Выборка.Следующий() Цикл
		
		СформироватьИсправление(Выборка.ЭлектронныйДокумент, ПараметрыВыполнения, РезультатДействий);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьИсправление(ЭлектронныйДокумент, ПараметрыВыполнения, РезультатДействий)
	
	Результат = Ложь;
	Действие = Перечисления.ДействияПоЭДО.СформироватьИсправление;
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	
	Если ЭтоВходящийЭДО(ЭлектронныйДокумент) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОбъектыУчетаЭлектронныхДокументов = ИнтеграцияЭДО.ОбъектыУчетаЭлектронныхДокументов(ЭлектронныйДокумент);
	Если Не ЗначениеЗаполнено(ОбъектыУчетаЭлектронныхДокументов) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОбъектыУчета = ОбъектыУчетаЭлектронныхДокументов.ВыгрузитьКолонку("ОбъектУчета");
	РезультатПроверки = ИнтеграцияЭДО.ПроверкаГотовностиКДокументообороту(ОбъектыУчета);
	Если Не ЗначениеЗаполнено(РезультатПроверки.Готовые) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Основания = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РезультатПроверки.Готовые[0]);
	РезультатыЗапросаНастроек = РезультатыЗапросаНастроекОбъектовУчета(ПараметрыВыполнения, Основания);
	
	НаборПараметровФормирования = ПараметрыФормирванияДокумента(ПараметрыВыполнения,
		РезультатыЗапросаНастроек, РезультатДействий);
	
	Если ЗначениеЗаполнено(РезультатДействий.ОшибкиФормирования)
		ИЛИ Не ЗначениеЗаполнено(НаборПараметровФормирования) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыФормирвания = НаборПараметровФормирования[0];
	
	Если ЗначениеЗаполнено(ПараметрыФормирвания.ОбъектУчета) Тогда
		ИдентификаторСвязи = Строка(ПараметрыФормирвания.ОбъектУчета.УникальныйИдентификатор());
	Иначе
		ИдентификаторСвязи = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	НовыйДокументОбъект = НовыйИсходящийДокументОбъект(ПараметрыФормирвания.НастройкиДокумента,
		ПараметрыФормирвания.ОписаниеСообщения, ИдентификаторСвязи, ПараметрыФормирвания.ИдентификаторыОснований);
	
	ПередЗаписьюНовогоДокумента(НовыйДокументОбъект, ПараметрыФормирвания.ОписаниеСообщения);
	
	Если Не НовыйДокументОбъект.ПроверитьЗаполнение() Тогда
		ТекстОшибки = НСтр("ru = 'Ошибка заполнения исходящего электронного документа'");
		ДобавитьОшибкуВыполненияДействияПоДокументу(ЭлектронныйДокумент, Действие, ТекстОшибки, КонтекстДиагностики);
		Возврат Результат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		ЗаблокироватьДанныеДокументаДляИзменения(ЭлектронныйДокумент, Ложь);
		
		ДокументОбъект = ЭлектронныйДокумент.ПолучитьОбъект();
		
		Если ДокументОбъект.Исправлен Тогда
			ОтменитьТранзакцию();
			Возврат Результат;
		КонецЕсли;
		
		ТекстыЗапроса = Новый Массив;
		ТекстыЗапроса.Добавить(ТекстЗапросаСостоянияДокумента());
		ТекстыЗапроса.Добавить(ТекстЗапросаСостоянияСообщений());
		ТекстыЗапроса.Добавить(ТекстЗапросаСвойствСообщенияИнформацииОтправителя());
		
		Запрос = Новый Запрос;
		Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", ДокументОбъект.Ссылка);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		Если РезультатыЗапроса[0].Пустой()
			ИЛИ РезультатыЗапроса[1].Пустой()
			ИЛИ РезультатыЗапроса[2].Пустой() Тогда
			ОтменитьТранзакцию();
			Результат = Ложь;
			Возврат Результат;
		КонецЕсли;
		
		ВыборкаСостояния = РезультатыЗапроса[0].Выбрать();
		ВыборкаСостояния.Следующий();
		
		Если Не ДействиеДоступно(Действие, ВыборкаСостояния.Состояние, ДокументОбъект, КонтекстДиагностики) Тогда
			ОтменитьТранзакцию();
			Результат = Ложь;
			Возврат Результат;
		КонецЕсли;
		
		СостоянияСообщений = РезультатыЗапроса[1].Выгрузить();
		
		СвойстваСообщения = РезультатыЗапроса[2].Выбрать();
		СвойстваСообщения.Выбрать();
		
		ДокументОбъект.Исправлен = Истина;
		ДокументОбъект.Записать();
		
		ДатаИзменения = ТекущаяДатаСеанса();
		
		СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(ДокументОбъект, СостоянияСообщений,
			ДатаИзменения, КонтекстДиагностики);
		
		Комментарий = КомментарийДействия(ПараметрыВыполнения, Действие);
		ЗаписатьДействиеВЖурнал(Действие, ДокументОбъект, СостояниеДокумента, ДатаИзменения, СвойстваСообщения, Комментарий);
		
		НовыйДокументОбъект.Записать();
		
		ПриЗаписиНовогоДокумента(НовыйДокументОбъект, ПараметрыФормирвания.ОписаниеСообщения, КонтекстДиагностики,
			ПараметрыФормирвания.Основания);
		
		Результат = Истина;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоДокументу(ЭлектронныйДокумент, Действие, ТекстОшибки, КонтекстДиагностики);
	КонецПопытки;
	
	Если Результат Тогда
		ПослеЗаписиНовогоДокумента(НовыйДокументОбъект, КонтекстДиагностики);
		ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Перечисления.ДействияПоЭДО.СформироватьИсправление,
			ЭлектронныйДокумент);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Переформировать

Процедура ВыполнитьДействиеПереформировать(ПараметрыВыполнения, РезультатДействий)
	
	Комментарий = КомментарийДействия(ПараметрыВыполнения, Перечисления.ДействияПоЭДО.Переформировать);
	
	Отбор = НовыйОтборСообщенийДляОбработкиДействия();
	Отбор.Состояние.Добавить(Перечисления.СостоянияСообщенийЭДО.Подписание);
	Отбор.Состояние.Добавить(Перечисления.СостоянияСообщенийЭДО.Отправка);
	ВыборкаСообщений = ВыборкаСообщенийДляОбработкиДействия(ПараметрыВыполнения.ОбъектыДействий, Отбор);
	
	Пока ВыборкаСообщений.Следующий() Цикл
		Переформировать(ВыборкаСообщений.Ссылка, РезультатДействий, Комментарий);
	КонецЦикла;
	
КонецПроцедуры

Функция Переформировать(Сообщение, РезультатДействий, Комментарий = "")
	
	Результат = Ложь;
	
	ОшибкиФормирования = РезультатДействий.ОшибкиФормирования;
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	
	Действие = Перечисления.ДействияПоЭДО.Переформировать;
	
	НачатьТранзакцию();
	Попытка
		СообщениеОбъект = ОбщегоНазначенияБЭД.ОбъектПоСсылкеДляИзменения(Сообщение);
		Если СообщениеОбъект.Состояние <> Перечисления.СостоянияСообщенийЭДО.Подписание
			И СообщениеОбъект.Состояние <> Перечисления.СостоянияСообщенийЭДО.ПодготовкаКОтправке
			ИЛИ СообщениеОбъект.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя
			ИЛИ СообщениеОбъект.Направление = Перечисления.НаправленияЭДО.Входящий Тогда
			ОтменитьТранзакцию();
			Возврат Результат;
		КонецЕсли;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ.СообщениеЭДО");
		ЭлементБлокировки.УстановитьЗначение("ЭлектронныйДокумент", СообщениеОбъект.ЭлектронныйДокумент);
		Блокировка.Заблокировать();
		
		ЭтоВходящийЭДО = ЭтоВходящийЭДО(СообщениеОбъект.ЭлектронныйДокумент);
		ТекстыЗапросов = Новый Массив;
		ТекстыЗапросов.Добавить(ТекстЗапросаПараметровОбновленияСостоянияДокумента(ЭтоВходящийЭДО));
		ТекстыЗапросов.Добавить(ТекстЗапросаФайловДокумента());
		
		Отбор = ИнтеграцияЭДО.НовыйОтборОбъектовУчетаЭлектронныхДокументов();
		Отбор.ЭлектронныеДокументы = "&ЭлектронныйДокумент";
		ТекстыЗапросов.Добавить(ИнтеграцияЭДО.ЗапросОбъектовУчетаЭлектронныхДокументов("ВТ_ОбъектыУчета", Отбор).Текст);
		ТекстыЗапросов.Добавить("ВЫБРАТЬ ОбъектУчета ИЗ ВТ_ОбъектыУчета");
		ТекстыЗапросов.Добавить(ТекстЗапросаСвойствОсновногоФайлаИнформацииОтправителя());
		
		Запрос = Новый Запрос;
		Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());;
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", СообщениеОбъект.ЭлектронныйДокумент);
		Запрос.УстановитьПараметр("Сообщение", Сообщение);
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		ПараметрыДокумента = РезультатыЗапроса[0].Выбрать();
		ПараметрыДокумента.Следующий();
		СостоянияСообщений = РезультатыЗапроса[1].Выгрузить();
		
		ФайлыДокумента = РезультатыЗапроса[2].Выбрать();
		
		НаборОбъектовУчета = РезультатыЗапроса[4].Выгрузить().ВыгрузитьКолонку("ОбъектУчета");
		ОбъектУчетаДляФормирования = Неопределено;
		Если ЗначениеЗаполнено(НаборОбъектовУчета) Тогда
			ОбъектУчетаДляФормирования = НаборОбъектовУчета[0];
		КонецЕсли;
		
		Если СообщениеОбъект.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя Тогда
			СвойстваФайлаОснования = РезультатыЗапроса[5].Выбрать();
			СвойстваФайлаОснования.Следующий();
			
			ОписаниеФайла = РаботаСФайламиБЭД.НовоеОписаниеФайла();
			ОписаниеФайла.ИмяФайла = СвойстваФайлаОснования.ПолноеИмяФайла;
			ОписаниеФайла.ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(СвойстваФайлаОснования.Ссылка);
			СодержаниеДокумента = ФорматыЭДО.ПрочитатьСодержаниеДокумента(ОписаниеФайла);
			
			ПараметрыФормирования = ИнтеграцияЭДО.НовыеПараметрыФормированияДанныхОбъектаУчет();
			ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ПараметрыДокумента);
			ПараметрыФормирования.Формат = ФорматыЭДО.ФорматОтветногоТитула(СодержаниеДокумента.Формат);
			ПараметрыФормирования.ТипДокумента = СодержаниеДокумента.ТипДокумента;
			ОписаниеДанных = ИнтеграцияЭДО.ОписаниеДанныхОбъектаУчета(НаборОбъектовУчета, ПараметрыФормирования);
			
			РезультатФормирования = ОписаниеСообщенияПолучателяПоОбъектуУчета(НаборОбъектовУчета, ОписаниеДанных.Данные,
				ПараметрыДокумента, СвойстваФайлаОснования, ПараметрыФормирования.Формат);
		Иначе
			СвойстваФайлаОснования = РезультатыЗапроса[5].Выбрать();
			СвойстваФайлаОснования.Следующий();
			РезультатФормирования = ОписаниеСлужебногоСообщения(ПараметрыДокумента, СвойстваФайлаОснования,
			СообщениеОбъект.ТипДокумента, СообщениеОбъект.ТипЭлементаРегламента);
		КонецЕсли;
		
		Если РезультатФормирования.ЕстьОшибки Тогда
			ОписаниеОшибки = НовоеОписаниеОшибкиФормирования();
			ЗаполнитьЗначенияСвойств(ОписаниеОшибки.ОписаниеОбъектаУчета, ПараметрыДокумента);
			ОписаниеВидаДокумента = ОписаниеВидаДокумента(ПараметрыДокумента.ВидДокумента);
			ЗаполнитьЗначенияСвойств(ОписаниеОшибки.ОписаниеОбъектаУчета, ОписаниеВидаДокумента);
			ОписаниеОшибки.ОписаниеОбъектаУчета.ОбъектУчета = ОбъектУчетаДляФормирования;
			ОписаниеОшибки.ОписаниеОбъектаУчета.Направление = СообщениеОбъект.Направление;
			ОписаниеОшибки.ВидДокумента = ПараметрыДокумента.ВидДокумента;
			ОписаниеОшибки.ОшибкиДанных = РезультатФормирования.Ошибки;
			ОшибкиФормирования.Добавить(ОписаниеОшибки);
			
			ЗафиксироватьТранзакцию();
			Возврат Результат;
		КонецЕсли;
		
		ИнформацияОФайле = Новый Структура;
		ИнформацияОФайле.Вставить("АдресФайлаВоВременномХранилище", "");
		ИнформацияОФайле.Вставить("АдресВременногоХранилищаТекста", "");
		
		Пока ФайлыДокумента.Следующий() Цикл
			Если ФайлыДокумента.Основной Тогда
				ИнформацияОФайле.АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(
					РезультатФормирования.Документ.ДвоичныеДанные);
				РаботаСФайлами.ОбновитьФайл(ФайлыДокумента.Ссылка, ИнформацияОФайле);
				УдалитьПодписи(ФайлыДокумента.Ссылка, ПараметрыДокумента.ВидПодписи);
			Иначе
				ФайлОбъект = ФайлыДокумента.Ссылка.ПолучитьОбъект();
				ФайлОбъект.УстановитьПометкуУдаления();
			КонецЕсли;
		КонецЦикла;
		
		СообщениеОбъект.Дата = ТекущаяДатаСеанса();
		СообщениеОбъект.ДатаИзмененияСтатуса = СообщениеОбъект.Дата;
		СообщениеОбъект.Статус = Перечисления.СтатусыСообщенийЭДО.Сформирован;
		СообщениеОбъект.Состояние = РегламентыЭДО.СостояниеСообщения(СообщениеОбъект, ПараметрыДокумента);
		СообщениеОбъект.Записать();
		
		НайденнаяСтрока = СостоянияСообщений.Найти(СообщениеОбъект.Ссылка, "Ссылка");
		НайденнаяСтрока.Состояние = СообщениеОбъект.Состояние;
		
		СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(ПараметрыДокумента, СостоянияСообщений,
			СообщениеОбъект.ДатаИзмененияСтатуса, КонтекстДиагностики);
		
		ЗаписатьДействиеВЖурнал(Действие, ПараметрыДокумента, СостояниеДокумента, СообщениеОбъект.ДатаИзмененияСтатуса,
			СообщениеОбъект, Комментарий);
		
		ЭлектронныеДокументыЭДОСобытия.ПриИзмененииСостоянияЭлектронногоДокумента(СообщениеОбъект.ЭлектронныйДокумент,
			СостояниеДокумента, КонтекстДиагностики);
		
		Результат = Истина;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоСообщению(Сообщение, Действие, ТекстОшибки, КонтекстДиагностики);
	КонецПопытки;
	
	Если Результат Тогда
		ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Действие, СообщениеОбъект.ЭлектронныйДокумент);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаФайловДокумента()
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПрисоединенныеФайлы.Ссылка,
		|	ПрисоединенныеФайлы.Ссылка = СообщениеЭДО.ОсновнойФайл КАК Основной
		|ИЗ
		|	Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ПО ПрисоединенныеФайлы.ВладелецФайла = СообщениеЭДО.Ссылка
		|ГДЕ
		|	ПрисоединенныеФайлы.ВладелецФайла = &ЭлектронныйДокумент";
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапросаСвойствОсновногоФайлаИнформацииОтправителя()
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПрисоединенныеФайлы.Ссылка,
		|	ПрисоединенныеФайлы.ПолноеИмяФайла,
		|	ПрисоединенныеФайлы.ДатаСоздания
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|		ПО СообщениеЭДО.Ссылка = ПрисоединенныеФайлы.ВладелецФайла
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент
		|	И СообщениеЭДО.ТипЭлементаРегламента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовРегламента.ИнформацияОтправителя)";
	Возврат ТекстЗапроса;
КонецФункции

#КонецОбласти

#Область Закрыть

Процедура ВыполнитьДействиеЗакрыть(ПараметрыВыполнения, РезультатДействий)
	
	Комментарий = КомментарийДействия(ПараметрыВыполнения, Перечисления.ДействияПоЭДО.ЗакрытьПринудительно);
	
	Если ЗначениеЗаполнено(ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов) Тогда
		
		Для Каждого ПакетДокументов Из ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов Цикл
			ЗакрытьПринудительноДокументыПакета(ПакетДокументов, РезультатДействий, Комментарий);
		КонецЦикла;
		
	Иначе
		
		КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
		Выборка = ВыборкаДокументовДляОбработкиДействия(ПараметрыВыполнения.ОбъектыДействий);
		Пока Выборка.Следующий() Цикл
			Если ЗакрытьПринудительно(Выборка.ЭлектронныйДокумент, КонтекстДиагностики, Комментарий) Тогда
				ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Перечисления.ДействияПоЭДО.ЗакрытьПринудительно,
					Выборка.ЭлектронныйДокумент);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗакрытьПринудительно(ЭлектронныйДокумент, КонтекстДиагностики, Комментарий = "")
	Действие = Перечисления.ДействияПоЭДО.ЗакрытьПринудительно;
	ПричинаОстановки = Перечисления.ПричиныОстановкиЭДО.ЗакрытПринудительно;
	Результат = ОстановитьДокумент(ЭлектронныйДокумент, ПричинаОстановки, Действие, КонтекстДиагностики, Комментарий);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОчередьПриемаСообщенийЭДО.СообщениеЭДО КАК СообщениеЭДО
		|ИЗ
		|	РегистрСведений.ОчередьПриемаСообщенийЭДО КАК ОчередьПриемаСообщенийЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщенияЭДО
		|		ПО ОчередьПриемаСообщенийЭДО.СообщениеЭДО = СообщенияЭДО.Ссылка
		|ГДЕ
		|	СообщенияЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент";
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		РегистрыСведений.ОчередьПриемаСообщенийЭДО.УдалитьЗапись(Выборка.СообщениеЭДО);
	КонецЦикла;
	
	РегистрыСведений.ОшибкиЭДОКИсправлению.УдалитьЗаписьОбОшибке(ЭлектронныйДокумент);
	
	Возврат Результат;
КонецФункции

Процедура ЗакрытьПринудительноДокументыПакета(ПакетДокументов, РезультатДействий, Комментарий)
	
	Действие = Перечисления.ДействияПоЭДО.ЗакрытьПринудительно;
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	ОбработанныеДокументы = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		ЗаблокироватьПакетДокументовДляИзменения(ПакетДокументов);
		
		ДокументыПакета = ДокументыПакета(ПакетДокументов);
		
		ЗаблокироватьДокументыПакетаДляИзменения(ДокументыПакета);
		
		СостоянияПоДокументам = СостоянияПоДокументам(ДокументыПакета);
		
		НаборСостояний = Новый Массив;
		Для Каждого СостояниеПоДокументу Из СостоянияПоДокументам Цикл
			НаборСостояний.Добавить(СостояниеПоДокументу.Значение);
		КонецЦикла;
		
		Если Не СостоянияДокументовПакетаОднородны(НаборСостояний, ПакетДокументов, Действие, КонтекстДиагностики) Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		СостоянияЗавершенногоЭДО = РегламентыЭДО.СостоянияЗавершенногоЭДО();
		
		Для Каждого СостояниеПоДокументу Из СостоянияПоДокументам Цикл
			
			Если СостоянияЗавершенногоЭДО.Найти(СостояниеПоДокументу.Значение) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ЗакрытьПринудительно(СостояниеПоДокументу.Ключ, КонтекстДиагностики, Комментарий) Тогда
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			
			ОбработанныеДокументы.Добавить(СостояниеПоДокументу.Ключ);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоПакету(ПакетДокументов, Действие, ТекстОшибки, КонтекстДиагностики);
		Возврат;
	КонецПопытки;
	
	Для Каждого ЭлектронныйДокумент Из ОбработанныеДокументы Цикл
		ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Действие, ЭлектронныйДокумент);
	КонецЦикла;
	
КонецПроцедуры

Функция ОстановитьДокумент(ЭлектронныйДокумент, ПричинаОстановки, Действие, КонтекстДиагностики, Комментарий = "")
	
	Результат = Ложь;
	
	НачатьТранзакцию();
	Попытка
		
		ЭтоВходящийЭДО = ЭтоВходящийЭДО(ЭлектронныйДокумент);
		
		ЗаблокироватьДанныеДокументаДляИзменения(ЭлектронныйДокумент, ЭтоВходящийЭДО);
		
		ДокументОбъект = ЭлектронныйДокумент.ПолучитьОбъект();
		ДокументОбъект.Остановлен = Истина;
		ДокументОбъект.ПричинаОстановки = ПричинаОстановки;
		
		Если Действие = Перечисления.ДействияПоЭДО.Загрузить
			И ПричинаОстановки = Перечисления.ПричиныОстановкиЭДО.ОтклонениеПриглашения
			И НастройкиЭДО.ОзнакомлениеСЭлектроннымиДокументами() Тогда
			ДокументОбъект.НаОзнакомлении = Истина;
		КонецЕсли;
		
		ДокументОбъект.Записать();
		
		ТекстыЗапроса = Новый Массив;
		ТекстыЗапроса.Добавить(ТекстЗапросаСостоянияДокумента());
		ТекстыЗапроса.Добавить(ТекстЗапросаСостоянияСообщений());
		ТекстыЗапроса.Добавить(ТекстЗапросаСвойствСообщенияИнформацииОтправителя());
		
		Запрос = Новый Запрос;
		Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", ДокументОбъект.Ссылка);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		Если РезультатыЗапроса[0].Пустой()
			ИЛИ РезультатыЗапроса[1].Пустой()
			ИЛИ РезультатыЗапроса[2].Пустой() Тогда
			ОтменитьТранзакцию();
			Возврат Результат;
		КонецЕсли;
		
		ВыборкаСостояния = РезультатыЗапроса[0].Выбрать();
		ВыборкаСостояния.Следующий();
		
		Если Не ДействиеДоступно(Действие, ВыборкаСостояния.Состояние, ДокументОбъект, КонтекстДиагностики) Тогда
			ЗафиксироватьТранзакцию();
			Возврат Результат;
		КонецЕсли;
		
		СостоянияСообщений = РезультатыЗапроса[1].Выгрузить();
		
		СвойстваСообщения = РезультатыЗапроса[2].Выбрать();
		СвойстваСообщения.Выбрать();
		
		ДатаИзменения = ТекущаяДатаСеанса();
		
		УстановитьСостояниеХранение(СостоянияСообщений, ДатаИзменения);
		
		СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(ДокументОбъект, СостоянияСообщений,
			ДатаИзменения, КонтекстДиагностики,,Комментарий);
		
		ЗаписатьДействиеВЖурнал(Действие, ДокументОбъект, СостояниеДокумента, ДатаИзменения, СвойстваСообщения, Комментарий);
		
		Результат = Истина;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоДокументу(ЭлектронныйДокумент, Действие, ТекстОшибки, КонтекстДиагностики);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ВозобновитьДокумент(ЭлектронныйДокумент, Действие, КонтекстДиагностики, Комментарий = "")
	
	Результат = Истина;
	
	НачатьТранзакцию();
	Попытка
		
		ЭтоВходящийЭДО = ЭтоВходящийЭДО(ЭлектронныйДокумент);
		
		ЗаблокироватьДанныеДокументаДляИзменения(ЭлектронныйДокумент, ЭтоВходящийЭДО);
		
		ДокументОбъект = ЭлектронныйДокумент.ПолучитьОбъект();
		Если Не ДокументОбъект.Остановлен Тогда
			ЗафиксироватьТранзакцию();
			Результат = Ложь;
			Возврат Результат;
		КонецЕсли;
		
		ДокументОбъект.Остановлен = Ложь;
		ДокументОбъект.ПричинаОстановки = Перечисления.ПричиныОстановкиЭДО.ПустаяСсылка();
		ДокументОбъект.Записать();
		
		ТекстыЗапроса = Новый Массив;
		ТекстыЗапроса.Добавить(ТекстЗапросаСостоянияДокумента());
		ТекстыЗапроса.Добавить(ТекстЗапросаСостоянияСообщений());
		ТекстыЗапроса.Добавить(ТекстЗапросаСвойствСообщенияИнформацииОтправителя());
		
		Запрос = Новый Запрос;
		Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", ДокументОбъект.Ссылка);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		Если РезультатыЗапроса[0].Пустой()
			ИЛИ РезультатыЗапроса[1].Пустой()
			ИЛИ РезультатыЗапроса[2].Пустой() Тогда
			ОтменитьТранзакцию();
			Результат = Ложь;
			Возврат Результат;
		КонецЕсли;
		
		ВыборкаСостояния = РезультатыЗапроса[0].Выбрать();
		ВыборкаСостояния.Следующий();
		
		Если Не ДействиеДоступно(Действие, ВыборкаСостояния.Состояние, ДокументОбъект, КонтекстДиагностики) Тогда
			ОтменитьТранзакцию();
			Результат = Ложь;
			Возврат Результат;
		КонецЕсли;
		
		СостоянияСообщений = РезультатыЗапроса[1].Выгрузить();
		
		СвойстваСообщения = РезультатыЗапроса[2].Выбрать();
		СвойстваСообщения.Выбрать();
		
		ПересчитатьСостоянияСообщений(СостоянияСообщений, ДокументОбъект);
		
		ДатаИзменения = ТекущаяДатаСеанса();
		
		СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(ДокументОбъект, СостоянияСообщений,
			ДатаИзменения, КонтекстДиагностики);
		
		ЗаписатьДействиеВЖурнал(Действие, ДокументОбъект, СостояниеДокумента, ДатаИзменения, СвойстваСообщения, Комментарий);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат = Ложь;
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоДокументу(ЭлектронныйДокумент, Действие, ТекстОшибки, КонтекстДиагностики);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Закрывает электронный документ.
// 
// Параметры:
// 	ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - Ссылка на электронный документ.
// 	КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
// 	Комментарий - Строка - Описание причины закрытия.
// Возвращаемое значение:
// 	Булево - Истина, если ЭлектронныйДокумент закрыт.
Функция ЗакрытьДокумент(ЭлектронныйДокумент, КонтекстДиагностики, Комментарий = "") Экспорт
	
	Если ВыполнениеДействийПоЭДОЗапрещено(КонтекстДиагностики) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КонтекстДиагностики) Тогда
		КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	КонецЕсли;
	
	Возврат ЗакрытьПринудительно(ЭлектронныйДокумент, КонтекстДиагностики, Комментарий);
	
КонецФункции

#КонецОбласти

#Область ВернутьВРаботу

Процедура ВыполнитьДействиеВернутьВРаботу(ПараметрыВыполнения, РезультатДействий)
	
	Комментарий = КомментарийДействия(ПараметрыВыполнения, Перечисления.ДействияПоЭДО.ЗакрытьПринудительно);
	
	Если ЗначениеЗаполнено(ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов) Тогда
		
		Для Каждого ПакетДокументов Из ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов Цикл
			ВернутьВРаботуДокументыПакета(ПакетДокументов, РезультатДействий, Комментарий);
		КонецЦикла;
		
	Иначе
		
		КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
		Выборка = ВыборкаДокументовДляОбработкиДействия(ПараметрыВыполнения.ОбъектыДействий);
		Пока Выборка.Следующий() Цикл
			Если ВернутьВРаботу(Выборка.ЭлектронныйДокумент, КонтекстДиагностики, Комментарий) Тогда
				ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Перечисления.ДействияПоЭДО.ВернутьВРаботу,
					Выборка.ЭлектронныйДокумент);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВернутьВРаботу(ЭлектронныйДокумент, КонтекстДиагностики, Комментарий = "")
	Действие = Перечисления.ДействияПоЭДО.ВернутьВРаботу;
	Результат = ВозобновитьДокумент(ЭлектронныйДокумент, Действие, КонтекстДиагностики, Комментарий);
	Возврат Результат;
КонецФункции

Процедура ВернутьВРаботуДокументыПакета(ПакетДокументов, РезультатДействий, Комментарий = "")
	
	Действие = Перечисления.ДействияПоЭДО.ВернутьВРаботу;
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	ОбработанныеДокументы = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		ДокументыПакета = ДокументыПакетаДляИзменения(ПакетДокументов, Действие, КонтекстДиагностики);
		Если Не ЗначениеЗаполнено(ДокументыПакета) Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
			
		Для Каждого ЭлектронныйДокумент Из ДокументыПакета Цикл
			Если Не ВозобновитьДокумент(ЭлектронныйДокумент, Действие, КонтекстДиагностики, Комментарий) Тогда
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			ОбработанныеДокументы.Добавить(ЭлектронныйДокумент);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоПакету(ПакетДокументов, Действие, ТекстОшибки, КонтекстДиагностики);
		Возврат;
	КонецПопытки;
	
	Для Каждого ЭлектронныйДокумент Из ОбработанныеДокументы Цикл
		ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Действие, ЭлектронныйДокумент);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОтправитьВАрхив

Процедура ВыполнитьДействиеОтправитьВАрхив(ПараметрыВыполнения, РезультатДействий)
	
	Комментарий = КомментарийДействия(ПараметрыВыполнения, Перечисления.ДействияПоЭДО.ЗакрытьПринудительно);
	
	Если ЗначениеЗаполнено(ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов) Тогда
		
		Для Каждого ПакетДокументов Из ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов Цикл
			ОтправитьВАрхивДокументыПакета(ПакетДокументов, РезультатДействий, Комментарий);
		КонецЦикла;
		
	Иначе
		
		КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
		Выборка = ВыборкаДокументовДляОбработкиДействия(ПараметрыВыполнения.ОбъектыДействий);
		Пока Выборка.Следующий() Цикл
			Если ОтправитьВАрхив(Выборка.ЭлектронныйДокумент, КонтекстДиагностики, Комментарий) Тогда
				ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Перечисления.ДействияПоЭДО.ОтправитьВАрхив,
					Выборка.ЭлектронныйДокумент);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОтправитьВАрхив(ЭлектронныйДокумент, КонтекстДиагностики, Комментарий = "")
	
	Результат = Истина;
	
	Действие = Перечисления.ДействияПоЭДО.ОтправитьВАрхив;
	
	НачатьТранзакцию();
	Попытка
		
		ЭтоВходящийЭДО = ЭтоВходящийЭДО(ЭлектронныйДокумент);
		
		ЗаблокироватьДанныеДокументаДляИзменения(ЭлектронныйДокумент, ЭтоВходящийЭДО);
		
		ДокументОбъект = ЭлектронныйДокумент.ПолучитьОбъект();
		Если Не ДокументОбъект.НаОзнакомлении Тогда
			ЗафиксироватьТранзакцию();
			Возврат Результат;
		КонецЕсли;
		
		ТекстыЗапроса = Новый Массив;
		ТекстыЗапроса.Добавить(ТекстЗапросаСостоянияДокумента());
		ТекстыЗапроса.Добавить(ТекстЗапросаСвойствСообщенияИнформацииОтправителя());
		
		Запрос = Новый Запрос;
		Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", ДокументОбъект.Ссылка);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		Если РезультатыЗапроса[0].Пустой()
			ИЛИ РезультатыЗапроса[1].Пустой() Тогда
			ОтменитьТранзакцию();
			Результат = Ложь;
		КонецЕсли;
		
		ВыборкаСостояния = РезультатыЗапроса[0].Выбрать();
		ВыборкаСостояния.Следующий();
		
		Если Не ДействиеДоступно(Действие, ВыборкаСостояния.Состояние, ДокументОбъект, КонтекстДиагностики) Тогда
			ОтменитьТранзакцию();
			Результат = Ложь;
		КонецЕсли;
		
		СвойстваСообщения = РезультатыЗапроса[1].Выбрать();
		СвойстваСообщения.Выбрать();
		
		ДокументОбъект.НаОзнакомлении = Ложь;
		ДокументОбъект.Записать();
		
		СостояниеДокумента = СостояниеДокумента(ЭлектронныйДокумент);
		
		ЗаписатьДействиеВЖурнал(Действие, ДокументОбъект, СостояниеДокумента, ТекущаяДатаСеанса(),
			СвойстваСообщения, Комментарий);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат = Ложь;
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоДокументу(ЭлектронныйДокумент, Действие, ТекстОшибки, КонтекстДиагностики);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Процедура ОтправитьВАрхивДокументыПакета(ПакетДокументов, РезультатДействий, Комментарий = "")
	
	Действие = Перечисления.ДействияПоЭДО.ОтправитьВАрхив;
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	ОбработанныеДокументы = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		ДокументыПакета = ДокументыПакетаДляИзменения(ПакетДокументов, Действие, КонтекстДиагностики);
		Если Не ЗначениеЗаполнено(ДокументыПакета) Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
			
		Для Каждого ЭлектронныйДокумент Из ДокументыПакета Цикл
			Если Не ОтправитьВАрхив(ЭлектронныйДокумент, КонтекстДиагностики, Комментарий) Тогда
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			ОбработанныеДокументы.Добавить(ЭлектронныйДокумент);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоПакету(ПакетДокументов, Действие, ТекстОшибки, КонтекстДиагностики);
		Возврат;
	КонецПопытки;
	
	Для Каждого ЭлектронныйДокумент Из ОбработанныеДокументы Цикл
		ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Действие, ЭлектронныйДокумент);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОтклонитьПодписание

Процедура ВыполнитьДействиеОтклонитьПодписание(ПараметрыВыполнения, РезультатДействий)
	
	Комментарий = КомментарийДействия(ПараметрыВыполнения, Перечисления.ДействияПоЭДО.ОтклонитьПодписание);
	
	Если ЗначениеЗаполнено(ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов) Тогда
		
		Для Каждого ПакетДокументов Из ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов Цикл
			ОтклонитьПодписаниеДокументовПакета(ПакетДокументов, РезультатДействий, Комментарий);
		КонецЦикла;
		
	Иначе
		
		КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
		Выборка = ВыборкаДокументовДляОбработкиДействия(ПараметрыВыполнения.ОбъектыДействий);
		Пока Выборка.Следующий() Цикл
			Если ОтклонитьПодписание(Выборка.ЭлектронныйДокумент, КонтекстДиагностики, Комментарий) Тогда
				ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Перечисления.ДействияПоЭДО.ОтклонитьПодписание,
					Выборка.ЭлектронныйДокумент);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОтклонитьПодписание(ЭлектронныйДокумент, КонтекстДиагностики, Комментарий = "")
	
	Результат = Ложь;
	
	Если ЭтоВходящийЭДО(ЭлектронныйДокумент) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Действие = Перечисления.ДействияПоЭДО.ОтклонитьПодписание;
	Причина = Перечисления.ПричиныОстановкиЭДО.ОтклонениеПодписания;
	Возврат ОстановитьДокумент(ЭлектронныйДокумент, Причина, Действие, КонтекстДиагностики, Комментарий);
	
КонецФункции

Процедура ОтклонитьПодписаниеДокументовПакета(ПакетДокумента, РезультатДействий, Комментарий = "")
	
	Действие = Перечисления.ДействияПоЭДО.ОтклонитьПодписание;
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	ОбработанныеДокументы = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		ДокументыПакета = ДокументыПакетаДляИзменения(ПакетДокумента, Действие, КонтекстДиагностики);
		Если Не ЗначениеЗаполнено(ДокументыПакета) Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Для Каждого ЭлектронныйДокумент Из ДокументыПакета Цикл
			Если Не ОтклонитьПодписание(ЭлектронныйДокумент, КонтекстДиагностики, Комментарий) Тогда
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			ОбработанныеДокументы.Добавить(ЭлектронныйДокумент);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоПакету(ПакетДокумента, Действие, ТекстОшибки, КонтекстДиагностики);
		Возврат;
	КонецПопытки;
	
	Для Каждого ЭлектронныйДокумент Из ОбработанныеДокументы Цикл
		ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Действие, ЭлектронныйДокумент);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Отклонить

Процедура ВыполнитьДействиеОтклонить(ПараметрыВыполнения, РезультатДействий)
	
	Комментарий = КомментарийДействия(ПараметрыВыполнения, Перечисления.ДействияПоЭДО.Отклонить);
	
	Если ЗначениеЗаполнено(ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов) Тогда
		
		Для Каждого ПакетДокументов Из ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов Цикл
			ОтклонитьДокументыПакета(ПакетДокументов, РезультатДействий, Комментарий);
		КонецЦикла;
		
	Иначе
		
		Отбор = НовыйОтборСообщенийДляОбработкиДействия();
		Отбор.ТипЭлементаРегламента.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);
		ВыборкаСообщений = ВыборкаСообщенийДляОбработкиДействия(ПараметрыВыполнения.ОбъектыДействий, Отбор);
		Пока ВыборкаСообщений.Следующий() Цикл
			ОтклонитьДокумент(ВыборкаСообщений.Ссылка, РезультатДействий, Комментарий);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтклонитьДокумент(Сообщение, РезультатДействий, Комментарий = "")
	
	РезультатОтклонения = Отклонить(Сообщение, РезультатДействий.КонтекстДиагностики, Комментарий);
	
	Если РезультатОтклонения.Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПослеОтклонения(РезультатОтклонения, РезультатДействий);
	
КонецПроцедуры

Процедура ОтклонитьДокументыПакета(ПакетДокументов, РезультатДействий, Комментарий)
	
	Действие = Перечисления.ДействияПоЭДО.Отклонить;
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	НаборРезультатов = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		СообщенияПакета = СообщенияПакетаДляИзменения(ПакетДокументов, Действие, КонтекстДиагностики,,
			Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);
		Если Не ЗначениеЗаполнено(СообщенияПакета) Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Для Каждого Сообщение Из СообщенияПакета Цикл
			Результат = Отклонить(Сообщение, КонтекстДиагностики, Комментарий);
			Если Результат.Отказ Тогда
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			НаборРезультатов.Добавить(Результат);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоПакету(ПакетДокументов, Действие, ТекстОшибки, КонтекстДиагностики);
		Возврат;
	КонецПопытки;
	
	Для Каждого РезультатОтклонения Из НаборРезультатов Цикл
		ПослеОтклонения(РезультатОтклонения, РезультатДействий);
	КонецЦикла;
	
КонецПроцедуры

Функция Отклонить(Сообщение, КонтекстДиагностики, Комментарий = "")
	
	Результат = Новый Структура;
	Результат.Вставить("Отказ", Ложь);
	Результат.Вставить("СообщениеОбъект", Неопределено);
	Результат.Вставить("ТаблицаПодписания", Неопределено);
	
	Действие = Перечисления.ДействияПоЭДО.Отклонить;
	
	НачатьТранзакцию();
	Попытка
		СообщениеОбъект = ОбщегоНазначенияБЭД.ОбъектПоСсылкеДляИзменения(Сообщение);
		Если СообщениеОбъект.ТипЭлементаРегламента <> Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя Тогда
			ОтменитьТранзакцию();
			Результат.Отказ = Истина;
			Возврат Результат;
		КонецЕсли;
		
		СообщениеОбъект.Состояние = Перечисления.СостоянияСообщенийЭДО.Хранение;
		СообщениеОбъект.Записать();
		
		ЭтоВходящийЭДО = ЭтоВходящийЭДО(СообщениеОбъект.ЭлектронныйДокумент);
		
		ЗаблокироватьДанныеСообщенияДляИзменения(СообщениеОбъект, ЭтоВходящийЭДО);
		
		ТекстыЗапросов = Новый Массив;
		ТекстыЗапросов.Добавить(ТекстЗапросаПараметровОбновленияСостоянияДокумента(ЭтоВходящийЭДО));
		ТекстыЗапросов.Добавить(ТекстЗапросаСвойствОсновногоФайла());
	
		Запрос = Новый Запрос;
		Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", СообщениеОбъект.ЭлектронныйДокумент);
		Запрос.УстановитьПараметр("ОсновнойФайл", СообщениеОбъект.ОсновнойФайл);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		ПараметрыДокумента = РезультатыЗапроса[0].Выбрать();
		ПараметрыДокумента.Следующий();
		СостоянияДокументов = РезультатыЗапроса[1].Выгрузить();
		
		Если Не РегламентыЭДО.ОтклонениеДоступно(СостоянияДокументов, ЭтоВходящийЭДО) Тогда
			ОтменитьТранзакцию();
			Результат.Отказ = Истина;
			Возврат Результат;
		КонецЕсли;
		
		СвойстваОсновногоФайла = РезультатыЗапроса[2].Выбрать();
		СвойстваОсновногоФайла.Следующий();
		
		СообщениеОбъект = СоздатьСлужебноеСообщение(ПараметрыДокумента, СвойстваОсновногоФайла,
			Перечисления.ТипыДокументовЭДО.УведомлениеОбУточнении, Перечисления.ТипыЭлементовРегламентаЭДО.УОУ, Комментарий);
		
		Если СообщениеОбъект = Неопределено Тогда
			ТекстОшибки = НСтр("ru = 'Не удалось сформировать уведомление об уточнении'");
			ДобавитьОшибкуВыполненияДействияПоСообщению(Сообщение, Действие, ТекстОшибки, КонтекстДиагностики);
			ОтменитьТранзакцию();
			Результат.Отказ = Истина;
			Возврат Результат;
		КонецЕсли;
		
		УстановитьСостояниеХранение(СостоянияДокументов, СообщениеОбъект.ДатаИзмененияСтатуса);
		
		ЗаполнитьЗначенияСвойств(СостоянияДокументов.Добавить(), СообщениеОбъект);
		
		ДополненияСостоянийЭДО = Неопределено;
		Если Не ПараметрыДокумента.ОбменБезПодписи Тогда
			ПараметрыМаршрута = СформироватьМаршрутПодписания(СообщениеОбъект);
			Результат.ТаблицаПодписания = ПараметрыМаршрута.ТаблицаПодписания;
			ДополненияСостоянийЭДО = ДополненияСостоянийЭДОПриПодписании(СообщениеОбъект, ПараметрыДокумента.ВидПодписи,
				ПараметрыМаршрута.ВесМаршрута);
		КонецЕсли;
		
		СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(ПараметрыДокумента, СостоянияДокументов,
			СообщениеОбъект.ДатаИзмененияСтатуса, КонтекстДиагностики, ДополненияСостоянийЭДО, Комментарий);
		
		ЗаписатьДействиеВЖурнал(Действие, ПараметрыДокумента, СостояниеДокумента,
			СообщениеОбъект.ДатаИзмененияСтатуса, СообщениеОбъект, Комментарий);
		
		Результат.СообщениеОбъект = СообщениеОбъект;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат.Отказ = Истина;
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоСообщению(Сообщение, Действие, ТекстОшибки, КонтекстДиагностики);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Процедура ПослеОтклонения(РезультатОтклонения, РезультатДействий)
	
	ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Перечисления.ДействияПоЭДО.Отклонить,
		РезультатОтклонения.СообщениеОбъект.ЭлектронныйДокумент);
	
	ОповеститьОДокументеКПодписанию(РезультатОтклонения.СообщениеОбъект, РезультатОтклонения.ТаблицаПодписания);
	
КонецПроцедуры

#КонецОбласти

#Область Аннулировать

Процедура ВыполнитьДействиеАннулировать(ПараметрыВыполнения, РезультатДействий)
	
	Комментарий = КомментарийДействия(ПараметрыВыполнения, Перечисления.ДействияПоЭДО.Аннулировать);
	
	Если ЗначениеЗаполнено(ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов) Тогда
		
		Для Каждого ПакетДокументов Из ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов Цикл
			АннулироватьДокументыПакета(ПакетДокументов, РезультатДействий, Комментарий);
		КонецЦикла;
		
	Иначе
		
		Отбор = НовыйОтборСообщенийДляОбработкиДействия();
		Отбор.ТипЭлементаРегламента.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);
		ВыборкаСообщений = ВыборкаСообщенийДляОбработкиДействия(ПараметрыВыполнения.ОбъектыДействий, Отбор);
		Пока ВыборкаСообщений.Следующий() Цикл
			АннулироватьДокумент(ВыборкаСообщений.Ссылка, РезультатДействий, Комментарий);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура АннулироватьДокумент(Сообщение, РезультатДействий, Комментарий = "")
	
	Результат = Аннулировать(Сообщение, РезультатДействий.КонтекстДиагностики, Комментарий);
	
	Если Результат.Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Перечисления.ДействияПоЭДО.Аннулировать,
		Результат.СообщениеОбъект.ЭлектронныйДокумент);
	
	ОповеститьОДокументеКПодписанию(Результат.СообщениеОбъект, Результат.ТаблицаПодписания);
	
КонецПроцедуры

Процедура АннулироватьДокументыПакета(ПакетДокументов, РезультатДействий, Комментарий = "")
	
	Действие = Перечисления.ДействияПоЭДО.Аннулировать;
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	НаборРезультатов = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		СообщенияПакета = СообщенияПакетаДляИзменения(ПакетДокументов, Действие, КонтекстДиагностики,,
			Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);
		Если Не ЗначениеЗаполнено(СообщенияПакета) Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Для Каждого Сообщение Из СообщенияПакета Цикл
			Результат = Аннулировать(Сообщение, КонтекстДиагностики, Комментарий);
			Если Результат.Отказ Тогда
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			НаборРезультатов.Добавить(Результат);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоПакету(ПакетДокументов, Действие, ТекстОшибки, КонтекстДиагностики);
		Возврат;
	КонецПопытки;
	
	Для Каждого РезультатОбработки Из НаборРезультатов Цикл
		ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Действие,
			РезультатОбработки.СообщениеОбъект.ЭлектронныйДокумент);
		ОповеститьОДокументеКПодписанию(РезультатОбработки.СообщениеОбъект, РезультатОбработки.ТаблицаПодписания);
	КонецЦикла;
	
КонецПроцедуры

Функция Аннулировать(Сообщение, КонтекстДиагностики, Комментарий = "")
	
	Результат = Новый Структура;
	Результат.Вставить("Отказ", Ложь);
	Результат.Вставить("СообщениеОбъект", Неопределено);
	Результат.Вставить("ТаблицаПодписания", Неопределено);
	
	Действие = Перечисления.ДействияПоЭДО.Аннулировать;
	
	НачатьТранзакцию();
	Попытка
		
		СообщениеОбъект = ОбщегоНазначенияБЭД.ОбъектПоСсылкеДляИзменения(Сообщение);
		Если СообщениеОбъект.ТипЭлементаРегламента <> Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя Тогда
			ОтменитьТранзакцию();
			Результат.Отказ = Истина;
			Возврат Результат;
		КонецЕсли;
		
		СообщениеОбъект.Состояние = Перечисления.СостоянияСообщенийЭДО.Хранение;
		СообщениеОбъект.Записать();
		
		ЭтоВходящийЭДО = ЭтоВходящийЭДО(СообщениеОбъект.ЭлектронныйДокумент);
		ЗаблокироватьДанныеСообщенияДляИзменения(СообщениеОбъект, ЭтоВходящийЭДО);
		
		ТекстыЗапросов = Новый Массив;
		ТекстыЗапросов.Добавить(ТекстЗапросаПараметровОбновленияСостоянияДокумента(ЭтоВходящийЭДО));
		Если СообщениеОбъект.Направление <> Перечисления.НаправленияЭДО.Внутренний Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаСвойствОсновногоФайла());
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", СообщениеОбъект.ЭлектронныйДокумент);
		Запрос.УстановитьПараметр("ОсновнойФайл", СообщениеОбъект.ОсновнойФайл);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		ПараметрыДокумента = РезультатыЗапроса[0].Выбрать();
		ПараметрыДокумента.Следующий();
		СостоянияСообщений = РезультатыЗапроса[1].Выгрузить();
		
		ЭтоПовторноеАннулирование = СостоянияСообщений.Найти(Перечисления.ТипыЭлементовРегламентаЭДО.ПОА,
			"ТипЭлементаРегламента") <> Неопределено;
		Если ЭтоПовторноеАннулирование Тогда
			ОтменитьТранзакцию();
			Результат.Отказ = Истина;
			ДобавитьОшибкуПовторногоАннулирования(КонтекстДиагностики, Действие, СообщениеОбъект.ЭлектронныйДокумент);
			Возврат Результат;
		КонецЕсли;
		
		УстановитьСостояниеХранение(СостоянияСообщений, СообщениеОбъект.ДатаИзмененияСтатуса);
		
		Если СообщениеОбъект.Направление = Перечисления.НаправленияЭДО.Внутренний Тогда
			
			ДокументОбъект = ОбщегоНазначенияБЭД.ОбъектПоСсылкеДляИзменения(ПараметрыДокумента.Ссылка);
			ДокументОбъект.Остановлен = Истина;
			ДокументОбъект.ПричинаОстановки = Перечисления.ПричиныОстановкиЭДО.Аннулирован;
			ДокументОбъект.Записать();
			ПараметрыДокумента = ДокументОбъект;
			
		Иначе
			
			СвойстваОсновногоФайла = РезультатыЗапроса[2].Выбрать();
			СвойстваОсновногоФайла.Следующий();
			
			СообщениеОбъект = СоздатьСлужебноеСообщение(ПараметрыДокумента, СвойстваОсновногоФайла,
				Перечисления.ТипыДокументовЭДО.ПредложениеОбАннулировании, Перечисления.ТипыЭлементовРегламентаЭДО.ПОА, Комментарий);
			
			Если СообщениеОбъект = Неопределено Тогда
				ТекстОшибки = НСтр("ru = 'Не удалось сформировать предложение об аннулировании'");
				ДобавитьОшибкуВыполненияДействияПоСообщению(Сообщение, Действие, ТекстОшибки, КонтекстДиагностики);
				ОтменитьТранзакцию();
				Результат.Отказ = Истина;
				Возврат Результат;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СостоянияСообщений.Добавить(), СообщениеОбъект);
			
		КонецЕсли;
		
		ДополненияСостоянийЭДО = Неопределено;
		
		Если Не ПараметрыДокумента.ОбменБезПодписи Тогда
			
			ПараметрыМаршрута = СформироватьМаршрутПодписания(СообщениеОбъект);
			
			Результат.ТаблицаПодписания = ПараметрыМаршрута.ТаблицаПодписания;
			
			ДополненияСостоянийЭДО = ДополненияСостоянийЭДОПриПодписании(СообщениеОбъект, ПараметрыДокумента.ВидПодписи,
				ПараметрыМаршрута.ВесМаршрута);
			
		КонецЕсли;
		
		СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(ПараметрыДокумента, СостоянияСообщений,
			СообщениеОбъект.ДатаИзмененияСтатуса, КонтекстДиагностики, ДополненияСостоянийЭДО, Комментарий);
		
		ЗаписатьДействиеВЖурнал(Действие, ПараметрыДокумента, СостояниеДокумента, СообщениеОбъект.ДатаИзмененияСтатуса,
			СообщениеОбъект, Комментарий);
		
		Если ПараметрыДокумента.НаОзнакомлении Тогда
			ВернутьСОзнакомления(СообщениеОбъект.ЭлектронныйДокумент);
		КонецЕсли;
		
		Результат.СообщениеОбъект = СообщениеОбъект;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоСообщению(Сообщение, Действие, ТекстОшибки, КонтекстДиагностики);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьОшибкуПовторногоАннулирования(КонтекстДиагностики, Действие, ЭлектронныйДокумент)
	
	ПредставлениеДействия = НРег(Действие);
	ВидОперации = ВидОперацииПриДобавленииОшибки(ПредставлениеДействия);
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Аннулирование документа %1 уже производилось.
		|Повторное аннулирование недоступно.'"), ЭлектронныйДокумент);
	
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации, ВидОшибкиПовторноеАннулированиеНедоступно(),
		ТекстСообщения, ТекстСообщения);
	ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	
КонецПроцедуры

Функция ВидОшибкиПовторноеАннулированиеНедоступно()
	ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.НовоеОписаниеВидаОшибки();
	ВидОшибки.Идентификатор = "ПовторноеАннулированиеНедоступно";
	ВидОшибки.ЗаголовокПроблемы = НСтр("ru = 'Аннулирование недоступно");
	ВидОшибки.ОписаниеПроблемы = НСтр("ru = 'Повторное аннулирование недоступно.'");
	Возврат ВидОшибки;
КонецФункции

#КонецОбласти

#Область ПринятьАннулирование

Процедура ВыполнитьДействиеПринятьАннулирование(ПараметрыВыполнения, РезультатДействий)
	
	Если ЗначениеЗаполнено(ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов) Тогда
		
		Для Каждого ПакетДокументов Из ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов Цикл
			ПринятьАннулированиеДокументовПакета(ПакетДокументов, РезультатДействий);
		КонецЦикла;
		
	Иначе
		
		Отбор = НовыйОтборСообщенийДляОбработкиДействия();
		Отбор.Состояние.Добавить(Перечисления.СостоянияСообщенийЭДО.Подтверждение);
		Отбор.ТипЭлементаРегламента.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ПОА);
		ВыборкаСообщений = ВыборкаСообщенийДляОбработкиДействия(ПараметрыВыполнения.ОбъектыДействий, Отбор);
		Пока ВыборкаСообщений.Следующий() Цикл
			ПринятьАннулированиеДокумента(ВыборкаСообщений.Ссылка, РезультатДействий);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПринятьАннулированиеДокумента(Сообщение, РезультатДействий)
	
	Результат = ПринятьАннулирование(Сообщение, РезультатДействий.КонтекстДиагностики);
	
	Если Результат.Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Перечисления.ДействияПоЭДО.ПринятьАннулирование,
		Результат.СообщениеОбъект.ЭлектронныйДокумент);
	
	ЭлектронныеДокументыЭДОСобытия.ПослеАннулированияЭлектронногоДокумента(
		Результат.СообщениеОбъект.ЭлектронныйДокумент, РезультатДействий.КонтекстДиагностики);
	
КонецПроцедуры

Процедура ПринятьАннулированиеДокументовПакета(ПакетДокументов, РезультатДействий)
	
	Действие = Перечисления.ДействияПоЭДО.ПринятьАннулирование;
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	НаборРезультатов = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		СообщенияПакета = СообщенияПакетаДляИзменения(ПакетДокументов, Действие, КонтекстДиагностики,
			Перечисления.СостоянияСообщенийЭДО.Подтверждение,
			Перечисления.ТипыЭлементовРегламентаЭДО.ПОА);
		Если Не ЗначениеЗаполнено(СообщенияПакета) Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Для Каждого Сообщение Из СообщенияПакета Цикл
			Результат = ПринятьАннулирование(Сообщение, КонтекстДиагностики);
			Если Результат.Отказ Тогда
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			НаборРезультатов.Добавить(Результат);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоПакету(ПакетДокументов, Действие, ТекстОшибки, КонтекстДиагностики);
		Возврат;
	КонецПопытки;
	
	Для Каждого РезультатОбработки Из НаборРезультатов Цикл
		ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Действие,
			РезультатОбработки.СообщениеОбъект.ЭлектронныйДокумент);
		ЭлектронныеДокументыЭДОСобытия.ПослеАннулированияЭлектронногоДокумента(
			РезультатОбработки.СообщениеОбъект.ЭлектронныйДокумент, КонтекстДиагностики);
	КонецЦикла;
	
КонецПроцедуры

Функция ПринятьАннулирование(Сообщение, КонтекстДиагностики)
	
	Результат = Новый Структура;
	Результат.Вставить("Отказ", Ложь);
	Результат.Вставить("СообщениеОбъект", Неопределено);
	Результат.Вставить("ТаблицаПодписания", Неопределено);
	
	Действие = Перечисления.ДействияПоЭДО.ПринятьАннулирование;
	
	НачатьТранзакцию();
	Попытка
		
		СообщениеОбъект = ОбщегоНазначенияБЭД.ОбъектПоСсылкеДляИзменения(Сообщение);
		Если СообщениеОбъект.Состояние <> Перечисления.СостоянияСообщенийЭДО.Подтверждение
			ИЛИ СообщениеОбъект.ТипЭлементаРегламента <> Перечисления.ТипыЭлементовРегламентаЭДО.ПОА Тогда
			ОтменитьТранзакцию();
			Результат.Отказ = Истина;
			Возврат Результат;
		КонецЕсли;
		
		ЭтоВходящийЭДО = ЭтоВходящийЭДО(СообщениеОбъект.ЭлектронныйДокумент);
		
		ЗаблокироватьДанныеСообщенияДляИзменения(СообщениеОбъект, ЭтоВходящийЭДО);
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаПараметровОбновленияСостоянияДокумента(ЭтоВходящийЭДО);
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", СообщениеОбъект.ЭлектронныйДокумент);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
		ПараметрыДокумента = РезультатыЗапроса[0].Выбрать();
		ПараметрыДокумента.Следующий();
		СостоянияСообщений = РезультатыЗапроса[1].Выгрузить();
		
		СообщениеОбъект.Статус = Перечисления.СтатусыСообщенийЭДО.Утвержден;
		СообщениеОбъект.ДатаИзмененияСтатуса = ТекущаяДатаСеанса();
		СообщениеОбъект.Состояние = РегламентыЭДО.СостояниеСообщения(СообщениеОбъект, ПараметрыДокумента);
		СообщениеОбъект.Записать();
		
		НайденнаяСтрока = СостоянияСообщений.Найти(СообщениеОбъект.Ссылка, "Ссылка");
		НайденнаяСтрока.Состояние = СообщениеОбъект.Состояние;
		
		ДополненияСостоянийЭДО = Неопределено;
		
		Если Не ПараметрыДокумента.ОбменБезПодписи Тогда
			
			ПараметрыМаршрута = СформироватьМаршрутПодписания(СообщениеОбъект);
			
			Результат.ТаблицаПодписания = ПараметрыМаршрута.ТаблицаПодписания;
			
			ДополненияСостоянийЭДО = ДополненияСостоянийЭДОПриПодписании(СообщениеОбъект, ПараметрыДокумента.ВидПодписи,
				ПараметрыМаршрута.ВесМаршрута);
			
		КонецЕсли;
		
		СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(ПараметрыДокумента, СостоянияСообщений,
			СообщениеОбъект.ДатаИзмененияСтатуса, КонтекстДиагностики, ДополненияСостоянийЭДО);
		
		ЗаписатьДействиеВЖурнал(Действие, ПараметрыДокумента, СостояниеДокумента, СообщениеОбъект.ДатаИзмененияСтатуса,
			СообщениеОбъект);
		
		Результат.СообщениеОбъект = СообщениеОбъект;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат.Отказ = Истина;
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоСообщению(Сообщение, Действие, ТекстОшибки, КонтекстДиагностики);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОтклонитьАннулирование

Процедура ВыполнитьДействиеОтклонитьАннулирование(ПараметрыВыполнения, РезультатДействий)
	
	Комментарий = КомментарийДействия(ПараметрыВыполнения, Перечисления.ДействияПоЭДО.ОтклонитьАннулирование);
		
	Если ЗначениеЗаполнено(ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов) Тогда
		
		Для Каждого ПакетДокументов Из ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов Цикл
			ОтклонитьАннулированиеДокументовПакета(ПакетДокументов, РезультатДействий, Комментарий);
		КонецЦикла;
		
	Иначе
		
		Отбор = НовыйОтборСообщенийДляОбработкиДействия();
		Отбор.Состояние.Добавить(Перечисления.СостоянияСообщенийЭДО.Подтверждение);
		Отбор.ТипЭлементаРегламента.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ПОА);
		ВыборкаСообщений = ВыборкаСообщенийДляОбработкиДействия(ПараметрыВыполнения.ОбъектыДействий, Отбор);
		Пока ВыборкаСообщений.Следующий() Цикл
			ОтклонитьАннулированиеДокумента(ВыборкаСообщений.Ссылка, РезультатДействий, Комментарий);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтклонитьАннулированиеДокумента(Сообщение, РезультатДействий, Комментарий = "")
	
	Результат = ОтклонитьАннулирование(Сообщение, РезультатДействий.КонтекстДиагностики, Комментарий);
	
	Если Результат.Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Перечисления.ДействияПоЭДО.ОтклонитьАннулирование,
		Результат.СообщениеОбъект.ЭлектронныйДокумент);
	
	ОповеститьОДокументеКПодписанию(Результат.СообщениеОбъект, Результат.ТаблицаПодписания);
	
КонецПроцедуры

Процедура ОтклонитьАннулированиеДокументовПакета(ПакетДокументов, РезультатДействий, Комментарий = "")
	
	Действие = Перечисления.ДействияПоЭДО.ОтклонитьАннулирование;
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	НаборРезультатов = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		СообщенияПакета = СообщенияПакетаДляИзменения(ПакетДокументов, Действие, КонтекстДиагностики,
			Перечисления.СостоянияСообщенийЭДО.Подтверждение,
			Перечисления.ТипыЭлементовРегламентаЭДО.ПОА);
		Если Не ЗначениеЗаполнено(СообщенияПакета) Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Для Каждого Сообщение Из СообщенияПакета Цикл
			Результат = ОтклонитьАннулирование(Сообщение, КонтекстДиагностики, Комментарий);
			Если Результат.Отказ Тогда
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			НаборРезультатов.Добавить(Результат);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоПакету(ПакетДокументов, Действие, ТекстОшибки, КонтекстДиагностики);
		Возврат;
	КонецПопытки;
	
	Для Каждого РезультатОбработки Из НаборРезультатов Цикл
		ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Действие,
			РезультатОбработки.СообщениеОбъект.ЭлектронныйДокумент);
		ОповеститьОДокументеКПодписанию(РезультатОбработки.СообщениеОбъект, РезультатОбработки.ТаблицаПодписания);
	КонецЦикла;
	
КонецПроцедуры

Функция ОтклонитьАннулирование(Сообщение, КонтекстДиагностики, Комментарий = "")
	
	Результат = Новый Структура;
	Результат.Вставить("Отказ", Ложь);
	Результат.Вставить("СообщениеОбъект", Неопределено);
	Результат.Вставить("ТаблицаПодписания", Неопределено);
	
	Действие = Перечисления.ДействияПоЭДО.ОтклонитьАннулирование;
	
	НачатьТранзакцию();
	Попытка
		СообщениеОбъект = ОбщегоНазначенияБЭД.ОбъектПоСсылкеДляИзменения(Сообщение);
		Если СообщениеОбъект.Состояние <> Перечисления.СостоянияСообщенийЭДО.Подтверждение
			ИЛИ СообщениеОбъект.ТипЭлементаРегламента <> Перечисления.ТипыЭлементовРегламентаЭДО.ПОА Тогда
			ОтменитьТранзакцию();
			Результат.Отказ = Истина;
			Возврат Результат;
		КонецЕсли;
		
		ЭтоВходящийЭДО = ЭтоВходящийЭДО(СообщениеОбъект.ЭлектронныйДокумент);
		
		ЗаблокироватьДанныеСообщенияДляИзменения(СообщениеОбъект, ЭтоВходящийЭДО);
		
		ТекстыЗапросов = Новый Массив;
		ТекстыЗапросов.Добавить(ТекстЗапросаПараметровОбновленияСостоянияДокумента(ЭтоВходящийЭДО));
		ТекстыЗапросов.Добавить(ТекстЗапросаСвойствОсновногоФайла());
	
		Запрос = Новый Запрос;
		Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", СообщениеОбъект.ЭлектронныйДокумент);
		Запрос.УстановитьПараметр("ОсновнойФайл", СообщениеОбъект.ОсновнойФайл);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
		ПараметрыДокумента = РезультатыЗапроса[0].Выбрать();
		ПараметрыДокумента.Следующий();
		СостоянияСообщений = РезультатыЗапроса[1].Выгрузить();
		СвойстваОсновногоФайла = РезультатыЗапроса[2].Выбрать();
		СвойстваОсновногоФайла.Следующий();
		
		ПересчитатьСостоянияСообщений(СостоянияСообщений, ПараметрыДокумента);
		
		СообщениеОбъект = СоздатьСлужебноеСообщение(ПараметрыДокумента, СвойстваОсновногоФайла,
			Перечисления.ТипыДокументовЭДО.УведомлениеОбУточнении, Перечисления.ТипыЭлементовРегламентаЭДО.ПОА_УОУ, Комментарий);
		
		ЗаполнитьЗначенияСвойств(СостоянияСообщений.Добавить(), СообщениеОбъект);
		
		ДополненияСостоянийЭДО = Неопределено;
		Если Не ПараметрыДокумента.ОбменБезПодписи Тогда
			ПараметрыМаршрута = СформироватьМаршрутПодписания(СообщениеОбъект);
			Результат.ТаблицаПодписания = ПараметрыМаршрута.ТаблицаПодписания;
			ДополненияСостоянийЭДО = ДополненияСостоянийЭДОПриПодписании(СообщениеОбъект, ПараметрыДокумента.ВидПодписи,
				ПараметрыМаршрута.ВесМаршрута);
		КонецЕсли;
		
		СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(ПараметрыДокумента, СостоянияСообщений,
			СообщениеОбъект.ДатаИзмененияСтатуса, КонтекстДиагностики, ДополненияСостоянийЭДО, Комментарий);
		
		ЗаписатьДействиеВЖурнал(Действие, ПараметрыДокумента, СостояниеДокумента, СообщениеОбъект.ДатаИзмененияСтатуса,
			СообщениеОбъект, Комментарий);
		
		Результат.СообщениеОбъект = СообщениеОбъект;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоСообщению(Сообщение, Действие, ТекстОшибки, КонтекстДиагностики);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Перенаправить

Процедура ВыполнитьДействиеПеренаправить(ПараметрыВыполнения, РезультатДействий)
	
	ДополнительныеПараметры = ПараметрыВыполнения.ДополнительныеПараметрыДействий[Перечисления.ДействияПоЭДО.Перенаправить];
	Если ДополнительныеПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = ДополнительныеПараметры.Ответственный;
	Комментарий = ДополнительныеПараметры.Комментарий;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов) Тогда
		
		Для Каждого ПакетДокументов Из ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов Цикл
			ПеренаправитьДокументыПакета(ПакетДокументов, Ответственный, РезультатДействий, Комментарий);
		КонецЦикла;
		
	Иначе
		
		КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
		Выборка = ВыборкаДокументовДляОбработкиДействия(ПараметрыВыполнения.ОбъектыДействий);
		Пока Выборка.Следующий() Цикл
			Если ПеренаправитьДокумент(Выборка.ЭлектронныйДокумент, Ответственный, КонтекстДиагностики, Комментарий) Тогда
				ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Перечисления.ДействияПоЭДО.Перенаправить,
					Выборка.ЭлектронныйДокумент);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПеренаправитьДокумент(ЭлектронныйДокумент, Ответственный, КонтекстДиагностики, Комментарий = "")
	
	Результат = Истина;
	
	Действие = Перечисления.ДействияПоЭДО.Перенаправить;
	
	НачатьТранзакцию();
	Попытка
		
		ЭтоВходящийЭДО = ЭтоВходящийЭДО(ЭлектронныйДокумент);
		
		ЗаблокироватьДанныеДокументаДляИзменения(ЭлектронныйДокумент, ЭтоВходящийЭДО);
		
		ДокументОбъект = ЭлектронныйДокумент.ПолучитьОбъект();
		ДокументОбъект.Ответственный = Ответственный;
		ДокументОбъект.Записать();
		
		ТекстыЗапроса = Новый Массив;
		ТекстыЗапроса.Добавить(ТекстЗапросаСостоянияДокумента());
		ТекстыЗапроса.Добавить(ТекстЗапросаСвойствСообщенияИнформацииОтправителя());
		
		Запрос = Новый Запрос;
		Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", ДокументОбъект.Ссылка);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		Если РезультатыЗапроса[0].Пустой()
			ИЛИ РезультатыЗапроса[1].Пустой() Тогда
			ОтменитьТранзакцию();
			Результат = Ложь;
		КонецЕсли;
		
		ВыборкаСостояния = РезультатыЗапроса[0].Выбрать();
		ВыборкаСостояния.Следующий();
		
		Если Не ДействиеДоступно(Действие, ВыборкаСостояния.Состояние, ДокументОбъект, КонтекстДиагностики) Тогда
			ОтменитьТранзакцию();
			Результат = Ложь;
		КонецЕсли;
		
		СвойстваСообщения = РезультатыЗапроса[1].Выбрать();
		СвойстваСообщения.Выбрать();
		
		СостояниеДокумента = СостояниеДокумента(ЭлектронныйДокумент);
		ЗаписатьДействиеВЖурнал(Действие, ДокументОбъект, СостояниеДокумента, ТекущаяДатаСеанса(),
			СвойстваСообщения, Комментарий);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат = Ложь;
		
		ПредставлениеДействия = НРег(Действие);
		ВидОперации = ВидОперацииПриДобавленииОшибки(ПредставлениеДействия);
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось установить ответственного по документу: %1.'"),
			ПредставлениеДокумента(ЭлектронныйДокумент));
		ПодробныйТекстОшибки = ТекстОшибки + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации,
			ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
			ПодробныйТекстОшибки, ТекстОшибки);
		ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
		ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Процедура ПеренаправитьДокументыПакета(ПакетДокументов, Ответственный, РезультатДействий, Комментарий = "")
	
	Действие = Перечисления.ДействияПоЭДО.Перенаправить;
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	ОбработанныеДокументы = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		ДокументыПакета = ДокументыПакетаДляИзменения(ПакетДокументов, Действие, КонтекстДиагностики);
		Если Не ЗначениеЗаполнено(ДокументыПакета) Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Для Каждого ЭлектронныйДокумент Из ДокументыПакета Цикл
			Если Не ПеренаправитьДокумент(ЭлектронныйДокумент, КонтекстДиагностики, Комментарий) Тогда
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			ОбработанныеДокументы.Добавить(ЭлектронныйДокумент);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоПакету(ПакетДокументов, Действие, ТекстОшибки, КонтекстДиагностики);
		Возврат;
	КонецПопытки;
	
	Для Каждого ЭлектронныйДокумент Из ОбработанныеДокументы Цикл
		ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Действие, ЭлектронныйДокумент);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Утвердить

Процедура ВыполнитьДействиеУтвердить(ПараметрыВыполнения, РезультатДействий)
	
	Если ЗначениеЗаполнено(ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов) Тогда
		
		Для Каждого ПакетДокументов Из ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов Цикл
			УтвердитьДокументыПакета(ПакетДокументов, РезультатДействий);
		КонецЦикла;
		
	Иначе
		
		Отбор = НовыйОтборСообщенийДляОбработкиДействия();
		Отбор.Состояние.Добавить(Перечисления.СостоянияСообщенийЭДО.Утверждение);
		Отбор.ТипЭлементаРегламента.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);
		ВыборкаСообщений = ВыборкаСообщенийДляОбработкиДействия(ПараметрыВыполнения.ОбъектыДействий, Отбор);
		Пока ВыборкаСообщений.Следующий() Цикл
			УтвердитьДокумент(ВыборкаСообщений.Ссылка, РезультатДействий)
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УтвердитьДокумент(Сообщение, РезультатДействий)
	
	РезультатУтверждения = Утвердить(Сообщение, РезультатДействий.КонтекстДиагностики);
	
	ПослеУтверждения(РезультатУтверждения, РезультатДействий);
	
КонецПроцедуры

Процедура УтвердитьДокументыПакета(ПакетДокументов, РезультатДействий)
	
	Действие = Перечисления.ДействияПоЭДО.Утвердить;
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	НаборРезультатов = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		СообщенияПакета = СообщенияПакетаДляИзменения(ПакетДокументов, Действие, КонтекстДиагностики,
			Перечисления.СостоянияСообщенийЭДО.Утверждение,
			Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);
		Если Не ЗначениеЗаполнено(СообщенияПакета) Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
			
		Для Каждого Сообщение Из СообщенияПакета Цикл
			Результат = Утвердить(Сообщение, КонтекстДиагностики);
			Если Результат.Отказ Тогда
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			НаборРезультатов.Добавить(Результат);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоПакету(ПакетДокументов, Действие, ТекстОшибки, КонтекстДиагностики);
		Возврат;
	КонецПопытки;
	
	Для Каждого РезультатУтверждения Из НаборРезультатов Цикл
		
		ПослеУтверждения(РезультатУтверждения, РезультатДействий);
		
	КонецЦикла;
	
КонецПроцедуры

Функция Утвердить(Сообщение, КонтекстДиагностики, НаборОбъектовУчета = Неопределено)
	
	Результат = Новый Структура;
	Результат.Вставить("Отказ", Ложь);
	Результат.Вставить("СостояниеДокумента", Перечисления.СостоянияДокументовЭДО.ПустаяСсылка());
	Результат.Вставить("СообщениеОбъект", Неопределено);
	Результат.Вставить("ТаблицаПодписания", Неопределено);
	
	Действие = Перечисления.ДействияПоЭДО.Утвердить;
	
	НачатьТранзакцию();
	Попытка
		
		СообщениеОбъект = ОбщегоНазначенияБЭД.ОбъектПоСсылкеДляИзменения(Сообщение);
		Если СообщениеОбъект.Состояние <> Перечисления.СостоянияСообщенийЭДО.Утверждение
			ИЛИ ЕстьНевалидныеПодписи(СообщениеОбъект.ОсновнойФайл, КонтекстДиагностики) Тогда
			ЗафиксироватьТранзакцию();
			Результат.Отказ = Истина;
			Возврат Результат;
		КонецЕсли;
		
		ЭтоВходящийЭДО = ЭтоВходящийЭДО(СообщениеОбъект.ЭлектронныйДокумент);
		
		ЗаблокироватьДанныеСообщенияДляИзменения(СообщениеОбъект, ЭтоВходящийЭДО);
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаПараметровОбновленияСостоянияДокумента(ЭтоВходящийЭДО);
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", СообщениеОбъект.ЭлектронныйДокумент);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		ПараметрыДокумента = РезультатыЗапроса[0].Выбрать();
		ПараметрыДокумента.Следующий();
		СостоянияСообщений = РезультатыЗапроса[1].Выгрузить();
		
		СообщениеОбъект.Статус = Перечисления.СтатусыСообщенийЭДО.Утвержден;
		СообщениеОбъект.ДатаИзмененияСтатуса = ТекущаяДатаСеанса();
		СообщениеОбъект.Состояние = РегламентыЭДО.СостояниеСообщения(СообщениеОбъект, ПараметрыДокумента);
		СообщениеОбъект.Записать();
		
		НайденнаяСтрока = СостоянияСообщений.Найти(СообщениеОбъект.Ссылка, "Ссылка");
		НайденнаяСтрока.Состояние = СообщениеОбъект.Состояние;
		
		ДополненияСостоянийЭДО = НовыеДополненияСостоянийЭДО();
		
		ДополненияСостоянийЭДО = Неопределено;
		Если ПараметрыДокумента.ТребуетсяПодтверждение
			И Не РегламентыЭДО.ЕстьИнформацияПолучателя(ПараметрыДокумента.ТипРегламента)
			И Не ПараметрыДокумента.ОбменБезПодписи Тогда
			ПараметрыМаршрута = СформироватьМаршрутПодписания(СообщениеОбъект);
			ДополненияСостоянийЭДО = ДополненияСостоянийЭДОПриПодписании(СообщениеОбъект,
				ПараметрыДокумента.ВидПодписи, ПараметрыМаршрута.ВесМаршрута);
			Результат.ТаблицаПодписания = ПараметрыМаршрута.ТаблицаПодписания;
		КонецЕсли;
		
		СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(ПараметрыДокумента, СостоянияСообщений,
			СообщениеОбъект.ДатаИзмененияСтатуса, КонтекстДиагностики, ДополненияСостоянийЭДО);
		
		ЗаписатьДействиеВЖурнал(Действие, ПараметрыДокумента, СостояниеДокумента, СообщениеОбъект.ДатаИзмененияСтатуса,
			СообщениеОбъект);
		
		Результат.СостояниеДокумента = СостояниеДокумента;
		Результат.СообщениеОбъект = СообщениеОбъект;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат.Отказ = Истина;
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоСообщению(Сообщение, Действие, ТекстОшибки, КонтекстДиагностики);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Процедура ПослеУтверждения(РезультатУтверждения, РезультатДействий)
	
	Если РезультатУтверждения.Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СообщениеОбъект = РезультатУтверждения.СообщениеОбъект;
	
	ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Перечисления.ДействияПоЭДО.Утвердить,
		СообщениеОбъект.ЭлектронныйДокумент);
	
	Если ЗначениеЗаполнено(РезультатУтверждения.ТаблицаПодписания) Тогда
		ОповеститьОДокументеКПодписанию(СообщениеОбъект, РезультатУтверждения.ТаблицаПодписания);
	КонецЕсли;
	
	Если СообщениеОбъект.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя Тогда
		ЭлектронныеДокументыЭДОСобытия.ПослеУтвержденияЭлектронногоДокумента(СообщениеОбъект.ЭлектронныйДокумент,
			РезультатДействий.КонтекстДиагностики);
	КонецЕсли;
	
	Если РезультатУтверждения.СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОбменЗавершен
		ИЛИ РезультатУтверждения.СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОбменЗавершенСИсправлением Тогда
		ЭлектронныеДокументыЭДОСобытия.ПослеЗавершенияОбменаЭлектроннымДокументом(СообщениеОбъект.ЭлектронныйДокумент,
			РезультатДействий.КонтекстДиагностики);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СнятьСУтверждения

Функция СнятьСУтверждения(Сообщение, ИспользоватьУтверждение, КонтекстДиагностики)
	
	Результат = Истина;
	
	Действие = Перечисления.ДействияПоЭДО.СнятьСУтверждения;
	
	НачатьТранзакцию();
	Попытка
		
		СообщениеОбъект = ОбщегоНазначенияБЭД.ОбъектПоСсылкеДляИзменения(Сообщение);
		Если СообщениеОбъект.Состояние <> Перечисления.СостоянияСообщенийЭДО.Утверждение Тогда
			ЗафиксироватьТранзакцию();
			Возврат Результат;
		КонецЕсли;
		
		ЭтоВходящийЭДО = ЭтоВходящийЭДО(СообщениеОбъект.ЭлектронныйДокумент);
		
		ЗаблокироватьДанныеСообщенияДляИзменения(СообщениеОбъект, ЭтоВходящийЭДО);
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаПараметровОбновленияСостоянияДокумента(ЭтоВходящийЭДО);
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", СообщениеОбъект.ЭлектронныйДокумент);
		Запрос.УстановитьПараметр("Сообщение", Сообщение);
		Запрос.УстановитьПараметр("СтатусСообщения", СообщениеОбъект.Статус);
		Запрос.УстановитьПараметр("ДатаИзменения", СообщениеОбъект.ДатаИзмененияСтатуса);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		ПараметрыДокумента = РезультатыЗапроса[0].Выбрать();
		ПараметрыДокумента.Следующий();
		СостоянияСообщений = РезультатыЗапроса[1].Выгрузить();
		
		СообщениеОбъект.Состояние = РегламентыЭДО.СостояниеСообщения(СообщениеОбъект, ПараметрыДокумента,
			ИспользоватьУтверждение);
		СообщениеОбъект.Записать();
		
		НайденнаяСтрока = СостоянияСообщений.Найти(СообщениеОбъект.Ссылка, "Ссылка");
		НайденнаяСтрока.Состояние = СообщениеОбъект.Состояние;
		
		ДополненияСостоянийЭДО = Неопределено;
		Если ПараметрыДокумента.ТребуетсяПодтверждение
			И Не РегламентыЭДО.ЕстьИнформацияПолучателя(ПараметрыДокумента.ТипРегламента)
			И Не ПараметрыДокумента.ОбменБезПодписи Тогда
			ПараметрыМаршрута = СформироватьМаршрутПодписания(СообщениеОбъект);
			ДополненияСостоянийЭДО = ДополненияСостоянийЭДОПриПодписании(СообщениеОбъект,
				ПараметрыДокумента.ВидПодписи, ПараметрыМаршрута.ВесМаршрута);
		КонецЕсли;
		
		СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(ПараметрыДокумента, СостоянияСообщений,
			СообщениеОбъект.ДатаИзмененияСтатуса, КонтекстДиагностики, ДополненияСостоянийЭДО);
		
		ЗаписатьДействиеВЖурнал(Действие, ПараметрыДокумента, СостояниеДокумента, СообщениеОбъект.ДатаИзмененияСтатуса,
			СообщениеОбъект);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат = Ложь;
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоСообщению(Сообщение, Действие, ТекстОшибки, КонтекстДиагностики);
	КонецПопытки;
	
	Если Не Результат Тогда
		ПослеСнятияСУтверждения(СообщениеОбъект, ПараметрыМаршрута.ТаблицаПодписания, СостояниеДокумента);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПослеСнятияСУтверждения(СообщениеОбъект, ТаблицаПодписания, СостояниеДокумента)
	
	Если (СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОбменЗавершен
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОбменЗавершенСИсправлением
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.Аннулирован) Тогда
		
		ОтправитьНаОзнакомление(СообщениеОбъект.ЭлектронныйДокумент);
	КонецЕсли;
	
	ОповеститьОДокументеКПодписанию(СообщениеОбъект, ТаблицаПодписания);
	
КонецПроцедуры

#КонецОбласти

#Область СформироватьОтвет

Процедура ВыполнитьДействиеСформироватьОтвет(ПараметрыВыполнения, РезультатДействий)
	
	Если ЗначениеЗаполнено(ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов) Тогда
		
		Для Каждого ПакетДокументов Из ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов Цикл
			СформироватьОтветПоДокументамПакета(ПакетДокументов, РезультатДействий);
		КонецЦикла;
		
	Иначе
		
		Выборка = ВыборкаДокументовДляФормированияОтвета(ПараметрыВыполнения.ОбъектыДействий);
		Пока Выборка.Следующий() Цикл
			СформироватьОтветПоДокументу(Выборка.ЭлектронныйДокумент, РезультатДействий)
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВыборкаДокументовДляФормированияОтвета(ОбъектыДействий)
	
	Запрос = Новый Запрос;
	
	ТекстыЗапросов = Новый Массив;
	
	Если ЗначениеЗаполнено(ОбъектыДействий.ОбъектыУчета) Тогда
		
		ОтборДокументов = ИнтеграцияЭДО.НовыйОтборАктуальныхЭлектронныхДокументов();
		ОтборДокументов.ОбъектыУчета = "&ОтборОбъектыУчета";
		ТекстыЗапросов.Добавить(ИнтеграцияЭДО.ЗапросАктуальныхЭлектронныхДокументов(
			"ЭлектронныеДокументыОбъектовУчета", ОтборДокументов).Текст);
		
		Запрос.УстановитьПараметр("ОтборОбъектыУчета", ОбъектыДействий.ОбъектыУчета);
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ЭлектронныеДокументыОбъектовУчета.ЭлектронныйДокумент КАК ЭлектронныйДокумент
			|ИЗ
			|	ЭлектронныеДокументыОбъектовУчета КАК ЭлектронныеДокументыОбъектовУчета
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
			|		ПО ЭлектронныеДокументыОбъектовУчета.ЭлектронныйДокумент = ЭлектронныйДокументВходящийЭДО.Ссылка
			|		И ЭлектронныйДокументВходящийЭДО.ТребуетсяПодтверждение
			|		И ЭлектронныйДокументВходящийЭДО.ТипРегламента <> ЗНАЧЕНИЕ(Перечисление.ТипыРегламентовЭДО.Неформализованный)
			|ГДЕ
			|	ЭлектронныйДокументВходящийЭДО.ТребуетсяПодтверждение
			|	И ЭлектронныйДокументВходящийЭДО.ТипРегламента <> ЗНАЧЕНИЕ(Перечисление.ТипыРегламентовЭДО.Неформализованный)";
		
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектыДействий.ЭлектронныеДокументы) Тогда
		
		Запрос.УстановитьПараметр("ОтборЭлектронныеДокументы", ОбъектыДействий.ЭлектронныеДокументы);
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ЭлектронныйДокументВходящийЭДО.Ссылка КАК ЭлектронныйДокумент
			|ИЗ
			|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
			|ГДЕ
			|	ЭлектронныйДокументВходящийЭДО.Ссылка В (&ОтборЭлектронныеДокументы)
			|	И ЭлектронныйДокументВходящийЭДО.ТребуетсяПодтверждение
			|	И ЭлектронныйДокументВходящийЭДО.ТипРегламента <> ЗНАЧЕНИЕ(Перечисление.ТипыРегламентовЭДО.Неформализованный)";
		
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, "
		|
		|ОБЪЕДИНИТЬ
		|");
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура СформироватьОтветПоДокументу(Сообщение, РезультатДействий)
	
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	
	РезультатФормирования = СформироватьОтвет(Сообщение, КонтекстДиагностики);
	
	Если РезультатФормирования.Отказ Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РезультатДействий.ОшибкиФормирования,
			РезультатФормирования.ОшибкиФормирования);
		Возврат;
	КонецЕсли;
	
	Если РезультатФормирования.СообщениеОбъект <> Неопределено Тогда
		ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Перечисления.ДействияПоЭДО.СформироватьОтвет,
			РезультатФормирования.СообщениеОбъект.ЭлектронныйДокумент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатФормирования.ТаблицаПодписания) Тогда
		ОповеститьОДокументеКПодписанию(РезультатФормирования.СообщениеОбъект, РезультатФормирования.ТаблицаПодписания);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьОтветПоДокументамПакета(ПакетДокументов, РезультатДействий)
	
	Действие = Перечисления.ДействияПоЭДО.СформироватьОтвет;
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	НаборРезультатов = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		ЗаблокироватьПакетДокументовДляИзменения(ПакетДокументов);
		
		ДокументыПакета = ДокументыПакета(ПакетДокументов);
		Если Не ЗначениеЗаполнено(ДокументыПакета) Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Для Каждого ЭлектронныйДокумент Из ДокументыПакета Цикл
			Результат = СформироватьОтвет(ЭлектронныйДокумент, КонтекстДиагностики);
			Если Результат.Отказ Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РезультатДействий.ОшибкиФормирования, 
					Результат.ОшибкиФормирования);
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			НаборРезультатов.Добавить(Результат);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоПакету(ПакетДокументов, Действие, ТекстОшибки, КонтекстДиагностики);
		Возврат;
	КонецПопытки;
	
	Для Каждого РезультатОбработки Из НаборРезультатов Цикл
		
		Если РезультатОбработки.СообщениеОбъект <> Неопределено Тогда
			ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Действие,
				РезультатОбработки.СообщениеОбъект.ЭлектронныйДокумент);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатОбработки.ТаблицаПодписания) Тогда
			ОповеститьОДокументеКПодписанию(РезультатОбработки.СообщениеОбъект, РезультатОбработки.ТаблицаПодписания);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьОтвет(ЭлектронныйДокумент, КонтекстДиагностики)
	
	Результат = Новый Структура;
	Результат.Вставить("Отказ", Ложь);
	Результат.Вставить("СостояниеДокумента", Перечисления.СостоянияДокументовЭДО.ПустаяСсылка());
	Результат.Вставить("СообщениеОбъект", Неопределено);
	Результат.Вставить("ТаблицаПодписания", Неопределено);
	Результат.Вставить("ОшибкиФормирования", Новый Массив);
	
	Действие = Перечисления.ДействияПоЭДО.СформироватьОтвет;
	
	ЭтоВходящийЭДО = ЭтоВходящийЭДО(ЭлектронныйДокумент);
	Если Не ЭтоВходящийЭДО Тогда
		Результат.Отказ = Истина;
		Возврат Результат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		ЗаблокироватьДанныеДокументаДляИзменения(ЭлектронныйДокумент, ЭтоВходящийЭДО);
		
		ТекстыЗапросов = Новый Массив;
		ТекстыЗапросов.Добавить(ТекстЗапросаПараметровОбновленияСостоянияДокумента(ЭтоВходящийЭДО));
		ТекстыЗапросов.Добавить(ТекстЗапросаСвойствФайлаИнформацииОтправителя());
		ТекстыЗапросов.Добавить(ИнтеграцияЭДО.ТекстЗапросаОбъектовУчетаЭлектронныхДокументов());
	
		Запрос = Новый Запрос;
		Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		ПараметрыДокумента = РезультатыЗапроса[0].Выбрать();
		ПараметрыДокумента.Следующий();
		СостоянияСообщений = РезультатыЗапроса[1].Выгрузить();
		
		ДополненияСостоянийЭДО = НовыеДополненияСостоянийЭДО();
		
		Если Не ПараметрыДокумента.ТребуетсяПодтверждение 
			ИЛИ Не РегламентыЭДО.ЕстьИнформацияПолучателя(ПараметрыДокумента.ТипРегламента)
			ИЛИ СостоянияСообщений.Найти(Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя,
				"ТипЭлементаРегламента") <> Неопределено Тогда
			ЗафиксироватьТранзакцию();
			Возврат Результат;
		КонецЕсли;
		
		СвойстваОсновногоФайла = РезультатыЗапроса[2].Выбрать();
		Если Не СвойстваОсновногоФайла.Следующий() Тогда
			ОтменитьТранзакцию();
			Результат.Отказ = Истина;
			ДобавитьОшибкуОтсутствияОсновногоФайлаДокумента(КонтекстДиагностики, Действие, ЭлектронныйДокумент);
			Возврат Результат;
		КонецЕсли;
		
		НаборОбъектовУчета = Новый Массив;
		Если Не РезультатыЗапроса[3].Пустой() Тогда
			НаборОбъектовУчета = РезультатыЗапроса[3].Выгрузить().ВыгрузитьКолонку("ОбъектУчета");
		КонецЕсли;
		
		СообщениеОбъект = СоздатьОтветноеСообщение(ПараметрыДокумента.ВидДокумента, СвойстваОсновногоФайла,
			ЭлектронныйДокумент, ПараметрыДокумента, НаборОбъектовУчета, Результат.ОшибкиФормирования);
		
		Если СообщениеОбъект = Неопределено Тогда
			ОтменитьТранзакцию();
			Результат.Отказ = Истина;
			Возврат Результат;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СостоянияСообщений.Добавить(), СообщениеОбъект);
		
		ДополненияСостоянийЭДО = Неопределено;
		Если Не ПараметрыДокумента.ОбменБезПодписи Тогда
			ПараметрыМаршрута = СформироватьМаршрутПодписания(СообщениеОбъект);
			ДополненияСостоянийЭДО = ДополненияСостоянийЭДОПриПодписании(СообщениеОбъект,
				ПараметрыДокумента.ВидПодписи, ПараметрыМаршрута.ВесМаршрута);
			Результат.ТаблицаПодписания = ПараметрыМаршрута.ТаблицаПодписания;
		КонецЕсли;
		
		СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(ПараметрыДокумента, СостоянияСообщений,
			СообщениеОбъект.ДатаИзмененияСтатуса, КонтекстДиагностики, ДополненияСостоянийЭДО);
		
		ЗаписатьДействиеВЖурнал(Действие, ПараметрыДокумента, СостояниеДокумента, СообщениеОбъект.ДатаИзмененияСтатуса,
			СообщениеОбъект);
		
		Результат.СостояниеДокумента = СостояниеДокумента;
		Результат.СообщениеОбъект = СообщениеОбъект;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат.Отказ = Истина;
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоДокументу(ЭлектронныйДокумент, Действие, ТекстОшибки, КонтекстДиагностики);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаСвойствФайлаИнформацииОтправителя()
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПрисоединенныеФайлы.Ссылка,
		|	ПрисоединенныеФайлы.ПолноеИмяФайла,
		|	ПрисоединенныеФайлы.ДатаСоздания
		|ИЗ
		|	Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ПО ПрисоединенныеФайлы.Ссылка = СообщениеЭДО.ОсновнойФайл
		|		И СообщениеЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент
		|		И СообщениеЭДО.ТипЭлементаРегламента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя)
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент
		|	И СообщениеЭДО.ТипЭлементаРегламента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя)";
	Возврат ТекстЗапроса;
КонецФункции

Функция СоздатьОтветноеСообщение(ВидСообщения, СвойстваОсновногоФайла, ЭлектронныйДокумент, ПараметрыДокумента, НаборОбъектовУчета, ОшибкиФормирования)
	
	ОписаниеФайла = РаботаСФайламиБЭД.НовоеОписаниеФайла();
	ОписаниеФайла.ИмяФайла = СвойстваОсновногоФайла.ПолноеИмяФайла;
	ОписаниеФайла.ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(СвойстваОсновногоФайла.Ссылка);
	СодержаниеДокумента = ФорматыЭДО.ПрочитатьСодержаниеДокумента(ОписаниеФайла);
	
	ПараметрыФормирования = ИнтеграцияЭДО.НовыеПараметрыФормированияДанныхОбъектаУчет();
	ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ПараметрыДокумента);
	ПараметрыФормирования.Отправитель = ПараметрыДокумента.Организация;
	ПараметрыФормирования.Формат = ФорматыЭДО.ФорматОтветногоТитула(СодержаниеДокумента.Формат);
	ПараметрыФормирования.ТипДокумента = СодержаниеДокумента.ТипДокумента;
	ОписаниеДанных = ИнтеграцияЭДО.ОписаниеДанныхОбъектаУчета(НаборОбъектовУчета, ПараметрыФормирования);
	
	ОписаниеСообщения = ОписаниеСообщенияПолучателяПоОбъектуУчета(НаборОбъектовУчета, ОписаниеДанных.Данные,
		ПараметрыДокумента, СвойстваОсновногоФайла, ПараметрыФормирования.Формат);
	
	Если ОписаниеСообщения.Данные.ЕстьОшибки Тогда
		ОписаниеОшибки = НовоеОписаниеОшибкиФормирования();
		ОписаниеОшибки.ОписаниеОбъектаУчета.Организация = ПараметрыДокумента.Организация;
		ОписаниеОшибки.ОписаниеОбъектаУчета.Контрагент = ПараметрыДокумента.Контрагент;
		ОписаниеОшибки.ОписаниеОбъектаУчета.Договор = ПараметрыДокумента.ДоговорКонтрагента;
		ОписаниеОшибки.ОписаниеОбъектаУчета.ТипДокумента = СодержаниеДокумента.ТипДокумента;
		ОписаниеОшибки.ОписаниеОбъектаУчета.ПрикладнойТипДокумента = СодержаниеДокумента.ПрикладнойТипДокумента;
		ОписаниеОшибки.ВидДокумента = ПараметрыДокумента.ВидДокумента;
		Если ЗначениеЗаполнено(НаборОбъектовУчета) Тогда
			ОписаниеОшибки.ОписаниеОбъектаУчета.ОбъектУчета = НаборОбъектовУчета[0];
		КонецЕсли;
		ОписаниеОшибки.ОшибкиДанных = ОписаниеСообщения.Данные.Ошибки;
		ОшибкиФормирования.Добавить(ОписаниеОшибки);
		Возврат Неопределено;
	КонецЕсли;
	
	СообщениеОбъект = СоздатьСообщение(ОписаниеСообщения, ЭлектронныйДокумент, ПараметрыДокумента);
	
	Возврат СообщениеОбъект;
	
КонецФункции

Процедура ДобавитьОшибкуОтсутствияОсновногоФайлаДокумента(КонтекстДиагностики, Действие, ЭлектронныйДокумент)
	ПредставлениеДействия = НРег(Действие);
	ВидОперации = ВидОперацииПриДобавленииОшибки(ПредставлениеДействия);
	ПредставлениеДокумента = ПредставлениеДокумента(ЭлектронныйДокумент);
	ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось утвердить электронный документ: %1.'"), ПредставлениеДокумента);
	ПодробныйТекстОшибки = ТекстОшибки + Символы.ПС
		+ НСтр("ru = 'Не найден основной файл электронного документа.'");
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации,
		ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
		ПодробныйТекстОшибки, ТекстОшибки);
	ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
КонецПроцедуры

#КонецОбласти

#Область Подисать

Процедура ВыполнитьДействиеПодписать(ПараметрыВыполнения, РезультатДействий)
	
	ДанныеДляПодписания = ДанныеДокументовДляПодписания(ПараметрыВыполнения, РезультатДействий.КонтекстДиагностики);
	
	ОбработатьОшибкиДанныхДляПодписания(ДанныеДляПодписания.Ошибки, РезультатДействий.КонтекстДиагностики,
		ПараметрыВыполнения);
	
	Если ЗначениеЗаполнено(ДанныеДляПодписания.ДанныеДляПростойПодписи) Тогда
		ПодписатьПростойПодписью(ДанныеДляПодписания.ДанныеДляПростойПодписи, РезультатДействий);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДляПодписания.ДанныеДляПодписанияНаСервере) Тогда
		ПодписатьНаСервере(ДанныеДляПодписания.ДанныеДляПодписанияНаСервере, РезультатДействий);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДляПодписания.ДанныеДляИнтерактивногоПодписания) Тогда
		РезультатДействий.КонтекстПодписания = КонтекстИнтерактивногоПодписания(
			ДанныеДляПодписания.ДанныеДляИнтерактивногоПодписания, ПараметрыВыполнения,
			РезультатДействий.Итог);
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеДокументовДляПодписания(ПараметрыВыполнения, КонтекстДиагностики)
	
	Запрос = ЗапросДанныхСообщенийДляПодписания(ПараметрыВыполнения);
	
	РезультатыЗапроса = РезультатыЗапросаДанныхСообщенийДляПодписания(Запрос);
	
	РезультатОбработки = ОбработатьРезультатыЗапросаДанныхСообщенийДляПодписания(
		ПараметрыВыполнения, РезультатыЗапроса, КонтекстДиагностики);
	
	Возврат РезультатОбработки;
	
КонецФункции

Функция ЗапросДанныхСообщенийДляПодписания(ПараметрыВыполнения)
	
	ОписанияЗапросов = Новый Массив;
	
	ОписанияЗапросов.Добавить(ЗапросСообщенийДляПодписания("СообщенияДляОбработки", ПараметрыВыполнения.ОбъектыДействий));
	
	Отбор = КриптографияБЭД.НовыйОтборСертификатов();
	Отбор.Отпечатки = "&ОтпечаткиСертификатов";
	Отбор.ДоступныеТекущемуПользователю = Истина;
	Отбор.Облачные = ПараметрыВыполнения.ОтпечаткиСертификатов.Облако.Доступность;
	ОписанияЗапросов.Добавить(КриптографияБЭД.ЗапросДействующихСертификатов("ДоступныеСертификаты", Отбор));
	
	Отбор = СинхронизацияЭДО.НовыйОтборСертификатовУчетныхЗаписей();
	Отбор.УчетныеЗаписи = "ВЫБРАТЬ РАЗЛИЧНЫЕ ИдентификаторОрганизации ИЗ СообщенияДляОбработки";
	ОписанияЗапросов.Добавить(СинхронизацияЭДО.ЗапросСертификатовУчетныхЗаписей("СертификатыУчетныхЗаписей", Отбор));
	
	Отбор = КриптографияБЭД.НовыйОтборПодписываемыхВидовДокументов();
	Отбор.Сертификаты = "ВЫБРАТЬ Ссылка ИЗ ДоступныеСертификаты";
	Отбор.ВидыДокументов = "ВЫБРАТЬ РАЗЛИЧНЫЕ ВидСообщения ИЗ СообщенияДляОбработки";
	ОписанияЗапросов.Добавить(КриптографияБЭД.ЗапросПодписываемыхВидовДокументов("ПодписываемыеВидыДокументов", Отбор));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоступныеСертификаты.Ссылка КАК Сертификат,
		|	ДоступныеСертификаты.Отпечаток КАК Отпечаток,
		|	ДоступныеСертификаты.Программа КАК Программа,
		|	ДоступныеСертификаты.Организация КАК Организация,
		|	ПодписываемыеВидыДокументов.ВидДокумента КАК ВидДокумента,
		|	ПодписываемыеВидыДокументов.Использовать КАК Использовать,
		|	ЕСТЬNULL(СертификатыУчетныхЗаписей.ИдентификаторЭДО, """") КАК ИдентификаторОрганизации
		|ИЗ
		|	ДоступныеСертификаты КАК ДоступныеСертификаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодписываемыеВидыДокументов КАК ПодписываемыеВидыДокументов
		|		ПО ДоступныеСертификаты.Ссылка = ПодписываемыеВидыДокументов.Сертификат
		|		ЛЕВОЕ СОЕДИНЕНИЕ СертификатыУчетныхЗаписей КАК СертификатыУчетныхЗаписей
		|		ПО ДоступныеСертификаты.Ссылка = СертификатыУчетныхЗаписей.Сертификат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СообщенияДляОбработки.Ссылка КАК Ссылка,
		|	СообщенияДляОбработки.ТипЭлементаРегламента КАК ТипЭлементаРегламента,
		|	СообщенияДляОбработки.Направление КАК Направление,
		|	СообщенияДляОбработки.Дата КАК Дата,
		|	СообщенияДляОбработки.ВидСообщения КАК ВидСообщения,
		|	СообщенияДляОбработки.Организация КАК Организация,
		|	СообщенияДляОбработки.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
		|	СообщенияДляОбработки.ВидПодписи КАК ВидПодписи,
		|	СообщенияДляОбработки.ВидДокумента КАК ВидДокумента,
		|	СообщенияДляОбработки.НомерДокумента КАК НомерДокумента,
		|	СообщенияДляОбработки.ДатаДокумента КАК ДатаДокумента,
		|	СообщенияДляОбработки.ОсновнойФайл КАК ПрисоединенныйФайл,
		|	ОбъектыДляПодписания.Организация КАК ОрганизацияДляПодписания,
		|	ОбъектыДляПодписания.Подписант КАК Подписант,
		|	ПрисоединенныеФайлы.ПолноеИмяФайла КАК ПолноеИмяФайла,
		|	ПрисоединенныеФайлы.ПодписанЭП КАК ПодписанЭП,
		|	ВидыДокументовЭДО.ТипДокумента КАК ТипДокумента,
		|	ВидыДокументовЭДО.ПрикладнойТипДокумента КАК ПрикладнойТипДокумента,
		|	&ЭтоОсновнойВидДокумента КАК ЭтоОсновнойВидДокумента
		|ИЗ
		|	СообщенияДляОбработки КАК СообщенияДляОбработки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеПодписанияЭД КАК ОбъектыДляПодписания
		|		ПО СообщенияДляОбработки.Ссылка = ОбъектыДляПодписания.Объект
		|		И ОбъектыДляПодписания.Текущий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|		ПО СообщенияДляОбработки.ОсновнойФайл = ПрисоединенныеФайлы.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|		ПО СообщенияДляОбработки.ВидСообщения = ВидыДокументовЭДО.Ссылка";
	
	Запрос = ОбщегоНазначенияБЭД.СоединитьЗапросы(Запрос, ОписанияЗапросов);
	
	ВсеОтпечатки = КриптографияБЭД.ПолучитьВсеОтпечаткиСертификатов(ПараметрыВыполнения.ОтпечаткиСертификатов);
	Запрос.УстановитьПараметр("ОтпечаткиСертификатов", ВсеОтпечатки);
	
	ИспользуютсяВнутренниеДокументы = НастройкиЭДО.ИспользуютсяВнутренниеДокументы();
	Если Не ИспользуютсяВнутренниеДокументы Тогда
		Запрос.УстановитьПараметр("ЭтоОсновнойВидДокумента", Ложь);
		Возврат Запрос;
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЭтоОсновнойВидДокумента",
		"НЕ НастройкиВнутреннегоЭДО.ВидВнутреннегоДокумента ЕСТЬ NULL");
	
	Запрос.Текст = Запрос.Текст + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиВнутреннегоЭДО КАК НастройкиВнутреннегоЭДО
		|		ПО СообщенияДляОбработки.Организация = НастройкиВнутреннегоЭДО.Организация
		|		И СообщенияДляОбработки.ВидДокумента = НастройкиВнутреннегоЭДО.ВидВнутреннегоДокумента
		|		И НастройкиВнутреннегоЭДО.ЭтоОсновнойВидДокумента";
	
	Возврат Запрос;
	
КонецФункции

Функция ЗапросСообщенийДляПодписания(ИмяВременнойТаблицы, ОбъектыДействий)
	
	ОписаниеЗапроса = ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса();
	
	МеткаВременнойТаблицы = "ПОМЕСТИТЬ ИмяВременнойТаблицы";
	ЗначениеВременнойТаблицы = "";
	Если ЗначениеЗаполнено(ИмяВременнойТаблицы) Тогда
		ЗначениеВременнойТаблицы = СтрЗаменить(МеткаВременнойТаблицы, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	КонецЕсли;
	
	ОписаниеЗапроса.СлужебныеПараметры.Вставить("ОтборСостояниеСообщения", Перечисления.СостоянияСообщенийЭДО.Подписание);
	ОписаниеЗапроса.СлужебныеПараметры.Вставить("ВидПодписиУсиленнаяКвалифицированная",
		Перечисления.ВидыЭлектронныхПодписей.УсиленнаяКвалифицированная);
	
	ТекстыЗапросов = Новый Массив;
	ТекстыВспомогательныхЗапросов = Новый Массив;
	
	Если ЗначениеЗаполнено(ОбъектыДействий.ОбъектыУчета) Тогда
		
		ОтборДокументов = ИнтеграцияЭДО.НовыйОтборАктуальныхЭлектронныхДокументов();
		ОтборДокументов.ОбъектыУчета = "&ОтборОбъектыУчета";
		ТекстыВспомогательныхЗапросов.Добавить(ИнтеграцияЭДО.ЗапросАктуальныхЭлектронныхДокументов(
			"ЭлектронныеДокументыОбъектовУчета", ОтборДокументов).Текст);
		
		ОписаниеЗапроса.СлужебныеПараметры.Вставить("ОтборОбъектыУчета", ОбъектыДействий.ОбъектыУчета);
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	&ПоляВыбораИсходящийЭДО
			|ПОМЕСТИТЬ ИмяВременнойТаблицы
			|ИЗ
			|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЭлектронныеДокументыОбъектовУчета КАК ЭлектронныеДокументыОбъектовУчета
			|		ПО ЭлектронныйДокументИсходящийЭДО.Ссылка = ЭлектронныеДокументыОбъектовУчета.ЭлектронныйДокумент
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
			|		ПО ЭлектронныйДокументИсходящийЭДО.Ссылка = СообщениеЭДО.ЭлектронныйДокумент
			|		И СообщениеЭДО.Состояние = &ОтборСостояниеСообщения
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ПоляВыбораВходящийЭДО
			|ИЗ
			|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЭлектронныеДокументыОбъектовУчета КАК ЭлектронныеДокументыОбъектовУчета
			|		ПО ЭлектронныйДокументВходящийЭДО.Ссылка = ЭлектронныеДокументыОбъектовУчета.ЭлектронныйДокумент
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
			|		ПО ЭлектронныйДокументВходящийЭДО.Ссылка = СообщениеЭДО.ЭлектронныйДокумент
			|		И СообщениеЭДО.Состояние = &ОтборСостояниеСообщения";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, МеткаВременнойТаблицы, ЗначениеВременнойТаблицы);
		
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектыДействий.ЭлектронныеДокументы) Тогда
		
		ОписаниеЗапроса.СлужебныеПараметры.Вставить("ОтборЭлектронныеДокументы", ОбъектыДействий.ЭлектронныеДокументы);
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	&ПоляВыбораИсходящийЭДО
			|ПОМЕСТИТЬ ИмяВременнойТаблицы
			|ИЗ
			|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
			|		ПО ЭлектронныйДокументИсходящийЭДО.Ссылка = СообщениеЭДО.ЭлектронныйДокумент
			|		И СообщениеЭДО.Состояние = &ОтборСостояниеСообщения
			|ГДЕ
			|	ЭлектронныйДокументИсходящийЭДО.Ссылка В (&ОтборЭлектронныеДокументы)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ПоляВыбораВходящийЭДО
			|ИЗ
			|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
			|		ПО ЭлектронныйДокументВходящийЭДО.Ссылка = СообщениеЭДО.ЭлектронныйДокумент
			|		И СообщениеЭДО.Состояние = &ОтборСостояниеСообщения
			|ГДЕ
			|	ЭлектронныйДокументВходящийЭДО.Ссылка В (&ОтборЭлектронныеДокументы)";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, МеткаВременнойТаблицы,
			?(ЗначениеЗаполнено(ТекстыЗапросов), "", ЗначениеВременнойТаблицы));
		
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектыДействий.Сообщения) Тогда
		
		ОписаниеЗапроса.СлужебныеПараметры.Вставить("ОтборСообщения", ОбъектыДействий.Сообщения);
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	&ПоляВыбораИсходящийЭДО
			|ПОМЕСТИТЬ ИмяВременнойТаблицы
			|ИЗ
			|	Документ.СообщениеЭДО КАК СообщениеЭДО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
			|		ПО СообщениеЭДО.ЭлектронныйДокумент = ЭлектронныйДокументИсходящийЭДО.Ссылка
			|		И СообщениеЭДО.Состояние = &ОтборСостояниеСообщения
			|ГДЕ
			|	СообщениеЭДО.Ссылка В (&ОтборСообщения)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ПоляВыбораВходящийЭДО
			|ИЗ
			|	Документ.СообщениеЭДО КАК СообщениеЭДО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
			|		ПО СообщениеЭДО.ЭлектронныйДокумент = ЭлектронныйДокументВходящийЭДО.Ссылка
			|		И СообщениеЭДО.Состояние = &ОтборСостояниеСообщения
			|ГДЕ
			|	СообщениеЭДО.Ссылка В (&ОтборСообщения)";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, МеткаВременнойТаблицы,
			?(ЗначениеЗаполнено(ТекстыЗапросов), "", ЗначениеВременнойТаблицы));
		
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектыДействий.ПакетыДокументов) Тогда
		
		ОписаниеЗапроса.СлужебныеПараметры.Вставить("ОтборПакетыДокументов", ОбъектыДействий.ПакетыДокументов);
		
		ТекстыВспомогательныхЗапросов.Добавить(
			"ВЫБРАТЬ
			|	СоставПакетовДокументовЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент
			|ПОМЕСТИТЬ ДокументыПакетов
			|ИЗ
			|	РегистрСведений.СоставПакетовДокументовЭДО КАК СоставПакетовДокументовЭДО
			|ГДЕ
			|	СоставПакетовДокументовЭДО.ИдентификаторПакета В (&ОтборПакетыДокументов)"
			);
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	&ПоляВыбораИсходящийЭДО
			|ПОМЕСТИТЬ ИмяВременнойТаблицы
			|ИЗ
			|	ДокументыПакетов КАК ДокументыПакетов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
			|		ПО ДокументыПакетов.ЭлектронныйДокумент = ЭлектронныйДокументИсходящийЭДО.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
			|		ПО ЭлектронныйДокументИсходящийЭДО.Ссылка = СообщениеЭДО.ЭлектронныйДокумент
			|		И СообщениеЭДО.Состояние = &ОтборСостояниеСообщения
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ПоляВыбораВходящийЭДО
			|ИЗ
			|	ДокументыПакетов КАК ДокументыПакетов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
			|		ПО ДокументыПакетов.ЭлектронныйДокумент = ЭлектронныйДокументВходящийЭДО.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
			|		ПО ЭлектронныйДокументВходящийЭДО.Ссылка = СообщениеЭДО.ЭлектронныйДокумент
			|		И СообщениеЭДО.Состояние = &ОтборСостояниеСообщения";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, МеткаВременнойТаблицы,
			?(ЗначениеЗаполнено(ТекстыЗапросов), "", ЗначениеВременнойТаблицы));
		
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, "
		|
		|ОБЪЕДИНИТЬ
		|");
		
	ПоляВыбораИсходящийЭДО = 
		"	СообщениеЭДО.Ссылка КАК Ссылка,
		|	СообщениеЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
		|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента,
		|	СообщениеЭДО.Направление КАК Направление,
		|	СообщениеЭДО.ОсновнойФайл КАК ОсновнойФайл,
		|	СообщениеЭДО.Дата КАК Дата,
		|	СообщениеЭДО.ВидСообщения КАК ВидСообщения,
		|	ЭлектронныйДокументИсходящийЭДО.ВидДокумента КАК ВидДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
		|	ЭлектронныйДокументИсходящийЭДО.Организация КАК Организация,
		|	ЭлектронныйДокументИсходящийЭДО.ВидПодписи КАК ВидПодписи,
		|	ЭлектронныйДокументИсходящийЭДО.НомерДокумента КАК НомерДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.ДатаДокумента КАК ДатаДокумента";
	
	ПоляВыбораВходящийЭДО = 
		"	СообщениеЭДО.Ссылка КАК Ссылка,
		|	СообщениеЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
		|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента,
		|	СообщениеЭДО.Направление КАК Направление,
		|	СообщениеЭДО.ОсновнойФайл КАК ОсновнойФайл,
		|	СообщениеЭДО.Дата КАК Дата,
		|	СообщениеЭДО.ВидСообщения КАК ВидСообщения,
		|	ЭлектронныйДокументВходящийЭДО.ВидДокумента КАК ВидДокумента,
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
		|	ЭлектронныйДокументВходящийЭДО.Организация КАК Организация,
		|	&ВидПодписиУсиленнаяКвалифицированная КАК ВидПодписи,
		|	ЭлектронныйДокументВходящийЭДО.НомерДокумента КАК НомерДокумента,
		|	ЭлектронныйДокументВходящийЭДО.ДатаДокумента КАК ДатаДокумента";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляВыбораИсходящийЭДО", ПоляВыбораИсходящийЭДО);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляВыбораВходящийЭДО", ПоляВыбораВходящийЭДО);
	
	Если ЗначениеЗаполнено(ТекстыВспомогательныхЗапросов) Тогда
		ТекстыВспомогательныхЗапросов.Добавить(ТекстЗапроса);
		ОписаниеЗапроса.Текст = СтрСоединить(ТекстыВспомогательныхЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	Иначе
		ОписаниеЗапроса.Текст = ТекстЗапроса;
	КонецЕсли;
	
	Возврат ОписаниеЗапроса;
	
КонецФункции

Функция РезультатыЗапросаДанныхСообщенийДляПодписания(Запрос)
	МассивРезультатов = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = МассивРезультатов.Количество();
	РезультатыЗапроса = Новый Структура;
	РезультатыЗапроса.Вставить("Сертификаты", МассивРезультатов[КоличествоРезультатов - 2]);
	РезультатыЗапроса.Вставить("ДанныеСообщений", МассивРезультатов[КоличествоРезультатов - 1]);
	Возврат РезультатыЗапроса;
КонецФункции

Функция ОбработатьРезультатыЗапросаДанныхСообщенийДляПодписания(ПараметрыВыполнения, РезультатыЗапроса, КонтекстДиагностики)
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибки", НовоеОписаниеОшибокОбработкиДанныхПриПодписании());
	Результат.Вставить("ДанныеДляПростойПодписи", Новый Массив);
	Результат.Вставить("ДанныеДляИнтерактивногоПодписания", Новый Массив);
	Результат.Вставить("ДанныеДляПодписанияНаСервере", Новый Массив);
	
	Ошибки = Результат.Ошибки;
	ДанныеДляПростойПодписи = Результат.ДанныеДляПростойПодписи;
	
	СертификатыДляПодписания = РезультатыЗапроса.Сертификаты.Выгрузить();
	ОтсутствуютСертификаты = Не ЗначениеЗаполнено(СертификатыДляПодписания);
	ОтпечаткиНаСервере = ПараметрыВыполнения.ОтпечаткиСертификатов.Сервер.Отпечатки;
	ЕстьОшибкаПолученияОтпечатков = Ложь;
	Если ОтсутствуютСертификаты Тогда
		ЕстьОшибкаПолученияОтпечатков = КриптографияБЭД.ЕстьОшибкаПолученияОтпечатков(
			ПараметрыВыполнения.ОтпечаткиСертификатов);
	КонецЕсли;
	
	НаборыСертификатов = Новый Соответствие;
	НаборыПараметровСообщенийПоСертификатам = Новый Соответствие;
	КэшПоискаНаборовСертификатов = Новый Соответствие;
	ЕстьСообщенияБезДоступныхСертификатов = Ложь;
	ПрисоединенныеФайлыМассив = Новый Массив;
	
	ТекущиеПодписанты = Новый Массив(3);
	ТекущиеПодписанты[0] = Пользователи.АвторизованныйПользователь();
	ТекущиеПодписанты[1] = Пользователи.СсылкаНеуказанногоПользователя();
	ТекущиеПодписанты[2] = ИнтеграцияБСПБЭД.ПустаяСсылкаНаПользователя();
	
	ОбработанныеСообщения = Новый Соответствие;
	ТребуетсяПроверкаОбработанныхСообщений = Ложь;
	
	Выборка = РезультатыЗапроса.ДанныеСообщений.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СообщениеОбработано = ОбработанныеСообщения[Выборка.Ссылка];
		Если СообщениеОбработано = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		СообщениеДоступноПользователю = ТекущиеПодписанты.Найти(Выборка.Подписант) <> Неопределено;
		
		Если СообщениеОбработано = Неопределено
			ИЛИ СообщениеДоступноПользователю Тогда
			ОбработанныеСообщения.Вставить(Выборка.Ссылка, СообщениеДоступноПользователю);
		КонецЕсли;
		
		Если Не СообщениеДоступноПользователю Тогда
			ТребуетсяПроверкаОбработанныхСообщений = Истина;
			Продолжить;
		КонецЕсли;
		
		Если Выборка.ВидПодписи = Перечисления.ВидыЭлектронныхПодписей.Простая Тогда
			ДанныеСообщения = ДанныеСообщенияДляПростойПодписи(Выборка);
			ДанныеДляПростойПодписи.Добавить(ДанныеСообщения);
			Продолжить;
		КонецЕсли;
		
		Если ОтсутствуютСертификаты Тогда
			Если ЕстьОшибкаПолученияОтпечатков Тогда
				Ошибки.ЕстьОшибкаКриптографииПоСообщениямДляПодписания = Истина;
			Иначе
				НоваяСтрока = Ошибки.УчетныеЗаписиБезСертификатов.Добавить();
				НоваяСтрока.ИдентификаторЭДО = Выборка.ИдентификаторОрганизации;
				НоваяСтрока.Сообщение = Выборка.Ссылка;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		НаборСертификатов = НайтиСоздатьНаборСертификатовДляПодписания(Выборка, НаборыСертификатов,
			СертификатыДляПодписания, ОтпечаткиНаСервере, КэшПоискаНаборовСертификатов, Ошибки);
		
		Если Не ЗначениеЗаполнено(НаборСертификатов.ДанныеСертификатов) Тогда
			ЕстьСообщенияБезДоступныхСертификатов = Истина;
			Если Не НаборСертификатов.ЕстьОшибки Тогда
				НоваяСтрока = Ошибки.УчетныеЗаписиБезСертификатов.Добавить();
				НоваяСтрока.ИдентификаторЭДО = Выборка.ИдентификаторОрганизации;
				НоваяСтрока.Сообщение = Выборка.Ссылка;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		НаборПараметровСообщений = НаборыПараметровСообщенийПоСертификатам[НаборСертификатов];
		Если НаборПараметровСообщений = Неопределено Тогда
			НаборПараметровСообщений = Новый Массив;
			НаборыПараметровСообщенийПоСертификатам.Вставить(НаборСертификатов, НаборПараметровСообщений);
		КонецЕсли;
		
		ПараметрыПодписанияСообщения = ПараметрыПодписанияСообщения(Выборка);
		
		НаборПараметровСообщений.Добавить(ПараметрыПодписанияСообщения);
		
		ПрисоединенныеФайлыМассив.Добавить(Выборка.ПрисоединенныйФайл);
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(НаборыПараметровСообщенийПоСертификатам)
		И ЕстьСообщенияБезДоступныхСертификатов Тогда
		Ошибки.ОтсутствуютДоступныеСертификаты = Истина;
	КонецЕсли;
	
	Если ТребуетсяПроверкаОбработанныхСообщений Тогда
		Для Каждого ЭлементКоллекции Из ОбработанныеСообщения Цикл
			Если ЭлементКоллекции.Значение Тогда
				Продолжить;
			КонецЕсли;
			Ошибки.НедоступныеСообщения.Добавить(ЭлементКоллекции.Ключ);
		КонецЦикла;
	КонецЕсли;
	
	ДвоичныеДанныеФайлов = РаботаСФайламиБЭД.ДвоичныеДанныеФайлов(ПрисоединенныеФайлыМассив, КонтекстДиагностики);
	
	Для Каждого ПараметрыСообщенийПоСертификатам Из НаборыПараметровСообщенийПоСертификатам Цикл
		
		Если НаборСертификатов.ИспользоватьНаСевере Тогда
			
			ОписаниеНабораДанных = ОписаниеНабораДанныхДляПодписанияНаСервере(
				ПараметрыСообщенийПоСертификатам, ДвоичныеДанныеФайлов);
			Результат.ДанныеДляПодписанияНаСервере.Добавить(ОписаниеНабораДанных);
			
		Иначе
			
			ОписаниеНабораДанных = ОписаниеНабораДанныхДляИнтерактивногоПодписания(
				ПараметрыСообщенийПоСертификатам, ДвоичныеДанныеФайлов);
			Результат.ДанныеДляИнтерактивногоПодписания.Добавить(ОписаниеНабораДанных);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиСоздатьНаборСертификатовДляПодписания(Выборка, НаборыСертификатов, СертификатыДляПодписания, ОтпечаткиНаСервере, КэшПоиска, Ошибки)
	
	НаборСертификатов = НаборСертификатовВКэше(КэшПоиска, Выборка);
	Если НаборСертификатов <> Неопределено Тогда
		Возврат НаборСертификатов;
	КонецЕсли;
	
	НовыйНаборСертификатов = Новый Структура;
	НовыйНаборСертификатов.Вставить("ИспользоватьНаСевере", Ложь);
	НовыйНаборСертификатов.Вставить("ЕстьОшибки", Ложь);
	НовыйНаборСертификатов.Вставить("ДанныеСертификатов", Новый Массив);
	
	ДанныеСертификатов = НовыйНаборСертификатов.ДанныеСертификатов;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидДокумента", Выборка.ВидСообщения);
	Если Выборка.Направление = Перечисления.НаправленияЭДО.Интеркампани Тогда
		Отбор.Вставить("Организация", Выборка.ОрганизацияДляПодписания);
	Иначе
		Отбор.Вставить("ИдентификаторОрганизации", Выборка.ИдентификаторОрганизации);
	КонецЕсли;
	
	НайденныеСтроки = СертификатыДляПодписания.НайтиСтроки(Отбор);
	Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
		ДобавитьНаборСертификатовВКэшПоиска(КэшПоиска, Выборка, НовыйНаборСертификатов);
		Возврат НовыйНаборСертификатов;
	КонецЕсли;
	
	КлючНабораСертификатов = "";
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		
		Если Не СтрокаТаблицы.Использовать Тогда
			Продолжить;
		КонецЕсли;
		
		КлючНабораСертификатов = КлючНабораСертификатов + Строка(СтрокаТаблицы.Сертификат.УникальныйИдентификатор());
		
		ДанныеСертификата = Новый Структура;
		ДанныеСертификата.Вставить("Ссылка", СтрокаТаблицы.Сертификат);
		ДанныеСертификата.Вставить("Отпечаток", СтрокаТаблицы.Отпечаток);
		ДанныеСертификата.Вставить("Программа", СтрокаТаблицы.Программа);
		ДанныеСертификата.Вставить("Пароль", "");
		ДанныеСертификатов.Добавить(ДанныеСертификата);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ДанныеСертификатов) Тогда
		НовыйНаборСертификатов.ЕстьОшибки = Истина;
		
		Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
			НоваяСтрока = Ошибки.ЗапрещенныеВидыДокументов.Добавить();
			НоваяСтрока.Сертификат = СтрокаТаблицы.Сертификат;
			НоваяСтрока.ВидСообщения = СтрокаТаблицы.ВидСообщения;
		КонецЦикла;
		
		ДобавитьНаборСертификатовВКэшПоиска(КэшПоиска, Выборка, НовыйНаборСертификатов);
		Возврат НовыйНаборСертификатов;
	КонецЕсли;
	
	НаборСертификатов = НаборыСертификатов[КлючНабораСертификатов];
	Если НаборСертификатов <> Неопределено Тогда
		Возврат НаборСертификатов;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтпечаткиНаСервере)
		И ДанныеСертификатов.Количество() = 1
		И ОтпечаткиНаСервере.Найти(ДанныеСертификатов[0].Отпечаток) <> Неопределено Тогда
		
		Сертификат = ДанныеСертификатов[0].Ссылка;
		УстановитьПривилегированныйРежим(Истина);
		ПаролиСертификатов = КриптографияБЭД.ПаролиСертификатов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сертификат));
		УстановитьПривилегированныйРежим(Ложь);
		
		Пароль = ПаролиСертификатов[Сертификат];
		Если Пароль <> Неопределено Тогда
			ДанныеСертификатов[0].Пароль = Пароль;
			НовыйНаборСертификатов.ИспользоватьНаСевере = Истина;
		КонецЕсли;
	КонецЕсли;
	
	НаборыСертификатов.Вставить(КлючНабораСертификатов, НовыйНаборСертификатов);
	ДобавитьНаборСертификатовВКэшПоиска(КэшПоиска, Выборка, НовыйНаборСертификатов);
	
	Возврат НовыйНаборСертификатов;
	
КонецФункции

Функция НаборСертификатовВКэше(КэшПоиска, Выборка)
	Возврат КэшПоиска[КлючПоискаНабораСертификатовВКэше(Выборка)];
КонецФункции

Процедура ДобавитьНаборСертификатовВКэшПоиска(КэшПоиска, Выборка, НаборСертификатов)
	КэшПоиска.Вставить(КлючПоискаНабораСертификатовВКэше(Выборка), НаборСертификатов);
КонецПроцедуры

Функция КлючПоискаНабораСертификатовВКэше(Выборка)
	Возврат Выборка.ИдентификаторОрганизации + Выборка.ВидСообщения.УникальныйИдентификатор();
КонецФункции

Функция ДанныеСообщенияДляПростойПодписи(Выборка)
	ДанныеСообщения = Новый Структура;
	ДанныеСообщения.Вставить("Ссылка", Выборка.Ссылка);
	ДанныеСообщения.Вставить("Организация", Выборка.Организация);
	Возврат ДанныеСообщения;
КонецФункции

Функция ПараметрыПодписанияСообщения(Выборка)
	Параметры = Новый Структура;
	Параметры.Вставить("Ссылка", Выборка.Ссылка);
	Параметры.Вставить("Представление",
		?(РегламентыЭДО.ЭтоСлужебноеСообщение(Выборка.ТипЭлементаРегламента),
		ПредставлениеСообщенияПоСвойствам(Выборка), ПредставлениеДокументаПоСвойствам(Выборка)));
	Параметры.Вставить("ПрисоединенныйФайл", Выборка.ПрисоединенныйФайл);
	Параметры.Вставить("ПолноеИмяФайла", Выборка.ПолноеИмяФайла);
	Параметры.Вставить("ПодписанЭП", Выборка.ПодписанЭП);
	Параметры.Вставить("Организация", Выборка.Организация);
	Возврат Параметры;
КонецФункции

Функция ДанныеСообщенияДляИнтерактивногоПодписания(ПараметрыПодписания, ДвоичныеДанные = Неопределено)
	ДанныеСообщения = Новый Структура;
	ДанныеСообщения.Вставить("Данные", ДвоичныеДанные);
	ДанныеСообщения.Вставить("Представление", Новый Структура);
	ДанныеСообщения.Представление.Вставить("Значение", ПараметрыПодписания.Ссылка);
	ДанныеСообщения.Представление.Вставить("Представление", ПараметрыПодписания.Представление);
	ДанныеСообщения.Вставить("ПрисоединенныйФайл", ПараметрыПодписания.ПрисоединенныйФайл);
	ДанныеСообщения.Вставить("ТребуетсяЗаполнитьПодписанта", Ложь);
	ДанныеСообщения.Вставить("ДанныеИзменены", Ложь);
	ДанныеСообщения.Вставить("АдресДанныхДляОбновления", "");
	Возврат ДанныеСообщения;
КонецФункции

Функция ДанныеСообщенияДляПодписанияНаСервере(ПараметрыПодписания, ДвоичныеДанные = Неопределено)
	ДанныеСообщения = Новый Структура;
	ДанныеСообщения.Вставить("Данные", ДвоичныеДанные);
	ДанныеСообщения.Вставить("Ссылка", ПараметрыПодписания.Ссылка);
	ДанныеСообщения.Вставить("ПрисоединенныйФайл", ПараметрыПодписания.ПрисоединенныйФайл);
	ДанныеСообщения.Вставить("ОбновитьДанные", Ложь);
	Возврат ДанныеСообщения;
КонецФункции

Функция ОписаниеНабораДанныхДляПодписанияНаСервере(ПараметрыСообщенийПоСертификатам, ДвоичныеДанныеФайлов)
	
	ДанныеСертификата = ПараметрыСообщенийПоСертификатам.Ключ.ДанныеСертификатов[0];
	НаборДанных = Новый Массив;
	
	Для Каждого ПараметрыСообщения Из ПараметрыСообщенийПоСертификатам.Значение Цикл
		
		ДанныеФайла = ДвоичныеДанныеФайлов[ПараметрыСообщения.ПрисоединенныйФайл];
		
		ОписаниеФайла = РаботаСФайламиБЭД.НовоеОписаниеФайла();
		ОписаниеФайла.ДвоичныеДанные = ДанныеФайла;
		ОписаниеФайла.ИмяФайла = ПараметрыСообщения.ПолноеИмяФайла;
		
		ОбновитьДанные = Ложь;
		СодержаниеДокумента = ФорматыЭДО.ПрочитатьСодержаниеДокумента(ОписаниеФайла);
		Если СодержаниеДокумента <> Неопределено
			И ФорматыЭДО.ЗаполнениеДанныхПодписантаДоступно(СодержаниеДокумента) Тогда
			
			ОписаниеФайла = ФорматыЭДО.ЗаполнитьДанныеПодписантаДокумента(ОписаниеФайла, ПараметрыСообщения.Организация,
				ДанныеСертификата.Ссылка, СодержаниеДокумента);
			
			ОбновитьДанные = Истина;
		КонецЕсли;
		
		ДанныеСообщения = ДанныеСообщенияДляПодписанияНаСервере(ПараметрыСообщения, ОписаниеФайла.ДвоичныеДанные);
		ДанныеСообщения.ОбновитьДанные = ОбновитьДанные;
		НаборДанных.Добавить(ДанныеСообщения);
		
	КонецЦикла;
	
	ОписаниеНабораДанных = Новый Структура;
	ОписаниеНабораДанных.Вставить("Сертификат", ДанныеСертификата.Ссылка);
	ОписаниеНабораДанных.Вставить("Отпечаток", ДанныеСертификата.Отпечаток);
	ОписаниеНабораДанных.Вставить("Программа", ДанныеСертификата.Программа);
	ОписаниеНабораДанных.Вставить("Пароль", ДанныеСертификата.Пароль);
	ОписаниеНабораДанных.Вставить("НаборДанных", НаборДанных);
	Возврат ОписаниеНабораДанных;
	
КонецФункции

Функция ОписаниеНабораДанныхДляИнтерактивногоПодписания(ПараметрыСообщенийПоСертификатам, ДвоичныеДанныеФайлов)
	
	Сертификаты = Новый Массив;
	Для Каждого ДанныеСертификата Из ПараметрыСообщенийПоСертификатам.Ключ.ДанныеСертификатов Цикл
		Сертификаты.Добавить(ДанныеСертификата.Ссылка);
	КонецЦикла;

	НаборДанных = Новый Массив;
	КоличествоСертификатов = Сертификаты.Количество();
	ТребуетсяЗаполнитьПодписантов = Ложь;
		
	Для Каждого ПараметрыСообщения Из ПараметрыСообщенийПоСертификатам.Значение Цикл
		
		ДанныеСообщения = ДанныеСообщенияДляИнтерактивногоПодписания(ПараметрыСообщения);
		
		ДанныеФайла = ДвоичныеДанныеФайлов[ПараметрыСообщения.ПрисоединенныйФайл];
		
		Если ПараметрыСообщения.ПодписанЭП
			ИЛИ ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(
				ПараметрыСообщения.ПолноеИмяФайла).Расширение <> ".xml" Тогда
			
			ДанныеСообщения.Данные = ДанныеФайла;
			
		Иначе
			
			ОписаниеФайла = РаботаСФайламиБЭД.НовоеОписаниеФайла();
			ОписаниеФайла.ДвоичныеДанные = ДанныеФайла;
			ОписаниеФайла.ИмяФайла = ПараметрыСообщения.ПолноеИмяФайла;
			
			СодержаниеДокумента = ФорматыЭДО.ПрочитатьСодержаниеДокумента(ОписаниеФайла);
			Если СодержаниеДокумента = Неопределено
				ИЛИ Не ФорматыЭДО.ЗаполнениеДанныхПодписантаДоступно(СодержаниеДокумента) Тогда
				
				ДанныеСообщения.Данные = ДанныеФайла;
				
			ИначеЕсли КоличествоСертификатов = 1 Тогда 
				
				ОписаниеФайла = ФорматыЭДО.ЗаполнитьДанныеПодписантаДокумента(ОписаниеФайла, ПараметрыСообщения.Организация,
					Сертификаты[0], СодержаниеДокумента);
				ДанныеСообщения.Данные = ОписаниеФайла.ДвоичныеДанные;
				ДанныеСообщения.ДанныеИзменены = Истина;
				
			Иначе
				
				ДанныеСообщения.ТребуетсяЗаполнитьПодписанта = Истина;
				ТребуетсяЗаполнитьПодписантов = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		НаборДанных.Добавить(ДанныеСообщения);
		
	КонецЦикла;
	
	ОписаниеНабораДанных = Новый Структура;
	ОписаниеНабораДанных.Вставить("Сертификаты", Сертификаты);
	ОписаниеНабораДанных.Вставить("НаборДанных", НаборДанных);
	ОписаниеНабораДанных.Вставить("ТребуетсяЗаполнитьПодписантов", ТребуетсяЗаполнитьПодписантов);
	Возврат ОписаниеНабораДанных;
	
КонецФункции

Функция НовоеОписаниеОшибокОбработкиДанныхПриПодписании()
	ОписаниеОшибок = Новый Структура;
	ОписаниеОшибок.Вставить("ЕстьОшибкаКриптографииПоСообщениямДляПодписания", Ложь);
	ОписаниеОшибок.Вставить("ОтсутствуютДоступныеСертификаты", Ложь);
	ОписаниеОшибок.Вставить("НедоступныеСообщения", Новый Массив);
	ОписаниеОшибок.Вставить("УчетныеЗаписиБезСертификатов", СинхронизацияЭДО.НоваяТаблицаУчетныхЗаписейБезСертификатов());
	ОписаниеОшибок.Вставить("ЗапрещенныеВидыСообщений", Новый ТаблицаЗначений());
	ОписаниеОшибок.ЗапрещенныеВидыСообщений.Колонки.Добавить("Сертификат");
	ОписаниеОшибок.ЗапрещенныеВидыСообщений.Колонки.Добавить("ВидСообщения");
	Возврат ОписаниеОшибок;
КонецФункции

Процедура ОбработатьОшибкиДанныхДляПодписания(Ошибки, КонтекстДиагностики, ПараметрыВыполнения)
	
	Действие = Перечисления.ДействияПоЭДО.Подписать;
	
	Если Ошибки.ЕстьОшибкаКриптографииПоСообщениямДляПодписания Тогда
		КриптографияБЭД.ДобавитьОшибкуПолученияОтпечатковСертификатов(КонтекстДиагностики,
			ВидОперацииПриДобавленииОшибки(НРег(Действие)), ПараметрыВыполнения.ОтпечаткиСертификатов);
	КонецЕсли;
	
	Если Ошибки.ОтсутствуютДоступныеСертификаты Тогда
		СинхронизацияЭДО.ДобавитьОшибкуОтсутствияСертификатовДляПодписания(КонтекстДиагностики,
			ВидОперацииПриДобавленииОшибки(НРег(Действие)));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ошибки.УчетныеЗаписиБезСертификатов) Тогда
		СинхронизацияЭДО.ДобавитьОшибкуУчетныхЗаписейБезСертификатов(КонтекстДиагностики,
			Ошибки.УчетныеЗаписиБезСертификатов, СинхронизацияЭДО.ОперацииПомощникаРегистрацииСертификатов().Подписание);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ошибки.НедоступныеСообщения) Тогда
		ДобавитьОшибкуДокументыНедоступныДляПодписания(КонтекстДиагностики, Ошибки.НедоступныеСообщения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ошибки.ЗапрещенныеВидыСообщений) Тогда
		Ошибки.ЗапрещенныеВидыДокументов.Свернуть("Сертификат, ВидСообщения");
		Для Каждого СтрокаТаблицы Из Ошибки.ЗапрещенныеВидыСообщений Цикл
			КриптографияБЭД.ДобавитьОшибкуДляСертификатаНетПодписываемогоВидаДокумента(
				КонтекстДиагностики, ВидОперацииПриДобавленииОшибки(НРег(Действие)), СтрокаТаблицы.Сертификат,
				СтрокаТаблицы.ВидСообщения);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОшибкуДокументыНедоступныДляПодписания(КонтекстДиагностики, НаборСообщений)
	
	ПредставлениеДействия = НРег(Перечисления.ДействияПоЭДО.Подписать);
	ВидОперации = ВидОперацииПриДобавленииОшибки(ПредставлениеДействия);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(СообщениеЭДО.ЭлектронныйДокумент) КАК ПредставлениеДокумента
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.Ссылка В (&Ссылки)";
	Запрос.УстановитьПараметр("Ссылки", НаборСообщений);
	
	УстановитьПривилегированныйРежим(Истина);
	ПредставленияДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПредставлениеДокумента");
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(НСтр("ru = 'Документы недоступные для подписания:'"));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСтрок, ПредставленияДокументов);
	ПодробноеПредставление = СтрСоединить(МассивСтрок, Символы.ПС);
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации, ВидОшибкиДокументыНедоступныДляПодписания(),
		ПодробноеПредставление, ПодробноеПредставление);
	ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	
КонецПроцедуры

Функция ВидОшибкиДокументыНедоступныДляПодписания()
	
	ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.НовоеОписаниеВидаОшибки();
	ВидОшибки.Идентификатор = "ДокументыНедоступныеДляПодписания";
	ВидОшибки.ЗаголовокПроблемы = НСтр("ru = 'Документы недоступны для подписания'");
	ВидОшибки.ОписаниеПроблемы = НСтр("ru = 'Некоторые документы недоступны для подписания'");
	
	Возврат ВидОшибки;
	
КонецФункции

Функция ЗаполнитьПодписантовПоСертификату(ПрисоединенныеФайлы, Сертификат, КонтекстДиагностики) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрисоединенныеФайлы.Ссылка КАК Ссылка,
		|	ПрисоединенныеФайлы.ПодписанЭП КАК ПодписанЭП,
		|	ПрисоединенныеФайлы.ПолноеИмяФайла КАК ПолноеИмяФайла,
		|	СообщениеЭДО.Ссылка КАК Сообщение,
		|	ЭлектронныйДокументВходящийЭДО.Организация КАК Организация
		|ИЗ
		|	Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ПО ПрисоединенныеФайлы.ВладелецФайла = СообщениеЭДО.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|		ПО СообщениеЭДО.ЭлектронныйДокумент = ЭлектронныйДокументВходящийЭДО.Ссылка
		|ГДЕ
		|	ПрисоединенныеФайлы.Ссылка В (&ПрисоединенныеФайлы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрисоединенныеФайлы.Ссылка КАК Ссылка,
		|	ПрисоединенныеФайлы.ПодписанЭП КАК ПодписанЭП,
		|	ПрисоединенныеФайлы.ПолноеИмяФайла КАК ПолноеИмяФайла,
		|	СообщениеЭДО.Ссылка КАК Сообщение,
		|	ЭлектронныйДокументИсходящийЭДО.Организация КАК Организация
		|ИЗ
		|	Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ПО ПрисоединенныеФайлы.ВладелецФайла = СообщениеЭДО.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|		ПО СообщениеЭДО.ЭлектронныйДокумент = ЭлектронныйДокументИсходящийЭДО.Ссылка
		|ГДЕ
		|	ПрисоединенныеФайлы.Ссылка В (&ПрисоединенныеФайлы)";
	Запрос.УстановитьПараметр("ПрисоединенныеФайлы", ПрисоединенныеФайлы);
	
	СоздаватьЭлектронныеПодписиНаСервере = ЭлектроннаяПодпись.СоздаватьЭлектронныеПодписиНаСервере();
	
	ДвоичныеДанныеФайлов = РаботаСФайламиБЭД.ДвоичныеДанныеФайлов(ПрисоединенныеФайлы, КонтекстДиагностики);
	
	Результат = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		РезультатЗаполненияФайла = Новый Структура;
		РезультатЗаполненияФайла.Вставить("Отказ", Ложь);
		РезультатЗаполненияФайла.Вставить("АдресДанныхДляОбновления", "");
		РезультатЗаполненияФайла.Вставить("ДанныеДляПодписания");
		
		Результат.Вставить(Выборка.Ссылка, РезультатЗаполненияФайла);
		
		ОписаниеФайла = РаботаСФайламиБЭД.НовоеОписаниеФайла();
		ОписаниеФайла.ДвоичныеДанные = ДвоичныеДанныеФайлов[Выборка.Ссылка];
		ОписаниеФайла.ИмяФайла = Выборка.ПолноеИмяФайла;
		
		СодержаниеДокумента = ФорматыЭДО.ПрочитатьСодержаниеДокумента(ОписаниеФайла);
		
		Если СодержаниеДокумента = Неопределено
			ИЛИ Не ФорматыЭДО.ЗаполнениеДанныхПодписантаДоступно(СодержаниеДокумента) Тогда
			РезультатЗаполненияФайла.Отказ = Истина;
			ДобавитьОшибкуЗаполненияДанныхПодписанта(Выборка.Сообщение, КонтекстДиагностики);
			Продолжить;
		КонецЕсли;
		
		ОписаниеФайла = ФорматыЭДО.ЗаполнитьДанныеПодписантаДокумента(ОписаниеФайла, Выборка.Организация, Сертификат,
			СодержаниеДокумента);
		
		АдресДанных = ПоместитьВоВременноеХранилище(ОписаниеФайла.ДвоичныеДанные, Новый УникальныйИдентификатор);
		
		РезультатЗаполненияФайла.АдресДанныхДляОбновления = АдресДанных;
		РезультатЗаполненияФайла.ДанныеДляПодписания = ?(СоздаватьЭлектронныеПодписиНаСервере,
			АдресДанных, ОписаниеФайла.ДвоичныеДанные);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьОшибкуЗаполненияДанныхПодписанта(Сообщение, КонтекстДиагностики)
	
	ПредставлениеДействия = НРег(Перечисления.ДействияПоЭДО.Подписать);
	ВидОперации = ВидОперацииПриДобавленииОшибки(ПредставлениеДействия);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщениеЭДО.ВидСообщения КАК ВидСообщения,
		|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента,
		|	СообщениеЭДО.ЭлектронныйДокумент.ИдентификаторДокументооборота КАК ИдентификаторДокументооборота,
		|	СообщениеЭДО.ЭлектронныйДокумент.ВидДокумента КАК ВидДокумента,
		|	СообщениеЭДО.ЭлектронныйДокумент.ДатаДокумента КАК ДатаДокумента,
		|	СообщениеЭДО.ЭлектронныйДокумент.НомерДокумента КАК НомерДокумента
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Сообщение);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка.Следующий();
	
	ПредставлениеДокумента = ПредставлениеДокументаПоСвойствам(Выборка);
	
	КраткоеПредставление = СтрШаблон(НСтр("ru = 'Не удалось заполнить подписанта по документу %1'"), ПредставлениеДокумента);
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(КраткоеПредставление);
	МассивСтрок.Добавить(СтрШаблон(НСтр("ru = 'Идентификатор документооборота: %1'"),
		Выборка.ИдентификаторДокументооборота));
	МассивСтрок.Добавить(СтрШаблон(НСтр("ru = 'Тип сообщения: %1'"), Выборка.ТипЭлементаРегламента));
	ПодробноеПредставление = СтрСоединить(МассивСтрок, Символы.ПС);
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации,
		ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
		ПодробноеПредставление, КраткоеПредставление);
	ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	
КонецПроцедуры

Процедура ПодписатьПростойПодписью(ДанныеДляПодписания, РезультатДействий)
	
	Пользователь = Пользователи.ТекущийПользователь();
	ДанныеСотрудникаПоОрганизациям = Новый Соответствие;
	
	Для Каждого ДанныеСообщения Из ДанныеДляПодписания Цикл
		
		Организация = ДанныеСообщения.Организация;
		ДанныеСотрудника = ДанныеСотрудникаПоОрганизациям[Организация];
		Если ДанныеСотрудника = Неопределено Тогда
			ДанныеСотрудника = ИнтеграцияЭДО.СведенияФизЛицаПользователя(Пользователь, Организация);
			ДанныеСотрудникаПоОрганизациям.Вставить(Организация, ДанныеСотрудника);
		КонецЕсли;
		
		УстановитьПростуюПодпись(ДанныеСообщения, Пользователь, ДанныеСотрудника, РезультатДействий);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьПростуюПодпись(ДанныеСообщения, Пользователь, ДанныеСотрудника, РезультатДействий)
	
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("Документ.СообщениеЭДО");
	ЭлементБлокировки.УстановитьЗначение("Ссылка", ДанныеСообщения.Ссылка);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		ДатаПодписи = ТекущаяДатаСеанса();
		
		СообщениеОбъект = ДанныеСообщения.Ссылка.ПолучитьОбъект();
		
		РезультатПодписания = ОбновитьСостояниеСообщенияПриПодписании(СообщениеОбъект, ДатаПодписи, КонтекстДиагностики);
		
		Если Не ЗначениеЗаполнено(РезультатПодписания.СостояниеДокумента) Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		ЗаписатьДанныеПростойПодписи(СообщениеОбъект.ОсновнойФайл, Пользователь, ДанныеСотрудника, ДатаПодписи);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ТекстСообщения = НСтр("ru = 'Ошибка установки простой подписи.'") + Символы.ПС
			+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(НСтр("ru = 'Установка подписи'"),
			ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), ТекстСообщения);
		ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
		ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
		Возврат;
	КонецПопытки;
	
	ПослеПодписания(СообщениеОбъект, РезультатПодписания, РезультатДействий);
	
КонецПроцедуры

Процедура ЗаписатьДанныеПростойПодписи(ПодписанныйОбъект, Пользователь, ДанныеСотрудника, ДатаПодписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*) КАК КоличествоПодписей
		|ИЗ
		|	РегистрСведений.ПростыеЭлектронныеПодписи КАК ПростыеЭлектронныеПодписи
		|ГДЕ
		|	ПростыеЭлектронныеПодписи.ПодписанныйОбъект = &ПодписанныйОбъект";
	
	Запрос.УстановитьПараметр("ПодписанныйОбъект", ПодписанныйОбъект);
	
	ПорядковыйНомер = 1;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПорядковыйНомер = Выборка.КоличествоПодписей + 1;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ПростыеЭлектронныеПодписи.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПодписанныйОбъект = ПодписанныйОбъект;
	МенеджерЗаписи.ПорядковыйНомер = ПорядковыйНомер;
	МенеджерЗаписи.ДатаПодписи = ДатаПодписи;
	МенеджерЗаписи.ВладелецПодписи = ДанныеСотрудника.ИмяПолное;
	МенеджерЗаписи.Должность = ДанныеСотрудника.Должность;
	МенеджерЗаписи.Пользователь = Пользователь;
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПодписатьНаСервере(ДанныеДляПодписания, РезультатДействий)
	
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	
	ПодписанныеДокументы = Новый Массив;
	
	Для Каждого ОписаниеДанных Из ДанныеДляПодписания Цикл
		
		МенеджерКриптографии = КриптографияБЭД.МенеджерКриптографии(,,ОписаниеДанных.Программа);
		
		РезультатПодписания = КриптографияБЭД.Подписать(ОписаниеДанных, КонтекстДиагностики,, МенеджерКриптографии);
		
		Для Каждого ДанныеНабора Из РезультатПодписания.НаборДанных Цикл
			
			СвойстваПодписи = Неопределено;
			Если Не ДанныеНабора.Свойство("СвойстваПодписи", СвойстваПодписи) Тогда
				Продолжить;
			КонецЕсли;
			
			РезультатПроверки = КриптографияБЭД.ПроверитьПодпись(МенеджерКриптографии, ДанныеНабора.Данные,
				СвойстваПодписи.Подпись, КонтекстДиагностики);
			
			СвойстваПодписи.ПодписьВерна = РезультатПроверки.ПодписьВерна;
			СвойстваПодписи.ДатаПроверкиПодписи = РезультатПроверки.ДатаПроверкиПодписи;
			
			ПодписанныеДокументы.Добавить(ДанныеНабора);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ОбработатьПодписанныеСообщения(ПодписанныеДокументы, РезультатДействий);
	
КонецПроцедуры

Функция ВыполнитьДействияПоЭДОПослеПодписания(ПодписанныеСообщения, ПараметрыВыполнения, КонтекстДиагностики, ИтогДействийПоЭДО) Экспорт
	
	РезультатДействий = НовыйРезультатДействийПоЭДО(КонтекстДиагностики);
	РезультатДействий.Итог = ИтогДействийПоЭДО;
	
	ОбработатьПодписанныеСообщения(ПодписанныеСообщения, РезультатДействий);
	
	ВыбранныеСертификаты = Общегоназначения.ВыгрузитьКолонку(ПодписанныеСообщения, "ВыбранныйСертификат", Истина);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрыВыполнения.ВыбранныеСертификаты, ВыбранныеСертификаты, Истина);
	
	ПродолжитьВыполнениеДействийПоЭДО(ПараметрыВыполнения, РезультатДействий);
	
	Возврат РезультатДействий;
	
КонецФункции

Процедура ОбработатьПодписанныеСообщения(ПодписанныеСообщения, РезультатДействий)
	
	Для Каждого ПодписанноеСообщение Из ПодписанныеСообщения Цикл
		
		ОбновитьДанныеПриПодписании(ПодписанноеСообщение, РезультатДействий);
		
	КонецЦикла;
	
КонецПроцедуры

Функция НовоеОписаниеПодписанногоСообщения() Экспорт
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("Ссылка", Документы.СообщениеЭДО.ПустаяСсылка());
	ОписаниеДанных.Вставить("ПрисоединенныйФайл", Справочники.СообщениеЭДОПрисоединенныеФайлы.ПустаяСсылка());
	ОписаниеДанных.Вставить("СвойстваПодписи", Неопределено);
	ОписаниеДанных.Вставить("ВыбранныйСертификат", Неопределено);
	ОписаниеДанных.Вставить("Данные", Неопределено);
	ОписаниеДанных.Вставить("ОбновитьДанные", Ложь);
	Возврат ОписаниеДанных;
КонецФункции

Функция ОбновитьДанныеПриПодписании(ПодписанноеСообщение, РезультатДействий)
	
	Результат = Истина;
	Действие = Перечисления.ДействияПоЭДО.Подписать;
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	АдресДанныхДляОбновления = "";
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Документ.СообщениеЭДО");
	ЭлементБлокировки.УстановитьЗначение("Ссылка", ПодписанноеСообщение.Ссылка);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		
		СообщениеОбъект = ПодписанноеСообщение.Ссылка.ПолучитьОбъект();
		
		РезультатПодписания = ОбновитьСостояниеСообщенияПриПодписании(СообщениеОбъект, ТекущаяДатаСеанса,
			КонтекстДиагностики, ПодписанноеСообщение.ВыбранныйСертификат);
		
		Если Не ЗначениеЗаполнено(РезультатПодписания.СостояниеДокумента) Тогда
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
		
		Если ПодписанноеСообщение.ОбновитьДанные Тогда
			АдресДанныхДляОбновления = ПоместитьВоВременноеХранилище(ПодписанноеСообщение.Данные);
			ИнформацияОФайле = Новый Структура;
			ИнформацияОФайле.Вставить("АдресФайлаВоВременномХранилище", АдресДанныхДляОбновления);
			ИнформацияОФайле.Вставить("АдресВременногоХранилищаТекста", "");
			РаботаСФайлами.ОбновитьФайл(ПодписанноеСообщение.ПрисоединенныйФайл, ИнформацияОФайле);
		КонецЕсли;
		
		ЭлектроннаяПодпись.ДобавитьПодпись(ПодписанноеСообщение.ПрисоединенныйФайл, ПодписанноеСообщение.СвойстваПодписи);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		Результат = Ложь;
		ДобавитьОшибкуВыполненияДействияПоСообщению(ПодписанноеСообщение.Ссылка, Действие,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), КонтекстДиагностики);
	КонецПопытки;
	
	Если ЗначениеЗаполнено(АдресДанныхДляОбновления) Тогда
		УдалитьИзВременногоХранилища(АдресДанныхДляОбновления);
	КонецЕсли;
	
	Если Результат Тогда
		ПослеПодписания(СообщениеОбъект, РезультатПодписания, РезультатДействий);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбновитьСостояниеСообщенияПриПодписании(СообщениеОбъект, ДатаИзменения, КонтекстДиагностики, ВыбранныйСертификат = Неопределено)
	
	Результат = Новый Структура;
	Результат.Вставить("СостояниеДокумента", Перечисления.СостоянияДокументовЭДО.ПустаяСсылка());
	Результат.Вставить("ТаблицаПодписания", Неопределено);
	
	Действие = Перечисления.ДействияПоЭДО.Подписать;
	
	Если СообщениеОбъект.Состояние <> Перечисления.СостоянияСообщенийЭДО.Подписание Тогда
		ДобавитьОшибкуСостоянияСообщенияПриПодписании(Действие, СообщениеОбъект, КонтекстДиагностики);
		Возврат Результат;
	КонецЕсли;
	
	Если ВыбранныйСертификат = Неопределено Тогда
		ВыбранныйСертификат = КриптографияБЭД.ПустойСертификат();
	КонецЕсли;
	
	ОписанияЗапросов = Новый Массив;
	Отбор = МаршрутыПодписанияБЭД.НовыйОтборПроверкиТекущегоОбъектаДляПодписания();
	Отбор.Объект = "&Сообщение";
	ОписанияЗапросов.Добавить(МаршрутыПодписанияБЭД.ЗапросПроверкиТекущегоОбъектаДляПодписания(Отбор));
	
	ЭтоВходящийЭДО = ЭтоВходящийЭДО(СообщениеОбъект.ЭлектронныйДокумент);
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаПараметровОбновленияСостоянияДокумента(ЭтоВходящийЭДО));
	ТекстыЗапросов.Добавить(ТекстЗапросаКомментарияКСостояниюДокумента());
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Запрос = ОбщегоНазначенияБЭД.СоединитьЗапросы(Запрос, ОписанияЗапросов);
	Запрос.УстановитьПараметр("Сообщение", СообщениеОбъект.Ссылка);
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", СообщениеОбъект.ЭлектронныйДокумент);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатыЗапроса[0].Пустой() Тогда
		ДобавитьОшибкуМаршрутаПриПодписании(Действие, СообщениеОбъект, КонтекстДиагностики);
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыДокумента = РезультатыЗапроса[1].Выбрать();
	ПараметрыДокумента.Следующий();
	СостоянияСообщений = РезультатыЗапроса[2].Выгрузить();
	
	ПараметрыМаршрута = ОбновитьМаршрутПодписания(СообщениеОбъект, ВыбранныйСертификат);
	Результат.ТаблицаПодписания = ПараметрыМаршрута.ТаблицаПодписания;
	
	СообщениеОбъект.Статус = ?(МаршрутыПодписанияБЭД.ПодписаниеЗавершено(ПараметрыМаршрута.ТаблицаПодписания),
		Перечисления.СтатусыСообщенийЭДО.Подписан, Перечисления.СтатусыСообщенийЭДО.ЧастичноПодписан);
	
	СообщениеОбъект.ДатаИзмененияСтатуса = ДатаИзменения;
	СообщениеОбъект.Состояние = РегламентыЭДО.СостояниеСообщения(СообщениеОбъект, ПараметрыДокумента);
	СообщениеОбъект.Записать();
	
	НайденнаяСтрока = СостоянияСообщений.Найти(СообщениеОбъект.Ссылка, "Ссылка");
	НайденнаяСтрока.Состояние = СообщениеОбъект.Состояние;
	
	ДополненияСостоянийЭДО = ДополненияСостоянийЭДОПриПодписании(СообщениеОбъект, ПараметрыДокумента.ВидПодписи,
		ПараметрыМаршрута.ВесМаршрута);
	
	Комментарий = КомментарийКСостояниюДокумента(РезультатыЗапроса[3]);
	
	Результат.СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(ПараметрыДокумента, СостоянияСообщений,
		СообщениеОбъект.ДатаИзмененияСтатуса, КонтекстДиагностики, ДополненияСостоянийЭДО, Комментарий);
	
	ЗаписатьДействиеВЖурнал(Действие, ПараметрыДокумента, Результат.СостояниеДокумента, 
		СообщениеОбъект.ДатаИзмененияСтатуса, СообщениеОбъект);
	
	Возврат Результат;
	
КонецФункции

Функция КонтекстИнтерактивногоПодписания(ДанныеДляПодписания, ПараметрыВыполнения, ИтогДействийПоЭДО)
	Контекст = Новый Структура;
	Контекст.Вставить("АдресКонтекстаНаСервере", "");
	Контекст.Вставить("ДанныеДляПодписания", ДанныеДляПодписания);
	Контекст.Вставить("КонтекстНаСервере", Новый Структура);
	Контекст.КонтекстНаСервере.Вставить("ПараметрыВыполнения", ПараметрыВыполнения);
	Контекст.КонтекстНаСервере.Вставить("ИтогДействийПоЭДО", ИтогДействийПоЭДО);
	Контекст.КонтекстНаСервере.Вставить("АдресаДанныхДляОчистки", Новый Массив);
	Возврат Контекст;
КонецФункции

Процедура ПоместитьДанныеДляПодписанияВХранилище(КонтекстПодписания)
	
	СоздаватьЭлектронныеПодписиНаСервере = ЭлектроннаяПодпись.СоздаватьЭлектронныеПодписиНаСервере();
	
	АдресаДанныхДляОчистки = КонтекстПодписания.КонтекстНаСервере.АдресаДанныхДляОчистки;
	
	Для Каждого ОписаниеДанных Из КонтекстПодписания.ДанныеДляПодписания Цикл
		
		Для Каждого ДанныеСообщения Из ОписаниеДанных.НаборДанных Цикл
			
			Если ДанныеСообщения.Данные = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			АдресДанных = "";
			
			Если ДанныеСообщения.ДанныеИзменены Тогда
				АдресДанных = ПоместитьВоВременноеХранилище(ДанныеСообщения.Данные, Новый УникальныйИдентификатор);
				ДанныеСообщения.АдресДанныхДляОбновления = АдресДанных;
			КонецЕсли;
			
			Если СоздаватьЭлектронныеПодписиНаСервере Тогда
				Если ПустаяСтрока(АдресДанных) Тогда
					АдресДанных = ПоместитьВоВременноеХранилище(ДанныеСообщения.Данные, Новый УникальныйИдентификатор);
					АдресаДанныхДляОчистки.Добавить(АдресДанных);
				КонецЕсли;
				ДанныеСообщения.Данные = АдресДанных;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьОшибкуСостоянияСообщенияПриПодписании(Действие, СообщениеОбъект, КонтекстДиагностики)
	ПредставлениеДействия = НРег(Действие);
	ВидОперации = ВидОперацииПриДобавленииОшибки(ПредставлениеДействия);
	КраткоеПредставлениеОшибки = НСтр("ru = 'Состояние документа изменено в процессе подписания.'");
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(КраткоеПредставлениеОшибки);
	МассивСтрок.Добавить(СтрШаблон(НСтр("ru = 'Документ: %1'"), СообщениеОбъект.Ссылка));
	МассивСтрок.Добавить(СтрШаблон(НСтр("ru = 'Состояние: %1'"), СообщениеОбъект.Состояние));
	ПодробноеПредставлениеОшибки = СтрСоединить(МассивСтрок, Символы.ПС);
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации,
		ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
		ПодробноеПредставлениеОшибки, КраткоеПредставлениеОшибки);
	ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
КонецПроцедуры

Процедура ДобавитьОшибкуМаршрутаПриПодписании(Действие, СообщениеОбъект, КонтекстДиагностики)
	ПредставлениеДействия = НРег(Действие);
	ВидОперации = ВидОперацииПриДобавленииОшибки(ПредставлениеДействия);
	КраткоеПредставлениеОшибки = НСтр("ru = 'Маршрут изменен в процессе подписания.'");
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(КраткоеПредставлениеОшибки);
	МассивСтрок.Добавить(СтрШаблон(НСтр("ru = 'Документ: %1'"), СообщениеОбъект.Ссылка));
	ПодробноеПредставлениеОшибки = СтрСоединить(МассивСтрок, Символы.ПС);
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации,
		ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
		ПодробноеПредставлениеОшибки, КраткоеПредставлениеОшибки);
	ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
КонецПроцедуры

Процедура ПослеПодписания(СообщениеОбъект, РезультатПодписания, РезультатДействий)
	
	ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Перечисления.ДействияПоЭДО.Подписать,
		СообщениеОбъект.ЭлектронныйДокумент);
	
	ОповеститьОДокументеКПодписанию(СообщениеОбъект, РезультатПодписания.ТаблицаПодписания);
	
	Если СообщениеОбъект.Статус = Перечисления.СтатусыСообщенийЭДО.Подписан
		И (СообщениеОбъект.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя
			ИЛИ СообщениеОбъект.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя) Тогда
		ЭлектронныеДокументыЭДОСобытия.ПослеПодписанияЭлектронногоДокумента(СообщениеОбъект.ЭлектронныйДокумент,
			РезультатДействий.КонтекстДиагностики);
	КонецЕсли;
	
	Если РезультатПодписания.СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОбменЗавершен
		ИЛИ РезультатПодписания.СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОбменЗавершенСИсправлением Тогда
		ЭлектронныеДокументыЭДОСобытия.ПослеЗавершенияОбменаЭлектроннымДокументом(СообщениеОбъект.ЭлектронныйДокумент,
			РезультатДействий.КонтекстДиагностики);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПодготовитьКОтправке

Процедура ВыполнитьДействиеПодготовитьКОтправке(ПараметрыВыполнения, РезультатДействий)
	
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	
	Если ЗначениеЗаполнено(ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов) Тогда
		
		Для Каждого ПакетДокументов Из ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов Цикл
			ПодготовитьКОтправкеДокументыПакета(ПакетДокументов, РезультатДействий);
		КонецЦикла;
		
	Иначе
		
		СообщенияДляОбработки = Новый Соответствие;
		
		Отбор = НовыйОтборСообщенийДляОбработкиДействия();
		Отбор.Состояние.Добавить(Перечисления.СостоянияСообщенийЭДО.ПодготовкаКОтправке);
		ВыборкаСообщений = ВыборкаСообщенийДляОбработкиДействия(ПараметрыВыполнения.ОбъектыДействий, Отбор);
		Пока ВыборкаСообщений.Следующий() Цикл
			СообщенияДляОбработки.Вставить(ВыборкаСообщений.Ссылка, Ложь);
		КонецЦикла;
		
		Для Каждого СообщениеОбработано Из СообщенияДляОбработки Цикл
			Если СообщениеОбработано.Значение Тогда
				Продолжить;
			КонецЕсли;
			ОбработанныеСообщения = Новый Массив;
			Результат = ПодготовитьКОтправкеДокумент(СообщениеОбработано.Ключ, КонтекстДиагностики, СообщенияДляОбработки,
				ОбработанныеСообщения);
			Если Не Результат Тогда
				Продолжить;
			КонецЕсли;
			Для Каждого СообщениеОбъект Из ОбработанныеСообщения Цикл
				СообщенияДляОбработки.Вставить(СообщениеОбъект.Ссылка, Истина);
				ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Перечисления.ДействияПоЭДО.ПодготовитьКОтправке,
					СообщениеОбъект.ЭлектронныйДокумент);
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПодготовитьКОтправкеДокумент(Сообщение, КонтекстДиагностики, СообщенияДляОбработки, ОбработанныеСообщения, ИдентификаторПакета = Неопределено)
	
	Результат = Ложь;
	
	Действие = Перечисления.ДействияПоЭДО.ПодготовитьКОтправке;
	
	НачатьТранзакцию();
	Попытка
		
		СообщениеОбъект = ОбщегоНазначенияБЭД.ОбъектПоСсылкеДляИзменения(Сообщение);
		Если СообщениеОбъект.Состояние <> Перечисления.СостоянияСообщенийЭДО.ПодготовкаКОтправке Тогда
			ЗафиксироватьТранзакцию();
			Возврат Результат;
		КонецЕсли;
		
		ЭтоВходящийЭДО = ЭтоВходящийЭДО(СообщениеОбъект.ЭлектронныйДокумент);
		
		ТребуетсяПоискПакета = Не ЭтоВходящийЭДО
			И СообщениеОбъект.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя
			И ИдентификаторПакета = Неопределено;
		
		Блокировка = Новый БлокировкаДанных;
	
		ЭлементБлокировки = Блокировка.Добавить("Документ.СообщениеЭДО");
		ЭлементБлокировки.УстановитьЗначение("ЭлектронныйДокумент", СообщениеОбъект.ЭлектронныйДокумент);
		
		ЭлементБлокировки = Блокировка.Добавить(ИмяТаблицыДокументаЭДО(ЭтоВходящийЭДО));
		ЭлементБлокировки.УстановитьЗначение("Ссылка", СообщениеОбъект.ЭлектронныйДокумент);
		
		Запрос = Новый Запрос;
		ТекстыЗапроса = Новый Массив;
		ТекстыЗапроса.Добавить(ТекстЗапросаДанныхДляПодготовкиКОтправке(ЭтоВходящийЭДО));
		Запрос.УстановитьПараметр("Сообщение", Сообщение);
		ТекстыЗапроса.Добавить(ТекстЗапросаКомментарияКСостояниюДокумента());
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", СообщениеОбъект.ЭлектронныйДокумент);
		
		Если ТребуетсяПоискПакета Тогда
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СоставПакетовДокументовЭДО");
			ЭлементБлокировки.УстановитьЗначение("ЭлектронныйДокумент", СообщениеОбъект.ЭлектронныйДокумент);
			ТекстыЗапроса.Добавить(ТекстЗапросаИдентификатораПакетаДокумента());
		КонецЕсли;
		
		Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
		
		Блокировка.Заблокировать();
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		Если РезультатыЗапроса[1].Пустой()
			ИЛИ РезультатыЗапроса[2].Пустой()
			ИЛИ РезультатыЗапроса[3].Пустой()
			ИЛИ РезультатыЗапроса[4].Пустой() Тогда
			ОтменитьТранзакцию();
			Возврат Результат;
		КонецЕсли;
		
		Если ТребуетсяПоискПакета И Не РезультатыЗапроса[7].Пустой() Тогда
			ВыборкаПакетов = РезультатыЗапроса[7].Выбрать();
			ВыборкаПакетов.Следующий();
			ИдентификаторПакета = ВыборкаПакетов.ИдентификаторПакета;
			Подготовлены = ПодготовитьСообщенияПакетаКОтправке(ИдентификаторПакета, Сообщение,
				СообщенияДляОбработки, ОбработанныеСообщения, КонтекстДиагностики);
			Если Не Подготовлены Тогда
				ОтменитьТранзакцию();
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
		
		СвойстваДокумента = РезультатыЗапроса[1].Выбрать();
		СвойстваДокумента.Следующий();
		ТипыСообщений = РезультатыЗапроса[2].Выбрать();
		ТипыСообщений.Следующий();
		ФайлыСообщения = РезультатыЗапроса[3].Выгрузить();
		СостоянияСообщений = РезультатыЗапроса[4].Выгрузить();
		ИдентификаторыОснований = РезультатыЗапроса[5].Выгрузить();
		
		ДанныеОбъектов = СинхронизацияЭДО.НовыеДанныеОбъектов();
		ДанныеОбъекта = СинхронизацияЭДО.ДобавитьДанныеОбъекта(ДанныеОбъектов);
		
		ЗаполнитьДанныеОбъектаДляПодготовкиКОтправке(ДанныеОбъекта, СвойстваДокумента, СообщениеОбъект,
			ТипыСообщений.ТипСообщения, ФайлыСообщения, ИдентификаторыОснований, КонтекстДиагностики);
		
		Если ДанныеОбъекта.Отказ Тогда
			ОтменитьТранзакцию();
			Возврат Результат;
		КонецЕсли;
		
		РезультатПодготовки = СинхронизацияЭДО.ПодготовитьОбъектыКОтправке(ДанныеОбъектов, КонтекстДиагностики);
		
		ПричинаОстановки = Перечисления.ПричиныОстановкиЭДО.ПустаяСсылка();
		
		Если РезультатПодготовки.Отказ Тогда
			Если ДанныеОбъекта.ТипОшибкиОтправки = СинхронизацияЭДО.ТипыОшибокОтправки().ОжидаетсяОтветНаПриглашение Тогда
				ПричинаОстановки = Перечисления.ПричиныОстановкиЭДО.ОжидаетсяОтветНаПриглашение;
			Иначе
				ОтменитьТранзакцию();
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
		
		Комментарий = КомментарийКСостояниюДокумента(РезультатыЗапроса[6]);
		
		Если ЗначениеЗаполнено(ПричинаОстановки) Тогда
			ОстановитьДокументПриПодготовкиКОтправке(СообщениеОбъект, ПричинаОстановки, СостоянияСообщений,
				КонтекстДиагностики, Комментарий);
		Иначе
			ОтметитьПодготовкуСообщенияКОтправке(СообщениеОбъект, СвойстваДокумента, СостоянияСообщений,
				КонтекстДиагностики, Комментарий);
		КонецЕсли;
		
		ОбработанныеСообщения.Добавить(СообщениеОбъект);
		
		Результат = Истина;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоСообщению(Сообщение, Действие, ТекстОшибки, КонтекстДиагностики);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Процедура ПодготовитьКОтправкеДокументыПакета(ПакетДокументов, РезультатДействий)
	
	Действие = Перечисления.ДействияПоЭДО.ПодготовитьКОтправке;
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	ДокументыПакета = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		ЗаблокироватьПакетДокументовДляИзменения(ПакетДокументов);
		
		ДокументыПакета = ДокументыПакета(ПакетДокументов);
		
		ЗаблокироватьСообщенияПакетаДляИзменения(ДокументыПакета);
		
		ЭтоВходящийЭДО = ЭтоВходящийЭДО(ДокументыПакета[0]);
		
		ТекстыЗапроса = Новый Массив;
		ТекстыЗапроса.Добавить(ТекстЗапросаДанныхДляПодготовкиКОтправке(ЭтоВходящийЭДО, Истина));
		ТекстыЗапроса.Добавить(ТекстЗапросаСостоянийДокументов());
		Запрос = Новый Запрос;
		Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
		Запрос.УстановитьПараметр("ЭлектронныеДокументы", ДокументыПакета);
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		Если РезультатыЗапроса[1].Пустой()
			ИЛИ РезультатыЗапроса[2].Пустой()
			ИЛИ РезультатыЗапроса[3].Пустой()
			ИЛИ РезультатыЗапроса[4].Пустой()
			ИЛИ РезультатыЗапроса[6].Пустой() Тогда
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		
		СостоянияДокументов = РезультатыЗапроса[6].Выгрузить();
		
		НаборСостояний = СостоянияДокументов.ВыгрузитьКолонку("Состояние");
		СостоянияОднородны = СостоянияДокументовПакетаОднородны(НаборСостояний, ПакетДокументов, 
			Действие, КонтекстДиагностики);
		Если Не СостоянияОднородны Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		СвойстваДокументаСообщения = РезультатыЗапроса[1].Выбрать();
		ТипыСообщений = РезультатыЗапроса[2].Выгрузить();
		ФайлыСообщений = РезультатыЗапроса[3].Выгрузить();
		ИдентификаторыОснованийДокументов = РезультатыЗапроса[5].Выгрузить();
		
		СоотоянияСообщенийДокументов = Новый Соответствие;
		ВыборкаСостоянийСообщений = РезультатыЗапроса[4].Выбрать();
		Пока ВыборкаСостоянийСообщений.Следующий() Цикл
			СостоянияСообщений = СоотоянияСообщенийДокументов[ВыборкаСостоянийСообщений.ЭлектронныйДокумент];
			Если СостоянияСообщений = Неопределено Тогда
				СостоянияСообщений = РегламентыЭДО.НовыеСостоянияЭлементовРегламента();
				СостоянияСообщений.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.СообщениеЭДО"));
				СоотоянияСообщенийДокументов.Вставить(ВыборкаСостоянийСообщений.ЭлектронныйДокумент, СостоянияСообщений);
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СостоянияСообщений.Добавить(), ВыборкаСостоянийСообщений);
		КонецЦикла;
		
		РезультатПодготовки = Неопределено;
		ПричинаОстановки = Перечисления.ПричиныОстановкиЭДО.ПустаяСсылка();
		
		ДанныеОсновныхОбъектов = СинхронизацияЭДО.НовыеДанныеОбъектов();
		
		ОбъектыСообщений = Новый Соответствие();
		
		Пока СвойстваДокументаСообщения.Следующий() Цикл
			
			СообщениеОбъект = СвойстваДокументаСообщения.Сообщение.ПолучитьОбъект();
			Если СообщениеОбъект.Состояние <> Перечисления.СостоянияСообщенийЭДО.ПодготовкаКОтправке Тогда
				Продолжить;
			КонецЕсли;
			
			ОбъектыСообщений.Вставить(СвойстваДокументаСообщения.Сообщение, СообщениеОбъект);
			
			Если ЗначениеЗаполнено(ПричинаОстановки) Тогда
				Продолжить;
			КонецЕсли;
			
			ЭтоОсновнойОбъект = Не ЭтоВходящийЭДО
				И СообщениеОбъект.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя;
			ДанныеОбъектов = ?(ЭтоОсновнойОбъект, ДанныеОсновныхОбъектов, СинхронизацияЭДО.НовыеДанныеОбъектов());
			ДанныеОбъекта = СинхронизацияЭДО.ДобавитьДанныеОбъекта(ДанныеОбъектов);
			
			Отбор = Новый Структура("Сообщение", СообщениеОбъект.Ссылка);
			ФайлыСообщения = ФайлыСообщений.НайтиСтроки(Отбор);
			
			ТипСообщения = ТипыСообщений.Найти(СообщениеОбъект.Ссылка, "Сообщение").ТипСообщения;
			
			Отбор = Новый Структура("ЭлектронныйДокумент", СообщениеОбъект.ЭлектронныйДокумент);
			ИдентификаторыОснований = ИдентификаторыОснованийДокументов.НайтиСтроки(Отбор);
			
			ЗаполнитьДанныеОбъектаДляПодготовкиКОтправке(ДанныеОбъекта, СвойстваДокументаСообщения, СообщениеОбъект,
				ТипСообщения, ФайлыСообщения, ИдентификаторыОснований, КонтекстДиагностики);
			
			Если ДанныеОбъекта.Отказ Тогда
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			
			Если ЭтоОсновнойОбъект Тогда
				Продолжить;
			КонецЕсли;
			
			РезультатПодготовки = СинхронизацияЭДО.ПодготовитьОбъектыКОтправке(ДанныеОбъектов, КонтекстДиагностики);
			
			Если РезультатПодготовки.Отказ Тогда
				ПричинаОстановки = ПричинаОстановкиПодготовкиОбъектаКОтправке(ДанныеОбъектов);
				Если Не ЗначениеЗаполнено(ПричинаОстановки) Тогда
					ОтменитьТранзакцию();
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(ПричинаОстановки)
			И ЗначениеЗаполнено(ДанныеОсновныхОбъектов) Тогда
			
			НеподходящиеДокументы = Новый Массив;
			СвойстваСообщений = СвойстваОсновныхСообщенийДокументовПакета(ДокументыПакета);
			Если Не ПроверитьСостоянияОсновныхСообщенийПакета(СвойстваСообщений, НеподходящиеДокументы) Тогда
				Если Не ЕстьДействияПоДокументамПакета(РезультатДействий.ОбработанныеДокументы, ДокументыПакета) Тогда
					ДобавитьОшибкуОжиданияДругихДокументовПакета(ПакетДокументов, НеподходящиеДокументы, КонтекстДиагностики);
				КонецЕсли;
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			
			РезультатПодготовки = СинхронизацияЭДО.ПодготовитьОбъектыКОтправке(ДанныеОсновныхОбъектов, КонтекстДиагностики);
			
			Если РезультатПодготовки.Отказ Тогда
				ПричинаОстановки = ПричинаОстановкиПодготовкиОбъектаКОтправке(ДанныеОсновныхОбъектов);
				Если Не ЗначениеЗаполнено(ПричинаОстановки) Тогда
					ОтменитьТранзакцию();
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		СвойстваДокументаСообщения.Сбросить();
		
		Пока СвойстваДокументаСообщения.Следующий() Цикл
			
			СообщениеОбъект = ОбъектыСообщений[СвойстваДокументаСообщения.Сообщение];
			Если СообщениеОбъект = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СостоянияСообщений = СоотоянияСообщенийДокументов[СообщениеОбъект.ЭлектронныйДокумент];
			Если СостоянияСообщений = Неопределено Тогда
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			
			Комментарий = "";
			ПараметрыСостояния = СостоянияДокументов.Найти(СообщениеОбъект.ЭлектронныйДокумент, "ЭлектронныйДокумент");
			Если ПараметрыСостояния <> Неопределено Тогда
				Комментарий = ПараметрыСостояния.Комментарий;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПричинаОстановки) Тогда
				ОстановитьДокументПриПодготовкиКОтправке(СообщениеОбъект, ПричинаОстановки, СостоянияСообщений,
					КонтекстДиагностики, Комментарий);
			Иначе
				ОтметитьПодготовкуСообщенияКОтправке(СообщениеОбъект, СвойстваДокументаСообщения, СостоянияСообщений,
					КонтекстДиагностики, Комментарий);
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоПакету(ПакетДокументов, Действие, ТекстОшибки, КонтекстДиагностики);
		Возврат;
	КонецПопытки;
	
	Для Каждого ЭлектронныйДокумент Из ДокументыПакета Цикл
		ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Действие, ЭлектронныйДокумент);
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаДанныхДляПодготовкиКОтправке(ЭтоВходящийЭДО, ОтборПоДокументамПакета = Ложь)
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Ссылка,
		|	СообщениеЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
		|	СообщениеЭДО.ВидСообщения КАК ВидСообщения,
		|	СообщениеЭДО.ОсновнойФайл КАК ОсновнойФайл
		|ПОМЕСТИТЬ СообщенияДляОтправки
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенийЭДО.ПодготовкаКОтправке)
		|	И &УсловиеОтбора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Сообщение,
		|	ДокументЭДО.Ссылка КАК Ссылка,
		|	ДокументЭДО.ИдентификаторДокументооборота КАК ИдентификаторДокументооборота,
		|	ДокументЭДО.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
		|	ДокументЭДО.ИдентификаторКонтрагента КАК ИдентификаторКонтрагента,
		|	ДокументЭДО.ИдентификаторСвязи КАК ИдентификаторСвязи,
		|	ДокументЭДО.Организация КАК Организация,
		|	ДокументЭДО.Контрагент КАК Контрагент,
		|	ДокументЭДО.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ДокументЭДО.СпособОбмена КАК СпособОбмена,
		|	ДокументЭДО.ТипРегламента КАК ТипРегламента,
		|	ДокументЭДО.ТребуетсяИзвещение КАК ТребуетсяИзвещение,
		|	ДокументЭДО.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
		|	ДокументЭДО.ОбменБезПодписи КАК ОбменБезПодписи,
		|	ДокументЭДО.Остановлен КАК Остановлен,
		|	ДокументЭДО.ПричинаОстановки КАК ПричинаОстановки,
		|	ДокументЭДО.Исправлен КАК Исправлен,
		|	ДокументЭДО.ВидДокумента КАК ВидДокумента,
		|	ДокументЭДО.НомерДокумента КАК НомерДокумента,
		|	ДокументЭДО.ДатаДокумента КАК ДатаДокумента,
		|	ДокументЭДО.СуммаДокумента КАК СуммаДокумента,
		|	ДокументЭДО.СодержитМаркируемыеТовары КАК СодержитМаркируемыеТовары,
		|	ДокументЭДО.Ответственный КАК Ответственный
		|ИЗ
		|	СообщенияДляОтправки КАК СообщениеЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИмяТаблицыДокументаЭДО КАК ДокументЭДО
		|		ПО СообщениеЭДО.ЭлектронныйДокумент = ДокументЭДО.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Сообщение,
		|	ВидыДокументовЭДО.ТипДокумента КАК ТипСообщения
		|ИЗ
		|	СообщенияДляОтправки КАК СообщениеЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|		ПО СообщениеЭДО.ВидСообщения = ВидыДокументовЭДО.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Сообщение,
		|	СообщениеЭДО.ОсновнойФайл = ПрисоединенныеФайлы.Ссылка КАК ЭтоОсновнойФайл,
		|	ПрисоединенныеФайлы.Ссылка КАК Ссылка,
		|	ПрисоединенныеФайлы.ПолноеИмяФайла КАК ПолноеИмяФайла,
		|	ПрисоединенныеФайлы.Расширение КАК Расширение,
		|	ПрисоединенныеФайлы.ДатаСоздания КАК ДатаСоздания
		|ИЗ
		|	СообщенияДляОтправки КАК СообщениеЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|		ПО СообщениеЭДО.Ссылка = ПрисоединенныеФайлы.ВладелецФайла
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Ссылка,
		|	СообщениеЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
		|	СообщениеЭДО.Состояние КАК Состояние,
		|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент В
		|		(ВЫБРАТЬ
		|			ЭлектронныйДокумент
		|		ИЗ
		|			СообщенияДляОтправки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СообщенияДляОтправки.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
		|	ИдентификаторыОснованийДокументаЭДО.ИдентификаторСвязи,
		|	ИдентификаторыОснованийДокументаЭДО.ИдентификаторДокументооборота
		|ИЗ
		|	СообщенияДляОтправки КАК СообщенияДляОтправки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументИсходящийЭДО.ИдентификаторыОснований КАК ИдентификаторыОснованийДокументаЭДО
		|		ПО СообщенияДляОтправки.ЭлектронныйДокумент = ИдентификаторыОснованийДокументаЭДО.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументИсходящийЭДО КАК ДокументЭДО
		|		ПО ИдентификаторыОснованийДокументаЭДО.ИдентификаторДокументооборота = ДокументЭДО.ИдентификаторДокументооборота
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ПО ДокументЭДО.Ссылка = СообщениеЭДО.ЭлектронныйДокумент
		|		И СообщениеЭДО.ТипЭлементаРегламента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя)
		|		И СообщениеЭДО.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыСообщенийЭДО.Отправлен),
		|			ЗНАЧЕНИЕ(Перечисление.СтатусыСообщенийЭДО.Подтвержден))";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбора", ?(ОтборПоДокументамПакета,
		"СообщениеЭДО.ЭлектронныйДокумент В (&ЭлектронныеДокументы)",
		"СообщениеЭДО.Ссылка = &Сообщение"));
	
	ИмяТаблицыДокументаЭДО = ИмяТаблицыДокументаЭДО(ЭтоВходящийЭДО);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяТаблицыДокументаЭДО", ИмяТаблицыДокументаЭДО);
	Возврат ТекстЗапроса;
КонецФункции

Функция ПодготовитьСообщенияПакетаКОтправке(ИдентификаторПакета, ТекущееСообщение, СообщенияДляОбработки, ОбработанныеСообщения, КонтекстДиагностики)
	
	ЗаблокироватьПакетДокументовДляИзменения(ИдентификаторПакета);
	
	СвойстваСообщений = СвойстваОсновныхСообщенийПакетаДляПодготовкиКОтправке(ИдентификаторПакета);
	
	Если Не СообщенияПакетаПереданыДляОбработки(СвойстваСообщений, СообщенияДляОбработки)
		ИЛИ Не ПроверитьСостоянияОсновныхСообщенийПакета(СвойстваСообщений) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого СвойстваСообщения Из СвойстваСообщений Цикл
		
		Если СвойстваСообщения.Ссылка = ТекущееСообщение Тогда
			Продолжить;
		КонецЕсли;
		
		Подготовлен = ПодготовитьКОтправкеДокумент(СвойстваСообщения.Ссылка, КонтекстДиагностики,
			СообщенияДляОбработки, ОбработанныеСообщения, ИдентификаторПакета);
		
		Если Не Подготовлен Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция СвойстваОсновныхСообщенийПакетаДляПодготовкиКОтправке(ИдентификаторПакета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Ссылка,
		|	СообщениеЭДО.Состояние КАК Состояние,
		|	СообщениеЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставПакетовДокументовЭДО КАК СоставПакетовДокументовЭДО
		|		ПО СообщениеЭДО.ЭлектронныйДокумент = СоставПакетовДокументовЭДО.ЭлектронныйДокумент
		|		И СоставПакетовДокументовЭДО.ИдентификаторПакета = &ИдентификаторПакета
		|		И СообщениеЭДО.ТипЭлементаРегламента = &ТипЭлементаРегламента";
	Запрос.УстановитьПараметр("ИдентификаторПакета", ИдентификаторПакета);
	Запрос.УстановитьПараметр("ТипЭлементаРегламента", Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПроверитьСостоянияОсновныхСообщенийПакета(СвойстваСообщений, НеподходящиеДокументы = Неопределено)
	
	Если НеподходящиеДокументы = Неопределено Тогда
		НеподходящиеДокументы = Новый Массив;
	КонецЕсли;
	
	Для Каждого СвойстваСообщения Из СвойстваСообщений Цикл
		Если СвойстваСообщения.Состояние <> Перечисления.СостоянияСообщенийЭДО.ПодготовкаКОтправке Тогда
			НеподходящиеДокументы.Добавить(СвойстваСообщения.ЭлектронныйДокумент);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НеподходящиеДокументы) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СообщенияПакетаПереданыДляОбработки(СвойстваСообщений, СообщенияДляОбработки)
	
	Результат = Истина;
	
	Для Каждого СвойстваСообщения Из СвойстваСообщений Цикл
		Если СообщенияДляОбработки[СвойстваСообщения.Ссылка] = Неопределено Тогда
			Результат = Ложь;
		Иначе
			СообщенияДляОбработки[СвойстваСообщения.Ссылка] = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьДанныеОбъектаДляПодготовкиКОтправке(ДанныеОбъекта, СвойстваДокумента, СвойстваСообщения, ТипСообщения, ФайлыСообщения, ИдентификаторыОснований, КонтекстДиагностики)
	
	Для Каждого СвойстваФайла Из ФайлыСообщения Цикл
		Если СвойстваФайла.ЭтоОсновнойФайл Тогда
			ДанныеОбъекта.ДатаСоздания = СвойстваФайла.ДатаСоздания;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ДанныеОбъекта.ДатаСоздания) Тогда
		ДанныеОбъекта.Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ДанныеОбъекта.Объект = СвойстваСообщения.Ссылка;
	ДанныеОбъекта.ТипДокумента = ТипСообщения;
	ДанныеОбъекта.ТипЭлементаРегламента = СвойстваСообщения.ТипЭлементаРегламента;
	ДанныеОбъекта.СопроводительнаяЗаписка = СвойстваСообщения.ДополнительнаяИнформация;
	ДанныеОбъекта.ЭтоОтветнаяПодпись = СвойстваСообщения.Направление = Перечисления.НаправленияЭДО.Входящий;
	
	ДанныеОбъекта.Представление = ПредставлениеДокументаПоСвойствам(СвойстваДокумента);
	ДанныеОбъекта.ИдентификаторДокументооборота = СвойстваДокумента.ИдентификаторДокументооборота;
	ДанныеОбъекта.ИдентификаторСообщения = СвойстваДокумента.ИдентификаторСвязи;
	ДанныеОбъекта.ИдентификаторОтправителя = СвойстваДокумента.ИдентификаторОрганизации;
	ДанныеОбъекта.ИдентификаторПолучателя = СвойстваДокумента.ИдентификаторКонтрагента;
	ДанныеОбъекта.Организация = СвойстваДокумента.Организация;
	ДанныеОбъекта.Контрагент = СвойстваДокумента.Контрагент;
	ДанныеОбъекта.ДоговорКонтрагента = СвойстваДокумента.ДоговорКонтрагента;
	ДанныеОбъекта.ВидДокумента = СвойстваДокумента.ВидДокумента;
	ДанныеОбъекта.ТипРегламента = СвойстваДокумента.ТипРегламента;
	ДанныеОбъекта.ТребуетсяИзвещение = СвойстваДокумента.ТребуетсяИзвещение;
	ДанныеОбъекта.ТребуетсяПодтверждение = СвойстваДокумента.ТребуетсяПодтверждение;
	ДанныеОбъекта.СодержитМаркируемыеТовары = СвойстваДокумента.СодержитМаркируемыеТовары;
	ДанныеОбъекта.СпособОбмена = СвойстваДокумента.СпособОбмена;
	
	Если Не ЗаполнитьОписанияДанныхОбъектовДляПодготовкиКОтправке(ДанныеОбъекта, ФайлыСообщения, КонтекстДиагностики) Тогда
		ДанныеОбъекта.Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ОписаниеДокумента = СинхронизацияЭДО.НовоеОписаниеДокумента();
	
	Если СвойстваСообщения.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя Тогда
		
		ОписаниеДокумента.Номер = СвойстваДокумента.НомерДокумента;
		ОписаниеДокумента.Дата = СвойстваДокумента.ДатаДокумента;
		Если ЗначениеЗаполнено(СвойстваДокумента.СуммаДокумента) Тогда
			ОписаниеДокумента.Сумма = СвойстваДокумента.СуммаДокумента;
		КонецЕсли;
		ДанныеОбъекта.ОписаниеДокумента = ОписаниеДокумента;
		
		ЗаполнитьИдентификаторыОснованийДляПодготовкиКОтправке(ДанныеОбъекта, ИдентификаторыОснований);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьОписанияДанныхОбъектовДляПодготовкиКОтправке(ДанныеОбъекта, ФайлыСообщения, КонтекстДиагностики)
	
	Если Не ЗначениеЗаполнено(ФайлыСообщения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПрисоединенныеФайлыМассив = Новый Массив;
	Для Каждого СвойстваФайла Из ФайлыСообщения Цикл
		ПрисоединенныеФайлыМассив.Добавить(СвойстваФайла.Ссылка);
	КонецЦикла;
	
	ДвоичныеДанныеФайлов = РаботаСФайламиБЭД.ДвоичныеДанныеФайлов(ПрисоединенныеФайлыМассив, КонтекстДиагностики);
	
	Для Каждого СвойстваФайла Из ФайлыСообщения Цикл
		
		ДвоичныеДанные = ДвоичныеДанныеФайлов[СвойстваФайла.Ссылка];
		Если ДвоичныеДанные = Неопределено Тогда
			Если СвойстваФайла.ЭтоОсновнойФайл Тогда
				Возврат Ложь;
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ОписаниеДанныхФайла = СинхронизацияЭДО.НовоеОписаниеДанныхОбъекта();
		ОписаниеДанныхФайла.ИмяФайла = СвойстваФайла.ПолноеИмяФайла;
		ОписаниеДанныхФайла.ДвоичныеДанные = ДвоичныеДанные;
		
		ДанныеПодписей = Новый Массив;
		Если СвойстваФайла.ЭтоОсновнойФайл Тогда
			УстановленныеПодписи = ЭлектроннаяПодпись.УстановленныеПодписи(СвойстваФайла.Ссылка);
			Если ДанныеОбъекта.ЭтоОтветнаяПодпись Тогда
				КоличествоПодписей = УстановленныеПодписи.Количество();
				Если КоличествоПодписей > 1 Тогда
					СвойстваПодписи = УстановленныеПодписи[КоличествоПодписей - 1];
					ДобавитьОписаниеДанныхПодписи(ДанныеПодписей, СвойстваПодписи, СвойстваФайла);
				КонецЕсли;
			Иначе
				Для Каждого СвойстваПодписи Из УстановленныеПодписи Цикл
					ДобавитьОписаниеДанныхПодписи(ДанныеПодписей, СвойстваПодписи, СвойстваФайла);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если СвойстваФайла.ЭтоОсновнойФайл Тогда
			ДанныеОбъекта.ОписаниеДанных = ОписаниеДанныхФайла;
			ДанныеОбъекта.ПодписиОсновныхДанных = ДанныеПодписей;
		Иначе
			ДанныеОбъекта.ОписаниеДополнительныхДанных = ОписаниеДанныхФайла;
			ДанныеОбъекта.ПодписиДополнительныхДанных = ДанныеПодписей;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Процедура ДобавитьОписаниеДанныхПодписи(ДанныеПодписей, СвойстваПодписи, СвойстваФайла)
	
	ОписаниеДанныхПодписи = РаботаСФайламиБЭД.НовоеОписаниеФайла();
	ОписаниеДанныхПодписи.ДвоичныеДанные = СвойстваПодписи.Подпись;
	ОписаниеДанныхПодписи.ИмяФайла = СвойстваПодписи.ИмяФайлаПодписи;
	Если ПустаяСтрока(ОписаниеДанныхПодписи.ИмяФайла) Тогда
		ОписаниеДанныхПодписи.ИмяФайла = ИмяФайлаПодписи(СвойстваФайла.ПолноеИмяФайла,
			СвойстваПодписи.УникальныйИдентификатор);
	КонецЕсли;
	ДанныеПодписей.Добавить(ОписаниеДанныхПодписи);
	
КонецПроцедуры

Процедура ЗаполнитьИдентификаторыОснованийДляПодготовкиКОтправке(ДанныеОбъекта, ИдентификаторыОснований)
	
	Если Не ЗначениеЗаполнено(ИдентификаторыОснований) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ИдентификаторыОснований Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ИдентификаторСвязи) Тогда
			ДанныеОбъекта.ИдентификаторыСообщенийОснований.Добавить(СтрокаТаблицы.ИдентификаторСвязи);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ИдентификаторДокументооборота) Тогда
			ДанныеОбъекта.ИдентификаторыДокументооборотовОснований.Добавить(СтрокаТаблицы.ИдентификаторДокументооборота);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтметитьПодготовкуСообщенияКОтправке(СообщениеОбъект, СвойстваДокумента, СостоянияСообщений, КонтекстДиагностики, Комментарий = "")
		
	СообщениеОбъект.Статус = Перечисления.СтатусыСообщенийЭДО.ПодготовленКОтправке;
	СообщениеОбъект.ДатаИзмененияСтатуса = ТекущаяДатаСеанса();
	СообщениеОбъект.Состояние = РегламентыЭДО.СостояниеСообщения(СообщениеОбъект, СвойстваДокумента);
	СообщениеОбъект.Записать();
	
	НайденнаяСтрока = СостоянияСообщений.Найти(СообщениеОбъект.Ссылка, "Ссылка");
	НайденнаяСтрока.Состояние = СообщениеОбъект.Состояние;
	
	СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(СвойстваДокумента, СостоянияСообщений,
		СообщениеОбъект.ДатаИзмененияСтатуса, КонтекстДиагностики,,Комментарий);
	
	ЗаписатьДействиеВЖурнал(Перечисления.ДействияПоЭДО.ПодготовитьКОтправке, СвойстваДокумента, СостояниеДокумента,
		СообщениеОбъект.ДатаИзмененияСтатуса, СообщениеОбъект);
	
КонецПроцедуры

Процедура ОстановитьДокументПриПодготовкиКОтправке(СообщениеОбъект, ПричинаОстановки, СостоянияСообщений, КонтекстДиагностики, Комментарий = "")
	
	ДатаИзменения = ТекущаяДатаСеанса();
	
	ДокументОбъект = СообщениеОбъект.ЭлектронныйДокумент.ПолучитьОбъект();
	ДокументОбъект.Остановлен = Истина;
	ДокументОбъект.ПричинаОстановки = ПричинаОстановки;
	ДокументОбъект.Записать();
	
	УстановитьСостояниеХранение(СостоянияСообщений, ДатаИзменения);
	
	СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(ДокументОбъект, СостоянияСообщений,
		ДатаИзменения, КонтекстДиагностики,, Комментарий);
	
	ЗаписатьДействиеВЖурнал(Перечисления.ДействияПоЭДО.ПодготовитьКОтправке, ДокументОбъект, СостояниеДокумента,
		ДатаИзменения, СообщениеОбъект);
	
КонецПроцедуры

Процедура ДобавитьОшибкуОжиданияДругихДокументовПакета(ИдентификаторПакета, ДокументыПакета, КонтекстДиагностики)
	
	ВидОперации = НСтр("ru = 'Подготовка к отправке.'");
	ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка();
	
	КраткоеПредставление = НСтр("ru = 'Не удалось подготовить пакет электронных документов к отправке.'");
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(КраткоеПредставление);
	МассивСтрок.Добавить(СтрШаблон(НСтр("ru = 'Идентификатор пакета: %1'"), ИдентификаторПакета));
	МассивСтрок.Добавить(НСтр("ru = 'В пакете есть документы, которые не могут быть подготовлены к отправке:'"));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСтрок, ДокументыПакета);
	ПодробноеПредставление = СтрСоединить(МассивСтрок, Символы.ПС);
	
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации, ВидОшибки, ПодробноеПредставление, КраткоеПредставление);
	ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	
КонецПроцедуры

Функция СвойстваОсновныхСообщенийДокументовПакета(ДокументыПакета)
	Запрос = Новый Запрос(ТекстЗапросаСвойствОсновныхСообщенийДокументовПакета());
	Запрос.УстановитьПараметр("ЭлектронныеДокументы", ДокументыПакета);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ТекстЗапросаСвойствОсновныхСообщенийДокументовПакета()
	Возврат
		"ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка,
		|	СообщениеЭДО.Состояние,
		|	СообщениеЭДО.ЭлектронныйДокумент
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент В (&ЭлектронныеДокументы)
		|	И СообщениеЭДО.ТипЭлементаРегламента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя)";
КонецФункции

Функция ПричинаОстановкиПодготовкиОбъектаКОтправке(ДанныеОбъектов)
	
	ПричинаОстановки = Перечисления.ПричиныОстановкиЭДО.ПустаяСсылка();
	
	Если ДанныеОбъектов.Найти(СинхронизацияЭДО.ТипыОшибокОтправки().ОжидаетсяОтветНаПриглашение,
		"ТипОшибкиОтправки") <> Неопределено Тогда
		ПричинаОстановки = Перечисления.ПричиныОстановкиЭДО.ОжидаетсяОтветНаПриглашение;
	КонецЕсли;
	
	Возврат ПричинаОстановки;
	
КонецФункции

Функция ЕстьДействияПоДокументамПакета(ОбработанныеДокументы, ДокументыПакета)
	Для Каждого ЭлектронныйДокумент Из ДокументыПакета Цикл
		Если ОбработанныеДокументы[ЭлектронныйДокумент] <> Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

#КонецОбласти

#Область ОтменитьОтправку

Процедура ВыполнитьДействиеОтменитьОтправку(ПараметрыВыполнения, РезультатДействий)
	
	Если ЗначениеЗаполнено(ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов) Тогда
		
		Для Каждого ПакетДокументов Из ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов Цикл
			ОтменитьОтправкуПакета(ПакетДокументов, РезультатДействий);
		КонецЦикла;
		
	Иначе
		
		Отбор = НовыйОтборСообщенийДляОбработкиДействия();
		Отбор.Состояние.Добавить(Перечисления.СостоянияСообщенийЭДО.Отправка);
		ВыборкаСообщений = ВыборкаСообщенийДляОбработкиДействия(ПараметрыВыполнения.ОбъектыДействий, Отбор);
		Пока ВыборкаСообщений.Следующий() Цикл
			ОтменитьОтправкуСообщения(ВыборкаСообщений.Ссылка, РезультатДействий);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтменитьОтправкуПакета(ПакетДокументов, РезультатДействий)
	
	Действие = Перечисления.ДействияПоЭДО.ОтменитьОтправку;
	КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
	ОбъектыСообщений = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		СообщенияПакета = СообщенияПакетаДляИзменения(ПакетДокументов, Действие, КонтекстДиагностики,,
			Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);
		Если Не ЗначениеЗаполнено(СообщенияПакета) Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Для Каждого Сообщение Из СообщенияПакета Цикл
			Результат = ОтменитьОтправкуКонтейнера(Сообщение, КонтекстДиагностики);
			Если Результат.Отказ Тогда
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОбъектыСообщений, Результат.ОбъектыСообщений);;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоПакету(ПакетДокументов, Действие, ТекстОшибки, КонтекстДиагностики);
		Возврат;
	КонецПопытки;
	
	Для Каждого СообщениеОбъект Из ОбъектыСообщений Цикл
		ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Действие, СообщениеОбъект.ЭлектронныйДокумент);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтменитьОтправкуСообщения(Сообщение, РезультатДействий)
	
	РезультатОтменыОтправки = ОтменитьОтправкуКонтейнера(Сообщение, РезультатДействий.КонтекстДиагностики);
	
	Если РезультатОтменыОтправки.Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СообщениеОбъект Из РезультатОтменыОтправки.ОбъектыСообщений Цикл
		ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Перечисления.ДействияПоЭДО.Отправить,
			СообщениеОбъект.ЭлектронныйДокумент);
	КонецЦикла;
	
КонецПроцедуры

Функция ОтменитьОтправкуКонтейнера(Сообщение, КонтекстДиагностики)
	
	ТранспортныйКонтейнер = СинхронизацияЭДО.ТранспортныйКонтейнерОбъекта(Сообщение);
	
	НаборСообщений = СинхронизацияЭДО.ОбъектыТранспортногоКонтейнера(ТранспортныйКонтейнер);
	
	Возврат ОтменитьОтправку(НаборСообщений, КонтекстДиагностики);
	
КонецФункции

Функция ОтменитьОтправку(НаборСообщений, КонтекстДиагностики)
	
	Результат = Новый Структура;
	Результат.Вставить("Отказ", Ложь);
	Результат.Вставить("ОбъектыСообщений", Новый Массив);
	
	Действие = Перечисления.ДействияПоЭДО.ОтменитьОтправку;
	
	Блокировка = Новый БлокировкаДанных;
	Для Каждого Сообщение Из НаборСообщений Цикл
		ЭлементБлокировки = Блокировка.Добавить("Документ.СообщениеЭДО");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Сообщение);
	КонецЦикла;
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос(ТекстЗапросаДанныхДляОтменыОтправки());
		Запрос.УстановитьПараметр("НаборСообщений", НаборСообщений);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		Если РезультатыЗапроса[1].Пустой()
			ИЛИ РезультатыЗапроса[2].Пустой() Тогда
			ЗафиксироватьТранзакцию();
			Возврат Результат;
		КонецЕсли;
		
		СвойстваДокументаСообщения = РезультатыЗапроса[1].Выбрать();
		
		СоотоянияСообщенийДокументов = Новый Соответствие;
		ВыборкаСостоянийСообщений = РезультатыЗапроса[2].Выбрать();
		Пока ВыборкаСостоянийСообщений.Следующий() Цикл
			СостоянияСообщений = СоотоянияСообщенийДокументов[ВыборкаСостоянийСообщений.ЭлектронныйДокумент];
			Если СостоянияСообщений = Неопределено Тогда
				СостоянияСообщений = РегламентыЭДО.НовыеСостоянияЭлементовРегламента();
				СостоянияСообщений.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.СообщениеЭДО"));
				СоотоянияСообщенийДокументов.Вставить(ВыборкаСостоянийСообщений.ЭлектронныйДокумент, СостоянияСообщений);
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СостоянияСообщений.Добавить(), ВыборкаСостоянийСообщений);
		КонецЦикла;
		
		ПодписанныеСообщения = РезультатыЗапроса[3].Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		Пока СвойстваДокументаСообщения.Следующий() Цикл
			
			СостоянияСообщений = СоотоянияСообщенийДокументов[СвойстваДокументаСообщения.Ссылка];
			
			СообщениеОбъект = ОбщегоНазначенияБЭД.ОбъектПоСсылкеДляИзменения(СвойстваДокументаСообщения.Сообщение);
			СообщениеОбъект.Статус = ?(ПодписанныеСообщения.Найти(СвойстваДокументаСообщения.Сообщение) = Неопределено,
				Перечисления.СтатусыСообщенийЭДО.Сформирован,
				Перечисления.СтатусыСообщенийЭДО.Подписан);
			
			СообщениеОбъект.Состояние = РегламентыЭДО.СостояниеСообщения(СообщениеОбъект, СвойстваДокументаСообщения);
			СообщениеОбъект.Записать();
			
			НайденнаяСтрока = СостоянияСообщений.Найти(СообщениеОбъект.Ссылка, "Ссылка");
			НайденнаяСтрока.Состояние = СообщениеОбъект.Состояние;
			
			СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(СвойстваДокументаСообщения, СостоянияСообщений,
				СообщениеОбъект.ДатаИзмененияСтатуса, КонтекстДиагностики);
			
			ЗаписатьДействиеВЖурнал(Действие, СвойстваДокументаСообщения, СостояниеДокумента, 
				СообщениеОбъект.ДатаИзмененияСтатуса, СообщениеОбъект);
			
			Результат.ОбъектыСообщений.Добавить(СообщениеОбъект);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат.Отказ = Истина;
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаДанныхДляОтменыОтправки()
	Возврат
		"ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Ссылка,
		|	СообщениеЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
		|	СообщениеЭДО.ОсновнойФайл КАК ОсновнойФайл
		|ПОМЕСТИТЬ СообщенияДляОбработки
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.Ссылка В (&НаборСообщений)
		|	И СообщениеЭДО.Направление = ЗНАЧЕНИЕ(Перечисление.НаправленияЭДО.Исходящий)
		|	И СообщениеЭДО.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенийЭДО.Отправка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Сообщение,
		|	ДокументЭДО.Ссылка КАК Ссылка,
		|	ДокументЭДО.ТипРегламента КАК ТипРегламента,
		|	ДокументЭДО.СпособОбмена КАК СпособОбмена,
		|	ДокументЭДО.ОбменБезПодписи КАК ОбменБезПодписи,
		|	ДокументЭДО.ТребуетсяИзвещение КАК ТребуетсяИзвещение,
		|	ДокументЭДО.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
		|	ДокументЭДО.Остановлен КАК Остановлен,
		|	ДокументЭДО.ПричинаОстановки КАК ПричинаОстановки,
		|	ДокументЭДО.Исправлен КАК Исправлен,
		|	ДокументЭДО.Ответственный КАК Ответственный
		|ИЗ
		|	СообщенияДляОбработки КАК СообщениеЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящийЭДО КАК ДокументЭДО
		|		ПО СообщениеЭДО.ЭлектронныйДокумент = ДокументЭДО.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Сообщение,
		|	ДокументЭДО.Ссылка КАК Ссылка,
		|	ДокументЭДО.ТипРегламента КАК ТипРегламента,
		|	ДокументЭДО.СпособОбмена КАК СпособОбмена,
		|	ДокументЭДО.ОбменБезПодписи КАК ОбменБезПодписи,
		|	ДокументЭДО.ТребуетсяИзвещение КАК ТребуетсяИзвещение,
		|	ДокументЭДО.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
		|	ДокументЭДО.Остановлен КАК Остановлен,
		|	ДокументЭДО.ПричинаОстановки КАК ПричинаОстановки,
		|	ДокументЭДО.Исправлен КАК Исправлен,
		|	ДокументЭДО.Ответственный КАК Ответственный
		|ИЗ
		|	СообщенияДляОбработки КАК СообщениеЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументИсходящийЭДО КАК ДокументЭДО
		|		ПО СообщениеЭДО.ЭлектронныйДокумент = ДокументЭДО.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Ссылка,
		|	СообщениеЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
		|	СообщениеЭДО.Состояние КАК Состояние,
		|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент В
		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			СообщенияДляОбработки.ЭлектронныйДокумент
		|		ИЗ
		|			СообщенияДляОбработки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Ссылка
		|ИЗ
		|	СообщенияДляОбработки КАК СообщениеЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|		ПО СообщениеЭДО.ОсновнойФайл = ПрисоединенныеФайлы.Ссылка
		|		И ПрисоединенныеФайлы.ПодписанЭП";
КонецФункции

#КонецОбласти

#Область Отправить

Процедура ВыполнитьДействиеОтправить(ПараметрыВыполнения, РезультатДействий)
	
	Если НастройкиЭДО.ОтложеннаяОтправкаЭлектронныхДокументов() Тогда
		Возврат;
	КонецЕсли;
	
	РезультатОтправки = ОтправитьСообщения(ПараметрыВыполнения, РезультатДействий.КонтекстДиагностики);
	Если РезультатОтправки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИтогДействийПоЭДО = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатОтправки.ДополнительныеПараметры,
		"ИтогДействийПоЭДО");
	Если ЗначениеЗаполнено(ИтогДействийПоЭДО) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(РезультатДействий.Итог.ОбработанныеДокументы,
			ИтогДействийПоЭДО.ОбработанныеДокументы, Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(РезультатДействий.Итог.ОбработаноПоДействиям,
			ИтогДействийПоЭДО.ОбработаноПоДействиям, Истина);
	КонецЕсли;
	
	РезультатДействий.КонтекстДиагностики = РезультатОтправки.КонтекстДиагностики;
	
	Если РезультатОтправки.ТребуетсяОбработкаНаКлиенте Тогда
		РезультатДействий.КонтекстОтправки = РезультатОтправки.КонтекстОтправки;
	КонецЕсли;
	
КонецПроцедуры

Функция ОтправитьСообщения(ПараметрыВыполнения, КонтекстДиагностики)
	
	ОписаниеЗапроса = ЗапросСообщенийДляОтправки(ПараметрыВыполнения.ОбъектыДействий, "ОбъектыДляОтправки");
	
	ДополнительныеПараметры = Новый Структура("ИтогДействийПоЭДО",
		ЭлектронныеДокументыЭДОКлиентСервер.НовыйИтогВыполненияДействийПоЭДО());
	
	РезультатОтправки = СинхронизацияЭДО.ОтправитьОбъекты(ОписаниеЗапроса, КонтекстДиагностики,
		ПараметрыВыполнения.ОтпечаткиСертификатов, ПараметрыВыполнения.ВыбранныеСертификаты, ДополнительныеПараметры);
	
	Возврат РезультатОтправки;
	
КонецФункции

Функция ЗапросСообщенийДляОтправки(ОбъектыДействий, ИмяВременнойТаблицы = "")
	
	ОписаниеЗапроса = ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса();
	
	МеткаВременнойТаблицы = "ПОМЕСТИТЬ ИмяВременнойТаблицы";
	ЗначениеВременнойТаблицы = "";
	Если ЗначениеЗаполнено(ИмяВременнойТаблицы) Тогда
		ЗначениеВременнойТаблицы = СтрЗаменить(МеткаВременнойТаблицы, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОбъектыДействий.ПакетыДокументов) Тогда
		
		ОписаниеЗапроса.СлужебныеПараметры.Вставить("ПакетыДокументов", ОбъектыДействий.ПакетыДокументов);
		ОписаниеЗапроса.СлужебныеПараметры.Вставить("СостояниеСообщения", Перечисления.СостоянияСообщенийЭДО.Отправка);
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	СообщениеЭДО.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ИмяВременнойТаблицы
			|ИЗ
			|	РегистрСведений.СоставПакетовДокументовЭДО КАК СоставПакетов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
			|		ПО СоставПакетов.ЭлектронныйДокумент = СообщениеЭДО.ЭлектронныйДокумент
			|		И СообщениеЭДО.Состояние = &СостояниеСообщения
			|ГДЕ
			|	СоставПакетов.ИдентификаторПакета В (&ПакетыДокументов)";
		
		ОписаниеЗапроса.Текст = СтрЗаменить(ТекстЗапроса, МеткаВременнойТаблицы, ЗначениеВременнойТаблицы);
		
	Иначе
		
		Отбор = НовыйОтборСообщенийДляОбработкиДействия();
		Отбор.Состояние.Добавить(Перечисления.СостоянияСообщенийЭДО.Отправка);
		Отбор.ИспользоватьИдентификаторыОрганизаций = Истина;
		ОписаниеЗапроса = ЗапросСообщенийДляОбработкиДействия(ОбъектыДействий, Отбор, ИмяВременнойТаблицы)
		
	КонецЕсли;
	
	Возврат ОписаниеЗапроса;
	
КонецФункции

Процедура ОбработатьОтправленноеСообщение(Сообщение, ОшибкаПередачи, КонтекстДиагностики, Отказ, ИтогДействийПоЭДО)
	
	Действие = Перечисления.ДействияПоЭДО.Отправить;
	
	НачатьТранзакцию();
	Попытка
		СообщениеОбъект = ОбщегоНазначенияБЭД.ОбъектПоСсылкеДляИзменения(Сообщение);
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ.СообщениеЭДО");
		ЭлементБлокировки.УстановитьЗначение("ЭлектронныйДокумент", СообщениеОбъект.ЭлектронныйДокумент);
		Блокировка.Заблокировать();
		
		ЭтоВходящийЭДО = ЭтоВходящийЭДО(СообщениеОбъект.ЭлектронныйДокумент);
		
		ТекстыЗапроса = Новый Массив;
		ТекстыЗапроса.Добавить(ТекстЗапросаПараметровОбновленияСостоянияДокумента(ЭтоВходящийЭДО));
		ТекстыЗапроса.Добавить(ТекстЗапросаКомментарияКСостояниюДокумента());
		
		Запрос = Новый Запрос;
		Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", СообщениеОбъект.ЭлектронныйДокумент);
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		ПараметрыДокумента = РезультатыЗапроса[0].Выбрать();
		ПараметрыДокумента.Следующий();
		СостоянияСообщений = РезультатыЗапроса[1].Выгрузить();
		
		СообщениеОбъект.Статус = Перечисления.СтатусыСообщенийЭДО.Отправлен;
		СообщениеОбъект.ДатаИзмененияСтатуса = ТекущаяДатаСеанса();
		СообщениеОбъект.Состояние = РегламентыЭДО.СостояниеСообщения(СообщениеОбъект, ПараметрыДокумента);
		СообщениеОбъект.Записать();
		
		НайденнаяСтрока = СостоянияСообщений.Найти(СообщениеОбъект.Ссылка, "Ссылка");
		НайденнаяСтрока.Состояние = СообщениеОбъект.Состояние;
		
		Комментарий = КомментарийКСостояниюДокумента(РезультатыЗапроса[2]);
		
		СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(ПараметрыДокумента, СостоянияСообщений,
			СообщениеОбъект.ДатаИзмененияСтатуса, КонтекстДиагностики,,Комментарий);
		
		ЗаписатьДействиеВЖурнал(Действие, ПараметрыДокумента, СостояниеДокумента, СообщениеОбъект.ДатаИзмененияСтатуса,
			СообщениеОбъект);
		
		ЗаполнитьИтогВыполненияДействияПоЭДО(ИтогДействийПоЭДО, Действие, СообщениеОбъект.ЭлектронныйДокумент);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Отказ = Истина;
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоСообщению(Сообщение, Действие, ТекстОшибки, КонтекстДиагностики);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаОшибок

Функция ВидОперацииПриДобавленииОшибки(ПредставлениеДействия)
	Возврат СтрШаблон(НСтр("ru = 'Действие %1'"), ПредставлениеДействия);
КонецФункции

Процедура ДобавитьОшибкуВыполненияДействияПоСообщению(Сообщение, Действие, ТекстОшибки, КонтекстДиагностики)
	
	ПредставлениеДействия = НРег(Действие);
	ВидОперации = ВидОперацииПриДобавленииОшибки(ПредставлениеДействия);
	ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщениеЭДО.ВидСообщения КАК ВидСообщения,
		|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента,
		|	СообщениеЭДО.ЭлектронныйДокумент.ИдентификаторДокументооборота КАК ИдентификаторДокументооборота,
		|	СообщениеЭДО.ЭлектронныйДокумент.ВидДокумента КАК ВидДокумента,
		|	СообщениеЭДО.ЭлектронныйДокумент.ДатаДокумента КАК ДатаДокумента,
		|	СообщениеЭДО.ЭлектронныйДокумент.НомерДокумента КАК НомерДокумента
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Сообщение);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка.Следующий();
	
	ПредставлениеДокумента = ПредставлениеДокументаПоСвойствам(Выборка);
	
	КраткоеПредставление = СтрШаблон(НСтр("ru = 'Не удалось %1 %2.'"), ПредставлениеДействия, ПредставлениеДокумента);
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(КраткоеПредставление);
	МассивСтрок.Добавить(СтрШаблон(НСтр("ru = 'Идентификатор документооборота: %1'"),
		Выборка.ИдентификаторДокументооборота));
	МассивСтрок.Добавить(СтрШаблон(НСтр("ru = 'Тип сообщения: %1'"), Выборка.ТипЭлементаРегламента));
	МассивСтрок.Добавить(ТекстОшибки);
	ПодробноеПредставление = СтрСоединить(МассивСтрок, Символы.ПС);
	
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации, ВидОшибки, ПодробноеПредставление, КраткоеПредставление);
	ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	
КонецПроцедуры

Процедура ДобавитьОшибкуВыполненияДействияПоДокументу(ЭлектронныйДокумент, Действие, ТекстОшибки, КонтекстДиагностики)
	
	ПредставлениеДействия = НРег(Действие);
	ВидОперации = ВидОперацииПриДобавленииОшибки(ПредставлениеДействия);
	ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка();
	
	СвойстваДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйДокумент,
		"ВидДокумента, НомерДокумента, ДатаДокумента, ИдентификаторДокументооборота");
	ПредставлениеДокумента = ПредставлениеДокументаПоСвойствам(СвойстваДокумента);
	КраткоеПредставление = СтрШаблон(НСтр("ru = 'Не удалось %1 %2.'"), ПредставлениеДействия, ПредставлениеДокумента);
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(КраткоеПредставление);
	МассивСтрок.Добавить(СтрШаблон(НСтр("ru = 'Идентификатор документооборота: %1'"),
		СвойстваДокумента.ИдентификаторДокументооборота));
	МассивСтрок.Добавить(ТекстОшибки);
	ПодробноеПредставление = СтрСоединить(МассивСтрок, Символы.ПС);
	
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации, ВидОшибки, ПодробноеПредставление, КраткоеПредставление);
	ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	
КонецПроцедуры

Процедура ДобавитьОшибкуВыполненияДействияПоПакету(ИдентификаторПакета, Действие, ТекстОшибки,КонтекстДиагностики)
	
	ПредставлениеДействия = НРег(Действие);
	ВидОперации = ВидОперацииПриДобавленииОшибки(ПредставлениеДействия);
	ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка();
	
	КраткоеПредставление = СтрШаблон(НСтр("ru = 'Не удалось %1 документы пакета.'"), ПредставлениеДействия);
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(КраткоеПредставление);
	МассивСтрок.Добавить(СтрШаблон(НСтр("ru = 'Идентификатор пакета: %1'"), ИдентификаторПакета));
	МассивСтрок.Добавить(ТекстОшибки);
	ПодробноеПредставление = СтрСоединить(МассивСтрок, Символы.ПС);
	
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации, ВидОшибки, ПодробноеПредставление, КраткоеПредставление);
	ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ЗагрузкаДокументов

Функция НовыйРезультатЗагрузкиДокументов()
	Результат = Новый Структура;
	Результат.Вставить("РезультатДействийПоЭДО");
	Результат.Вставить("КонтекстСобытияПослеЗагрузки");
	Результат.Вставить("КонтекстПроверкиПодписей");
	Результат.Вставить("КонтекстДиагностики");
	Возврат Результат;
КонецФункции

Функция НовыйКонтекстПроверкиПодписей()
	Контекст = Новый Структура;
	Контекст.Вставить("ДанныеДокументов");
	Контекст.Вставить("ОтпечаткиСертификатов");
	Контекст.Вставить("ПаролиСертификатов");
	Возврат Контекст;
КонецФункции

Функция НовыеПараметрыПроверкиПодписиНаКлиенте()
	ДанныеПодписи = Новый Структура;
	ДанныеПодписи.Вставить("ИдентификаторДанныхДокумента");
	ДанныеПодписи.Вставить("ДвоичныеДанныеФайла");
	ДанныеПодписи.Вставить("ДвоичныеДанныеПодписи");
	ДанныеПодписи.Вставить("ЭтоОсновныеДанные");
	Возврат ДанныеПодписи;
КонецФункции

Процедура ДополнитьДанныеОбъектовДляЗагрузки(ДанныеОбъектов)
	
	ДанныеОбъектов.Колонки.Добавить("Содержание");
	ДанныеОбъектов.Колонки.Добавить("ПрикладнойТипДокумента", ИнтеграцияЭДО.ОписаниеТиповПрикладныхЭлектронныхДокументов());
	
	Отбор = Новый Структура("ТипЭлементаРегламента, ЭтоОтветнаяПодпись",
		Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя, Ложь);
	НайденныеСтроки = ДанныеОбъектов.НайтиСтроки(Отбор);
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		Содержание = ФорматыЭДО.ПрочитатьСодержаниеДокумента(СтрокаТаблицы.ОписаниеДанных);
		Если ЗначениеЗаполнено(Содержание) Тогда
			СтрокаТаблицы.ТипДокумента = Содержание.ТипДокумента;
			СтрокаТаблицы.ПрикладнойТипДокумента = Содержание.ПрикладнойТипДокумента;
			Если ЗначениеЗаполнено(Содержание.Получатель.ИНН) Тогда
				Организация = ИнтеграцияЭДО.СсылкаНаОбъектПоИННКПП("Организации",
					Содержание.Получатель.ИНН, Содержание.Получатель.КПП, Содержание.ДатаДокумента);
				Если ЗначениеЗаполнено(Организация) Тогда
					СтрокаТаблицы.Организация = Организация;
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(Содержание.Отправитель.ИНН) Тогда
				Контрагент = ИнтеграцияЭДО.СсылкаНаОбъектПоИННКПП("Контрагенты",
					Содержание.Отправитель.ИНН, Содержание.Отправитель.КПП, Содержание.ДатаДокумента);
				Если ЗначениеЗаполнено(Контрагент) Тогда
					СтрокаТаблицы.Контрагент = Контрагент;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Содержание = НовоеСодержаниеСообщения();
			Если ЗначениеЗаполнено(СтрокаТаблицы.ОписаниеДокумента) Тогда
				Содержание.НомерДокумента = СтрокаТаблицы.ОписаниеДокумента.Номер;
				Содержание.ДатаДокумента = СтрокаТаблицы.ОписаниеДокумента.Дата;
				Содержание.СуммаДокумента = СтрокаТаблицы.ОписаниеДокумента.Сумма;
			КонецЕсли;
			Содержание.ТипДокумента = СтрокаТаблицы.ТипДокумента;
			Содержание.ТипРегламента = СтрокаТаблицы.ТипРегламента;
		КонецЕсли;
		СтрокаТаблицы.Содержание = Содержание;
	КонецЦикла;
	
	ЕстьОтветнаяПодпись = ДанныеОбъектов.Найти(Истина, "ЭтоОтветнаяПодпись") <> Неопределено;
	
	Если ЕстьОтветнаяПодпись Тогда
		ПоляВыбора = "ИдентификаторСтроки,
			|ТипДокумента,
			|ПрикладнойТипДокумента,
			|ЭтоОтветнаяПодпись,
			|ИдентификаторДокументооборота,
			|ИдентификаторПолучателя,
			|ТипЭлементаРегламента";
	Иначе
		ПоляВыбора = "ИдентификаторСтроки,
			|ТипДокумента,
			|ПрикладнойТипДокумента";
	КонецЕсли;
	
	ДанныеДляОбработки = ДанныеОбъектов.Скопировать(, ПоляВыбора);
	
	ТекстЗапросаДанныхДляОбработки =
		"ВЫБРАТЬ
		|	&ПоляВыбора
		|ПОМЕСТИТЬ ДанныеОбъектов
		|ИЗ
		|	&ДанныеДляОбработки КАК ДанныеОбъектов";
		
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(СтрЗаменить(ТекстЗапросаДанныхДляОбработки, "&ПоляВыбора", ПоляВыбора));
	
	ТекстыЗапросов.Добавить(
		"ВЫБРАТЬ
		|	ДанныеОбъектов.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ВидыДокументовЭДО.Ссылка КАК ВидДокумента
		|ИЗ
		|	ДанныеОбъектов КАК ДанныеОбъектов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|		ПО ДанныеОбъектов.ТипДокумента = ВидыДокументовЭДО.ТипДокумента
		|		И ДанныеОбъектов.ПрикладнойТипДокумента = ВидыДокументовЭДО.ПрикладнойТипДокумента");
		
	Если ЕстьОтветнаяПодпись Тогда
		
		ТекстыЗапросов.Добавить(
			"ВЫБРАТЬ
			|	ДанныеОбъектов.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	СообщениеЭДО.Ссылка КАК Ссылка,
			|	СообщениеЭДО.ОсновнойФайл КАК ОсновнойФайл
			|ИЗ
			|	ДанныеОбъектов КАК ДанныеОбъектов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящийЭДО КАК ДокументЭДО
			|		ПО ДанныеОбъектов.ИдентификаторДокументооборота = ДокументЭДО.ИдентификаторДокументооборота
			|		И ДанныеОбъектов.ИдентификаторПолучателя = ДокументЭДО.ИдентификаторОрганизации
			|		И ДанныеОбъектов.ЭтоОтветнаяПодпись
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
			|		ПО ДокументЭДО.Ссылка = СообщениеЭДО.ЭлектронныйДокумент
			|		И ДанныеОбъектов.ТипЭлементаРегламента = СообщениеЭДО.ТипЭлементаРегламента
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДанныеОбъектов.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	СообщениеЭДО.Ссылка КАК Ссылка,
			|	СообщениеЭДО.ОсновнойФайл КАК ОсновнойФайл
			|ИЗ
			|	ДанныеОбъектов КАК ДанныеОбъектов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументИсходящийЭДО КАК ДокументЭДО
			|		ПО ДанныеОбъектов.ИдентификаторДокументооборота = ДокументЭДО.ИдентификаторДокументооборота
			|		И ДанныеОбъектов.ИдентификаторПолучателя = ДокументЭДО.ИдентификаторОрганизации
			|		И ДанныеОбъектов.ЭтоОтветнаяПодпись
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
			|		ПО ДокументЭДО.Ссылка = СообщениеЭДО.ЭлектронныйДокумент
			|		И ДанныеОбъектов.ТипЭлементаРегламента = СообщениеЭДО.ТипЭлементаРегламента");
			
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос.УстановитьПараметр("ДанныеДляОбработки", ДанныеДляОбработки);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатыЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеОбъекта = СинхронизацияЭДО.ДанныеОбъектаПоИдентификатору(ДанныеОбъектов, Выборка.ИдентификаторСтроки);
		Если ЗначениеЗаполнено(Выборка.ВидДокумента) Тогда
			ДанныеОбъекта.ВидДокумента = Выборка.ВидДокумента;
		Иначе
			ПараметрыПоиска = НовыеПараметрыПоискаВидаДокумента(ДанныеОбъекта.ТипДокумента);
			Если ЗначениеЗаполнено(ДанныеОбъекта.ПрикладнойТипДокумента) Тогда
				ПараметрыПоиска.ПрикладнойТипДокумента = ДанныеОбъекта.ПрикладнойТипДокумента;
			КонецЕсли;
			ДанныеОбъекта.ВидДокумента = СоздатьВидДокумента(ПараметрыПоиска);
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОтветнаяПодпись Тогда
		ЗаполнитьОписаниеДанныхДляПроверкиОтветнойПодписи(ДанныеОбъектов, РезультатыЗапроса[2]);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОписаниеДанныхДляПроверкиОтветнойПодписи(ДанныеОбъектов, РезультатЗапроса)
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ПрисоединенныеФайлыМассив = Новый Массив;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПрисоединенныеФайлыМассив.Добавить(Выборка.ОсновнойФайл);
	КонецЦикла;
	
	ДвоичныеДанныеФайлов = РаботаСФайламиБЭД.ДвоичныеДанныеФайлов(ПрисоединенныеФайлыМассив);
	
	Выборка.Сбросить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДвоичныеДанные = ДвоичныеДанныеФайлов[Выборка.ОсновнойФайл];
		Если ДвоичныеДанные = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДанныеОбъекта = СинхронизацияЭДО.ДанныеОбъектаПоИдентификатору(ДанныеОбъектов, Выборка.ИдентификаторСтроки);
		ДанныеОбъекта.ОписаниеДанных = РаботаСФайламиБЭД.НовоеОписаниеФайла();
		ДанныеОбъекта.ОписаниеДанных.ДвоичныеДанные = ДвоичныеДанные;
		ДанныеОбъекта.Объект = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьПодписиПоОбъектамКонтейнеров(ДанныеОбъектов, МенеджерКриптографии, КонтекстДиагностики)
	
	Результат = Новый Соответствие;
	
	Для Каждого ДанныеОбъекта Из ДанныеОбъектов Цикл
		
		ПодписиОсновныхДанных = ПроверитьПодписиДанныхДокумента(ДанныеОбъекта.ОписаниеДанных.ДвоичныеДанные,
			ДанныеОбъекта.ПодписиОсновныхДанных, МенеджерКриптографии, КонтекстДиагностики);
		
		ПодписиДополнительныхДанных = ПроверитьПодписиДанныхДокумента(
			ДанныеОбъекта.ОписаниеДополнительныхДанных.ДвоичныеДанные,
			ДанныеОбъекта.ПодписиДополнительныхДанных, МенеджерКриптографии, КонтекстДиагностики);
		
		ПроверенныеПодписи = Новый Структура;
		ПроверенныеПодписи.Вставить("ПодписиОсновныхДанных", ПодписиОсновныхДанных);
		ПроверенныеПодписи.Вставить("ПодписиДополнительныхДанных", ПодписиДополнительныхДанных);
		
		Результат.Вставить(ДанныеОбъекта.ИдентификаторСтроки, ПроверенныеПодписи);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьПодписиДанныхДокумента(ИсходныеДанные, ДанныеПодписей, МенеджерКриптографии, КонтекстДиагностики)
	
	ПроверенныеПодписи = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ДанныеПодписей) Тогда
		Возврат ПроверенныеПодписи;
	КонецЕсли;
	
	Для Каждого ДанныеПодписи Из ДанныеПодписей Цикл
		РезультатПроверки = КриптографияБЭД.ПроверитьПодпись(МенеджерКриптографии, ИсходныеДанные,
			ДанныеПодписи.ДвоичныеДанные, КонтекстДиагностики);
		РезультатПроверки.Вставить("Подпись", ДанныеПодписи.ДвоичныеДанные);
		РезультатПроверки.Вставить("ИмяФайлаПодписи", ДанныеПодписи.ИмяФайла);
		ПроверенныеПодписи.Добавить(РезультатПроверки);
	КонецЦикла;
	
	Возврат ПроверенныеПодписи;
	
КонецФункции

Функция ЗагрузитьДанныеОбъектовКонтейнеровПослеПроверкиПодписей(ДанныеОбъектов, ПроверенныеПодписи, КонтекстДиагностики, ОтпечаткиСертификатов, ПаролиСертификатов = Неопределено) Экспорт
	
	РезультатЗагрузки = ЗагрузитьДанныеОбъектовКонтейнеров(ДанныеОбъектов, ПроверенныеПодписи, КонтекстДиагностики);
	
	КонтекстСобытия = Новый Структура;
	ЭлектронныеДокументыЭДОСобытия.ПослеЗагрузкиНовыхЭлектронныхДокументов(РезультатЗагрузки.СведенияЗагруженныхДокументов,
		КонтекстСобытия, КонтекстДиагностики);
	
	РезультатДействийПоЭДО = НовыйРезультатДействийПоЭДО(КонтекстДиагностики);
	РезультатДействийПоЭДО.Итог = РезультатЗагрузки.ИтогДействийПоЭДО;
	
	Если ЗначениеЗаполнено(РезультатЗагрузки.СформированныеИзвещения) Тогда
		ПараметрыВыполнения = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
		ДобавитьДействие(ПараметрыВыполнения.НаборДействий, Перечисления.ДействияПоЭДО.Подписать);
		ДобавитьДействие(ПараметрыВыполнения.НаборДействий, Перечисления.ДействияПоЭДО.ПодготовитьКОтправке);
		ДобавитьДействие(ПараметрыВыполнения.НаборДействий, Перечисления.ДействияПоЭДО.Отправить);
		ПараметрыВыполнения.ОбъектыДействий.Сообщения = РезультатЗагрузки.СформированныеИзвещения;
		ПараметрыВыполнения.ОтпечаткиСертификатов = ОтпечаткиСертификатов;
		ПродолжитьВыполнениеДействийПоЭДО(ПараметрыВыполнения, РезультатДействийПоЭДО);
	КонецЕсли;
	
	Результат = НовыйРезультатЗагрузкиДокументов();
	Результат.РезультатДействийПоЭДО = РезультатДействийПоЭДО;
	Результат.КонтекстСобытияПослеЗагрузки = КонтекстСобытия;
	Результат.КонтекстДиагностики = РезультатДействийПоЭДО.КонтекстДиагностики;
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьДанныеОбъектовКонтейнеров(ДанныеОбъектов, ПроверенныеПодписи, КонтекстДиагностики)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СведенияЗагруженныхДокументов = НовыеСведенияЗагруженныхДокументов();
	
	РезультатЗагрузкиДанных = Новый Структура;
	РезультатЗагрузкиДанных.Вставить("СведенияЗагруженныхДокументов", СведенияЗагруженныхДокументов);
	РезультатЗагрузкиДанных.Вставить("СформированныеИзвещения", Новый Массив);
	РезультатЗагрузкиДанных.Вставить("ИтогДействийПоЭДО",
		ЭлектронныеДокументыЭДОКлиентСервер.НовыйИтогВыполненияДействийПоЭДО());
	
	ДанныеОбъектовПоПакетам = Новый Соответствие;
	ДанныеОбъектовБезПакетов = Новый Массив;
	
	Для Каждого ДанныеОбъекта Из ДанныеОбъектов Цикл
		
		Если ЗначениеЗаполнено(ДанныеОбъекта.ИдентификаторПакета)
			И ДанныеОбъекта.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя Тогда
			ДанныеОбъектовПакета = ДанныеОбъектовПоПакетам[ДанныеОбъекта.ИдентификаторПакета];
			Если ДанныеОбъектовПакета = Неопределено Тогда
				ДанныеОбъектовПакета = Новый Массив;
				ДанныеОбъектовПоПакетам.Вставить(ДанныеОбъекта.ИдентификаторПакета, ДанныеОбъектовПакета);
			КонецЕсли;
			ДанныеОбъектовПакета.Добавить(ДанныеОбъекта);
		Иначе
			ДанныеОбъектовБезПакетов.Добавить(ДанныеОбъекта);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДанныеОбъектовПоПакетам) Тогда
		
		Для Каждого ДанныеОбъектовПакета Из ДанныеОбъектовПоПакетам Цикл
			
			ЗагрузитьДанныеОбъектовПакета(ДанныеОбъектовПакета, ПроверенныеПодписи,
				КонтекстДиагностики, РезультатЗагрузкиДанных);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеОбъектовБезПакетов) Тогда
		
		Для Каждого ДанныеОбъекта Из ДанныеОбъектовБезПакетов Цикл
			
			ЗагрузитьДанныеОбъекта(ДанныеОбъекта, ПроверенныеПодписи, КонтекстДиагностики, РезультатЗагрузкиДанных);
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	Возврат РезультатЗагрузкиДанных;
	
КонецФункции

Процедура ЗагрузитьДанныеОбъекта(ДанныеОбъекта, ПроверенныеПодписи, КонтекстДиагностики, РезультатЗагрузкиДанных)
	
	НачатьТранзакцию();
	Попытка
		
		ЗаблокироватьДанныеДокументаПриЗагрузке(ДанныеОбъекта);
		
		РезультатЗагрузкиСообщения = ЗагрузитьСообщениеПоДаннымОбъекта(ДанныеОбъекта, ПроверенныеПодписи,
			КонтекстДиагностики, РезультатЗагрузкиДанных);
		
		Если ДанныеОбъекта.Отказ Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ДанныеОбъекта.Отказ = Истина;
		ТекстОшибки = НСтр("ru = 'Не удалось загрузить электронный документ по причине:'")
			+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		СинхронизацияЭДО.ОбработатьОшибкуЗагрузкиОбъекта(ДанныеОбъекта, КонтекстДиагностики, ТекстОшибки);
		Возврат;
	КонецПопытки;
	
	ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатЗагрузкиДанных.ИтогДействийПоЭДО, Перечисления.ДействияПоЭДО.Загрузить,
		РезультатЗагрузкиСообщения.ПараметрыДокумента.Ссылка);
	
	ПослеЗагрузкиСообщения(РезультатЗагрузкиСообщения, КонтекстДиагностики);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОбъектовПакета(ДанныеОбъектовПакета, ПроверенныеПодписи, КонтекстДиагностики, РезультатЗагрузки)
	
	РезультатыЗагрузкиСообщенийПакета = Новый Массив;
	Действие = Перечисления.ДействияПоЭДО.Загрузить;
	Отказ = Ложь;
	
	НачатьТранзакцию();
	Попытка
		
		ОписаниеПакета = НовоеОписаниеПакета();
		ОписаниеПакета.Дата = ТекущаяДатаСеанса();
		ОписаниеПакета.ИдентификаторПакета = Новый УникальныйИдентификатор;
		
		СоставПакета = РегистрыСведений.СоставПакетовДокументовЭДО.СоздатьНаборЗаписей();
		
		Для Каждого ДанныеОбъекта Из ДанныеОбъектовПакета.Значение Цикл
			
			РезультатЗагрузкиСообщения = ЗагрузитьСообщениеПоДаннымОбъекта(ДанныеОбъекта, ПроверенныеПодписи,
				КонтекстДиагностики, РезультатЗагрузки);
			Если ДанныеОбъекта.Отказ Тогда
				Отказ = Истина;
				Прервать;
			КонецЕсли;
			
			РезультатыЗагрузкиСообщенийПакета.Добавить(РезультатЗагрузкиСообщения);
			
			Если ДанныеОбъекта.ДатаСоздания < ОписаниеПакета.Дата Тогда
				ОписаниеПакета.Дата = ДанныеОбъекта.ДатаСоздания;
				ОписаниеПакета.Организация = ДанныеОбъекта.Организация;
				ОписаниеПакета.Контрагент = ДанныеОбъекта.Контрагент;
				ОписаниеПакета.ДоговорКонтрагента = ДанныеОбъекта.ДоговорКонтрагента;
			КонецЕсли;
			
			Если РезультатЗагрузкиСообщения.ЭтоНовыйДокумент Тогда
				НоваяЗапись = СоставПакета.Добавить();
				НоваяЗапись.ЭлектронныйДокумент = РезультатЗагрузкиСообщения.СообщениеОбъект.ЭлектронныйДокумент;
				НоваяЗапись.ИдентификаторПакета = ОписаниеПакета.ИдентификаторПакета;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Отказ Тогда
			ОтменитьТранзакцию();
		Иначе
			ОбновитьОписаниеПакета(ОписаниеПакета);
			
			Если СоставПакета.Количество() Тогда
				СоставПакета.Записать(Ложь);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		ОтменитьТранзакцию();
		Отказ = Истина;
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействияПоПакету(ДанныеОбъектовПакета.Ключ, Действие, ТекстОшибки, КонтекстДиагностики);
		Возврат;
	КонецПопытки;
	
	Если Отказ Тогда
		Для Каждого ДанныеОбъекта Из ДанныеОбъектовПакета.Значение Цикл
			ДанныеОбъекта.Отказ = Истина;
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Для Каждого РезультатЗагрузкиСообщения Из РезультатыЗагрузкиСообщенийПакета Цикл
		ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатЗагрузки.ИтогДействийПоЭДО, Действие,
		РезультатЗагрузкиСообщения.ПараметрыДокумента.Ссылка);
		ПослеЗагрузкиСообщения(РезультатЗагрузкиСообщения, КонтекстДиагностики);
	КонецЦикла;
	
КонецПроцедуры

Функция НовыйРезультатЗагрузкиСообщения()
	Результат = Новый Структура;
	Результат.Вставить("ЭтоНовыйДокумент", Ложь);
	Результат.Вставить("СостояниеДокумента", Перечисления.СостоянияДокументовЭДО.ПустаяСсылка());
	Результат.Вставить("ПараметрыДокумента", Неопределено);
	Результат.Вставить("СообщениеОбъект", Неопределено);
	Результат.Вставить("ИзвещениеОПолучении", Документы.СообщениеЭДО.ПустаяСсылка());
	Результат.Вставить("СообщенияПоДокументу", Новый ТаблицаЗначений);
	Возврат Результат;
КонецФункции

Функция ЗагрузитьСообщениеПоДаннымОбъекта(ДанныеОбъекта, ПроверенныеПодписи, КонтекстДиагностики, РезультатЗагрузкиДанных)
	
	Если ДанныеОбъекта.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.Ошибка Тогда
		
		Результат = ЗагрузитьОшибкуПередачи(ДанныеОбъекта, КонтекстДиагностики);
		
	ИначеЕсли ДанныеОбъекта.ЭтоОтветнаяПодпись Тогда
		
		Результат = ЗагрузитьОтветнуюПодпись(ДанныеОбъекта, ПроверенныеПодписи, КонтекстДиагностики);
		
	Иначе
		
		Результат = ЗагрузитьСообщениеДокумента(ДанныеОбъекта, ПроверенныеПодписи, КонтекстДиагностики);
		
	КонецЕсли;
	
	Если ДанныеОбъекта.Отказ Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеОбъекта.Контрагент) Тогда
		ДанныеОбъекта.Контрагент = Результат.ПараметрыДокумента.Контрагент;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеОбъекта.ИдентификаторОтправителя) Тогда
		ДанныеОбъекта.ИдентификаторОтправителя = Результат.ПараметрыДокумента.ИдентификаторКонтрагента;
	КонецЕсли;
	
	Если Результат.ЭтоНовыйДокумент Тогда
		
		ДобавитьСведенияЗагруженныхДокументов(РезультатЗагрузкиДанных.СведенияЗагруженныхДокументов,
			ДанныеОбъекта, Результат.ПараметрыДокумента);
		
	ИначеЕсли (Результат.СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОбменЗавершен
		ИЛИ Результат.СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОбменЗавершенСИсправлением
		ИЛИ Результат.СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.Аннулирован) Тогда
		
		ОтправитьНаОзнакомление(Результат.ПараметрыДокумента.Ссылка);
		
	ИначеЕсли Результат.ПараметрыДокумента.НаОзнакомлении Тогда
		
		ВернутьСОзнакомления(Результат.ПараметрыДокумента.Ссылка);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.ИзвещениеОПолучении) Тогда
		РезультатЗагрузкиДанных.СформированныеИзвещения.Добавить(Результат.ИзвещениеОПолучении);
	КонецЕсли;
	
	Сообщение = Документы.СообщениеЭДО.ПустаяСсылка();
	Если Результат.СообщениеОбъект <> Неопределено Тогда
		Сообщение = Результат.СообщениеОбъект.Ссылка;
	КонецЕсли;
	
	ЭлектронныеДокументыЭДОСобытия.ПриЗагрузкеСообщения(Сообщение, ДанныеОбъекта, КонтекстДиагностики);
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьОшибкуПередачи(ДанныеОбъекта, КонтекстДиагностики)
	
	Результат = НовыйРезультатЗагрузкиСообщения();
	
	Если Не ЗначениеЗаполнено(ДанныеОбъекта.ОшибкаПередачи) Тогда
		ДанныеОбъекта.Отказ = Истина;
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Отсутсвует информация об ошибке по документообороту с идентификатором %1'"),
			ДанныеОбъекта.ИдентификаторДокументооборота);
		СинхронизацияЭДО.ОбработатьОшибкуЗагрузкиОбъекта(ДанныеОбъекта, КонтекстДиагностики, ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПараметровОбновленияСостоянияПоИдентификатору();
	Запрос.УстановитьПараметр("ИдентификаторДокументооборота", ДанныеОбъекта.ИдентификаторДокументооборота);
	Запрос.УстановитьПараметр("ИдентификаторОрганизации", ДанныеОбъекта.ИдентификаторПолучателя);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ПараметрыДокумента = РезультатыЗапроса[0].Выбрать();
	Если Не ПараметрыДокумента.Следующий() Тогда
		ДанныеОбъекта.Отказ = Истина;
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не найден электронный документ владелец по документообороту с идентификатором %1'"),
			ДанныеОбъекта.ИдентификаторДокументооборота);
		СинхронизацияЭДО.ОбработатьОшибкуЗагрузкиОбъекта(ДанныеОбъекта, КонтекстДиагностики, ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	СостоянияСообщений = РезультатыЗапроса[1].Выгрузить();
	
	ДокументОбъект = ПараметрыДокумента.Ссылка.ПолучитьОбъект();
	ДокументОбъект.Остановлен = Истина;
	ДокументОбъект.ПричинаОстановки = ?(ДанныеОбъекта.ОшибкаПередачи.Блокирующая,
		Перечисления.ПричиныОстановкиЭДО.ОшибкаПередачиБлокирующая, 
		Перечисления.ПричиныОстановкиЭДО.ОшибкаПередачиНеблокирующая);
	
	ДатаИзменения = ТекущаяДатаСеанса();
	
	УстановитьСостояниеХранение(СостоянияСообщений, ДатаИзменения);
	
	Комментарий = ДанныеОбъекта.ОшибкаПередачи.Описание;
	
	СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(ДокументОбъект, СостоянияСообщений,
		ДатаИзменения, КонтекстДиагностики,,Комментарий);
	
	ЗаписатьДействиеВЖурнал(Перечисления.ДействияПоЭДО.Загрузить, ДокументОбъект, СостояниеДокумента,
		ДатаИзменения,, Комментарий);
	
	Результат.СостояниеДокумента = СостояниеДокумента;
	Результат.ПараметрыДокумента = ПараметрыДокумента;
	Результат.СообщенияПоДокументу = СостоянияСообщений;
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьОтветнуюПодпись(ДанныеОбъекта, ПроверенныеПодписи, КонтекстДиагностики)
	
	Результат = НовыйРезультатЗагрузкиСообщения();
	
	Сообщение = ДанныеОбъекта.Объект;
	
	Если Не ЗначениеЗаполнено(Сообщение) Тогда
		ДанныеОбъекта.Отказ = Истина;
		ТекстОшибки = НСтр("ru = 'Отсутсвует электронный документ для загрузки ответной подписи.'");
		СинхронизацияЭДО.ОбработатьОшибкуЗагрузкиОбъекта(ДанныеОбъекта, КонтекстДиагностики, ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	ОтветныеПодписи = ПроверенныеПодписи[ДанныеОбъекта.ИдентификаторСтроки];
	Если ОтветныеПодписи = Неопределено Тогда
		ДанныеОбъекта.Отказ = Истина;
		ТекстОшибки = НСтр("ru = 'Отсутсвует ответные подписи для загрузки.'");
		СинхронизацияЭДО.ОбработатьОшибкуЗагрузкиОбъекта(ДанныеОбъекта, КонтекстДиагностики, ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	СообщениеОбъект = ОбщегоНазначенияБЭД.ОбъектПоСсылкеДляИзменения(Сообщение);
	Если СообщениеОбъект.Направление <> Перечисления.НаправленияЭДО.Исходящий Тогда
		ДанныеОбъекта.Отказ = Истина;
		Возврат Результат;
	КонецЕсли;
	
	ЕстьНовыеПодписи = Ложь;
	УстановленныеПодписи = ЭлектроннаяПодпись.УстановленныеПодписи(СообщениеОбъект.ОсновнойФайл);
	Для Каждого СвойстваПодписи Из ОтветныеПодписи.ПодписиОсновныхДанных Цикл
		Если ЭтоНоваяПодпись(УстановленныеПодписи, СвойстваПодписи) Тогда
			ЕстьНовыеПодписи = Истина;
			ЭлектроннаяПодпись.ДобавитьПодпись(СообщениеОбъект.ОсновнойФайл, СвойстваПодписи);
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьНовыеПодписи Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЭтоВходящийЭДО = ЭтоВходящийЭДО(СообщениеОбъект.ЭлектронныйДокумент);
	
	ЗаблокироватьДанныеСообщенияДляИзменения(СообщениеОбъект, ЭтоВходящийЭДО);
	
	ТекстыЗапроса = Новый Массив;
	ТекстыЗапроса.Добавить(ТекстЗапросаПараметровОбновленияСостоянияПоИдентификатору());
	ТекстыЗапроса.Добавить(ТекстЗапросаКомментарияКСостояниюДокумента());
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос.УстановитьПараметр("ИдентификаторДокументооборота", ДанныеОбъекта.ИдентификаторДокументооборота);
	Запрос.УстановитьПараметр("ИдентификаторОрганизации", ДанныеОбъекта.ИдентификаторПолучателя);
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", СообщениеОбъект.ЭлектронныйДокумент);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ПараметрыДокумента = РезультатыЗапроса[0].Выбрать();
	ПараметрыДокумента.Следующий();
	СостоянияСообщений = РезультатыЗапроса[1].Выгрузить();
	
	СообщениеОбъект.Статус = Перечисления.СтатусыСообщенийЭДО.Подтвержден;
	СообщениеОбъект.ДатаИзмененияСтатуса = ТекущаяДатаСеанса();
	СообщениеОбъект.Состояние = РегламентыЭДО.СостояниеСообщения(СообщениеОбъект, ПараметрыДокумента);
	СообщениеОбъект.Записать();
	
	НайденнаяСтрока = СостоянияСообщений.Найти(СообщениеОбъект.Ссылка, "Ссылка");
	НайденнаяСтрока.Состояние = СообщениеОбъект.Состояние;
	
	Комментарий = КомментарийКСостояниюДокумента(РезультатыЗапроса[2]);
	
	СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(ПараметрыДокумента, СостоянияСообщений,
		СообщениеОбъект.ДатаИзмененияСтатуса, КонтекстДиагностики,,Комментарий);
	
	// Загрузим подпись в файл документа ДО
	ОбменСКонтрагентамиДОСлужебный.ЗагрузитьОтветнуюПодписьВФайлДО(СообщениеОбъект, ОтветныеПодписи);
	
	ЗаписатьДействиеВЖурнал(Перечисления.ДействияПоЭДО.Загрузить, ПараметрыДокумента, СостояниеДокумента,
		СообщениеОбъект.ДатаИзмененияСтатуса, СообщениеОбъект);
	
	Результат.СостояниеДокумента = СостояниеДокумента;
	Результат.ПараметрыДокумента = ПараметрыДокумента;
	Результат.СообщениеОбъект = СообщениеОбъект;
	Результат.СообщенияПоДокументу = СостоянияСообщений;
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьСообщениеДокумента(ДанныеОбъекта, ПроверенныеПодписи, КонтекстДиагностики)
	
	Результат = НовыйРезультатЗагрузкиСообщения();
	
	ПараметрыЗагрузки = ПараметрыЗагрузкиСообщения(ДанныеОбъекта, ПроверенныеПодписи, КонтекстДиагностики);
	
	Если ДанныеОбъекта.Отказ Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОписаниеСообщения = ПараметрыЗагрузки.ОписаниеСообщения;
	ПараметрыДокумента = ПараметрыЗагрузки.ПараметрыДокумента;
	
	Если ПараметрыЗагрузки.ЭтоНовыйДокумент Тогда
		ДокументОбъект = СоздатьВходящийДокумент(ПараметрыДокумента, ОписаниеСообщения,
			ПараметрыЗагрузки.ИдентификаторыОснований);
		ПараметрыЗагрузки.ПараметрыДокумента.Ссылка = ДокументОбъект.Ссылка;
		ДатаИзмененияСостояния = ДокументОбъект.Дата;
	Иначе
		ДатаИзмененияСостояния = ТекущаяДатаСеанса();
	КонецЕсли;
	
	СообщениеОбъект = СоздатьСообщение(ОписаниеСообщения,
		ПараметрыДокумента.Ссылка, ПараметрыДокумента);
	
	Если ЗначениеЗаполнено(ПараметрыЗагрузки.ПодписиОсновныхДанных) Тогда
		Для Каждого СвойстваПодписи Из ПараметрыЗагрузки.ПодписиОсновныхДанных Цикл
			ЭлектроннаяПодпись.ДобавитьПодпись(СообщениеОбъект.ОсновнойФайл, СвойстваПодписи);
		КонецЦикла;
	КонецЕсли;
	
	Если ОписаниеСообщения.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПОА
		ИЛИ ОписаниеСообщения.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.УОУ Тогда
		УстановитьСостояниеХранение(ПараметрыЗагрузки.СостоянияСообщений, СообщениеОбъект.ДатаИзмененияСтатуса);
	ИначеЕсли ОписаниеСообщения.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПОА_УОУ Тогда
		ПересчитатьСостоянияСообщений(ПараметрыЗагрузки.СостоянияСообщений, ПараметрыДокумента);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ПараметрыЗагрузки.СостоянияСообщений.Добавить(), СообщениеОбъект);
	
	Если ПараметрыЗагрузки.ЭтоНовыйДокумент Тогда
		
		Если ЗначениеЗаполнено(ДокументОбъект.ИдентификаторыОснований)
			И ЗначениеЗаполнено(ОписаниеСообщения.Данные.Содержание) Тогда
			ОбновитьСвязанныеДокументы(ОписаниеСообщения.Данные.Содержание.ТипДокумента,
				ДокументОбъект.ИдентификаторыОснований.Выгрузить(), ПараметрыЗагрузки.Действие,
				КонтекстДиагностики, ПараметрыЗагрузки.ЭтоВходящийЭДО);
		КонецЕсли;
		
		ДополненияСостоянийЭДО = Неопределено;
		Если СообщениеОбъект.Состояние = Перечисления.СостоянияСообщенийЭДО.Подписание Тогда
			ПараметрыМаршрута = СформироватьМаршрутПодписания(СообщениеОбъект);
			ДополненияСостоянийЭДО = ДополненияСостоянийЭДОПриПодписании(СообщениеОбъект,
				ПараметрыДокумента.ВидПодписи, ПараметрыМаршрута.ВесМаршрута);
			ПараметрыОповещенияПодписантов = Новый Структура("СообщениеОбъект, ТаблицаПодписания",
				СообщениеОбъект, ПараметрыМаршрута.ТаблицаПодписания);
			ПараметрыЗагрузки.ОповещенияПодписантов.Добавить(ПараметрыОповещенияПодписантов);
		КонецЕсли;
		
		СостояниеДокумента = УстановитьСостояниеДокументаПриЗагрузке(ПараметрыДокумента,
			ПараметрыЗагрузки.СостоянияСообщений, ДатаИзмененияСостояния, КонтекстДиагностики, ДополненияСостоянийЭДО);
	Иначе
		СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(ПараметрыДокумента,
			ПараметрыЗагрузки.СостоянияСообщений, ДатаИзмененияСостояния, КонтекстДиагностики);
	КонецЕсли;
	
	ЗаписатьДействиеВЖурнал(ПараметрыЗагрузки.Действие, ПараметрыДокумента, СостояниеДокумента,
		СообщениеОбъект.ДатаИзмененияСтатуса, СообщениеОбъект);
	
	Если ЗначениеЗаполнено(ПараметрыЗагрузки.ТипИзвещения) Тогда
		ИзвещениеОбъект = СоздатьИзвещениеОПолучении(СообщениеОбъект, ПараметрыЗагрузки, КонтекстДиагностики);
		Если ИзвещениеОбъект <> Неопределено Тогда
			Результат.ИзвещениеОПолучении = ИзвещениеОбъект.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеОбъекта.Объект = СообщениеОбъект.Ссылка;
	
	Результат.ЭтоНовыйДокумент = ПараметрыЗагрузки.ЭтоНовыйДокумент;
	Результат.СостояниеДокумента = СостояниеДокумента;
	Результат.ПараметрыДокумента = ПараметрыЗагрузки.ПараметрыДокумента;
	Результат.СообщениеОбъект = СообщениеОбъект;
	Результат.СообщенияПоДокументу = ПараметрыЗагрузки.СостоянияСообщений;
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыЗагрузкиСообщения(ДанныеОбъекта, ПроверенныеПодписи, КонтекстДиагностики)
	
	ОписаниеСообщения = НовоеОписаниеСообщения();
	ПараметрыДокумента = НовыеПараметрыДокументаДляЗагрузки();
	
	Результат = Новый Структура;
	Результат.Вставить("Действие", Перечисления.ДействияПоЭДО.Загрузить);
	Результат.Вставить("ОписаниеСообщения", ОписаниеСообщения);
	Результат.Вставить("ПодписиОсновныхДанных");
	Результат.Вставить("ПодписиДополнительныхДанных");
	Результат.Вставить("ЭтоНовыйДокумент", Ложь);
	Результат.Вставить("ЭтоВходящийЭДО", Ложь);
	Результат.Вставить("ПараметрыДокумента", ПараметрыДокумента);
	Результат.Вставить("СостоянияСообщений");
	Результат.Вставить("ТипИзвещения", Перечисления.ТипыЭлементовРегламентаЭДО.ПустаяСсылка());
	Результат.Вставить("СостояниеДокумента", Перечисления.СостоянияДокументовЭДО.ПустаяСсылка());
	Результат.Вставить("ОповещенияПодписантов", Новый Массив);
	Результат.Вставить("ИдентификаторыОснований");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПараметровОбновленияСостоянияПоИдентификатору();
	Запрос.УстановитьПараметр("ИдентификаторДокументооборота", ДанныеОбъекта.ИдентификаторДокументооборота);
	Запрос.УстановитьПараметр("ИдентификаторОрганизации", ДанныеОбъекта.ИдентификаторПолучателя);
	
	ИдентификаторыОснований = ИдентификаторыОснованийПоДаннымСообщения(ДанныеОбъекта);
	Если ЗначениеЗаполнено(ИдентификаторыОснований) Тогда
		ТекстыЗапроса = Новый Массив;
		ТекстыЗапроса.Добавить(Запрос.Текст);
		ТекстыЗапроса.Добавить(ТекстЗапросаСверткиИдентификаторовОснований());
		Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
		Запрос.УстановитьПараметр("ИдентификаторыОснований", ИдентификаторыОснований);
	КонецЕсли;
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Результат.ЭтоНовыйДокумент = РезультатыЗапроса[0].Пустой();
	
	Результат.СостоянияСообщений = РезультатыЗапроса[1].Выгрузить();
	ЭтоДубль = Результат.СостоянияСообщений.Найти(ДанныеОбъекта.ТипЭлементаРегламента,
		"ТипЭлементаРегламента") <> Неопределено;
	
	Если ЭтоДубль Тогда
		ДанныеОбъекта.Отказ = Истина;
		ТекстОшибки = СтрШаблон(НСтр("ru = '%1 уже существует в документообороте %2'"),
			ДанныеОбъекта.ТипЭлементаРегламента, ДанныеОбъекта.ИдентификаторДокументооборота);
		СинхронизацияЭДО.ОбработатьОшибкуЗагрузкиОбъекта(ДанныеОбъекта, КонтекстДиагностики, ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	ОписаниеСообщения.ТипЭлементаРегламента = ДанныеОбъекта.ТипЭлементаРегламента;
	ОписаниеСообщения.Направление = Перечисления.НаправленияЭДО.Входящий;
	ОписаниеСообщения.ВидСообщения = ДанныеОбъекта.ВидДокумента;
	ОписаниеСообщения.ДополнительнаяИнформация = ДанныеОбъекта.СопроводительнаяЗаписка;
	ОписаниеСообщения.Данные.Документ = ДанныеОбъекта.ОписаниеДанных;
	Если ЗначениеЗаполнено(ДанныеОбъекта.ОписаниеДополнительныхДанных) Тогда
		ОписаниеСообщения.Данные.ДополнительныйДокумент = ДанныеОбъекта.ОписаниеДополнительныхДанных;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторыОснований) Тогда
		Результат.ИдентификаторыОснований = РезультатыЗапроса[3].Выгрузить();
	КонецЕсли;
	
	ПодписиОбъекта = ПроверенныеПодписи[ДанныеОбъекта.ИдентификаторСтроки];
	Если ПодписиОбъекта <> Неопределено Тогда
		Результат.ПодписиОсновныхДанных = ПодписиОбъекта.ПодписиОсновныхДанных;
		Результат.ПодписиДополнительныхДанных = ПодписиОбъекта.ПодписиДополнительныхДанных;
	Иначе
		Результат.ПодписиОсновныхДанных = СвойстваПодписейДанныхДокумента(ДанныеОбъекта.ПодписиОсновныхДанных);
		Результат.ПодписиДополнительныхДанных = СвойстваПодписейДанныхДокумента(
			ДанныеОбъекта.ПодписиДополнительныхДанных);
	КонецЕсли;
	
	Если ДанныеОбъекта.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя Тогда
		
		ОписаниеСообщения.Данные.Содержание = ДанныеОбъекта.Содержание;
		
		ПараметрыДокумента.ИдентификаторДокументооборота = ДанныеОбъекта.ИдентификаторДокументооборота;
		ПараметрыДокумента.ИдентификаторОрганизации = ДанныеОбъекта.ИдентификаторПолучателя;
		ПараметрыДокумента.ИдентификаторКонтрагента = ДанныеОбъекта.ИдентификаторОтправителя;
		ПараметрыДокумента.ИдентификаторСвязи = ДанныеОбъекта.ИдентификаторСообщения;
		ПараметрыДокумента.Организация = ДанныеОбъекта.Организация;
		ПараметрыДокумента.Контрагент = ДанныеОбъекта.Контрагент;
		ПараметрыДокумента.СпособОбмена = ДанныеОбъекта.СпособОбмена;
		ПараметрыДокумента.ВидДокумента = ДанныеОбъекта.ВидДокумента;
		ПараметрыДокумента.ТипДокумента = ДанныеОбъекта.ТипДокумента;
		ПараметрыДокумента.ТипРегламента = ДанныеОбъекта.ТипРегламента;
		ПараметрыДокумента.ОбменБезПодписи = Не ЗначениеЗаполнено(ДанныеОбъекта.ПодписиОсновныхДанных);
		ПараметрыДокумента.ТребуетсяИзвещение = ДанныеОбъекта.ТребуетсяИзвещение;
		ПараметрыДокумента.ТребуетсяПодтверждение = ДанныеОбъекта.ТребуетсяПодтверждение;
		
		Результат.ЭтоВходящийЭДО = Истина;
		
	Иначе
		
		Если Результат.ЭтоНовыйДокумент Тогда
			ДанныеОбъекта.Отказ = Истина;
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Не найден ЭлектронныйДокумент по идентификатору %1'"),
				ДанныеОбъекта.ИдентификаторДокументооборота);
			СинхронизацияЭДО.ОбработатьОшибкуЗагрузкиОбъекта(ДанныеОбъекта, КонтекстДиагностики, ТекстОшибки);
			Возврат Результат;
		КонецЕсли;
		
		Выборка = РезультатыЗапроса[0].Выбрать();
		Выборка.Следующий();
		Результат.ПараметрыДокумента.Ссылка = Выборка.Ссылка;
		ЗаполнитьЗначенияСвойств(ПараметрыДокумента, Выборка);
		Результат.ЭтоВходящийЭДО = ЭтоВходящийЭДО(Выборка.Ссылка);
		
		Если ДанныеОбъекта.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя Тогда
			ОписаниеСообщения.ВидСообщения = Выборка.ВидДокумента;
		ИначеЕсли Не ЗначениеЗаполнено(ОписаниеСообщения.ВидСообщения) Тогда
			ПараметрыПоиска = НовыеПараметрыПоискаВидаДокумента(ДанныеОбъекта.ТипДокумента);
			ОписаниеСообщения.ВидСообщения = НайтиСоздатьВидДокумента(ПараметрыПоиска);
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.ТипИзвещения = РегламентыЭДО.ТипИзвещенияДляЭлементаРегламента(
		ОписаниеСообщения.ТипЭлементаРегламента, ПараметрыДокумента, Результат.ЭтоВходящийЭДО);
	
	Возврат Результат;
	
КонецФункции

Функция НовыеПараметрыДокументаДляЗагрузки()
	Параметры = Новый Структура;
	Параметры.Вставить("Ссылка", Неопределено);
	Параметры.Вставить("ИдентификаторДокументооборота", "");
	Параметры.Вставить("ИдентификаторОрганизации", "");
	Параметры.Вставить("ИдентификаторКонтрагента", "");
	Параметры.Вставить("ИдентификаторСвязи", "");
	Параметры.Вставить("Организация", Неопределено);
	Параметры.Вставить("Контрагент", Неопределено);
	Параметры.Вставить("ДоговорКонтрагента", Неопределено);
	Параметры.Вставить("СпособОбмена", Перечисления.СпособыОбменаЭД.ПустаяСсылка());
	Параметры.Вставить("ТипРегламента", Перечисления.ТипыРегламентовЭДО.ПустаяСсылка());
	Параметры.Вставить("ОбменБезПодписи", Ложь);
	Параметры.Вставить("ТребуетсяИзвещение", Ложь);
	Параметры.Вставить("ТребуетсяПодтверждение", Ложь);
	Параметры.Вставить("Исправлен", Ложь);
	Параметры.Вставить("НаОзнакомлении", Ложь);
	Параметры.Вставить("Остановлен", Ложь);
	Параметры.Вставить("ПричинаОстановки", Перечисления.ПричиныОстановкиЭДО.ПустаяСсылка());
	Параметры.Вставить("ВидПодписи", Перечисления.ВидыЭлектронныхПодписей.ПустаяСсылка());
	Параметры.Вставить("Ответственный", Неопределено);
	Параметры.Вставить("ТипДокумента", Перечисления.ТипыДокументовЭДО.ПустаяСсылка());
	Параметры.Вставить("ВидДокумента", Справочники.ВидыДокументовЭДО.ПустаяСсылка());
	Возврат Параметры;
КонецФункции

Функция СвойстваПодписейДанныхДокумента(ДанныеПодписей)
	
	Результат = Новый Массив;
	Если Не ЗначениеЗаполнено(ДанныеПодписей) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ДанныеПодписи Из ДанныеПодписей Цикл
		СвойстваПодписи = КриптографияБЭДКлиентСервер.НовыеСвойстваПодписи();
		СвойстваПодписи.Подпись = ДанныеПодписи.ДвоичныеДанные;
		СвойстваПодписи.ИмяФайлаПодписи = ДанныеПодписи.ИмяФайла;
		Результат.Добавить(СвойстваПодписи);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыОснованийПоДаннымСообщения(ДанныеСообщения)
	
	Если ДанныеСообщения.ТипЭлементаРегламента <> Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя
		ИЛИ Не ЗначениеЗаполнено(ДанныеСообщения.ИдентификаторыСообщенийОснований)
			И Не ЗначениеЗаполнено(ДанныеСообщения.ИдентификаторыДокументооборотовОснований) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеТиповСТрока100 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100));
	ИдентификаторыОснований = Новый ТаблицаЗначений;
	ИдентификаторыОснований.Колонки.Добавить("ИдентификаторСвязи", ОписаниеТиповСТрока100);
	ИдентификаторыОснований.Колонки.Добавить("ИдентификаторДокументооборота", ОписаниеТиповСТрока100);
	
	Если ЗначениеЗаполнено(ДанныеСообщения.ИдентификаторыСообщенийОснований) Тогда
		Для Каждого ИдентификаторСообщения Из ДанныеСообщения.ИдентификаторыСообщенийОснований Цикл
			ИдентификаторыОснований.Добавить().ИдентификаторСвязи = ИдентификаторСообщения;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСообщения.ИдентификаторыДокументооборотовОснований) Тогда
		Для Каждого ИдентификаторДокументооборота Из ДанныеСообщения.ИдентификаторыДокументооборотовОснований Цикл
			ИдентификаторыОснований.Добавить().ИдентификаторДокументооборота = ИдентификаторДокументооборота;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ИдентификаторыОснований;
	
КонецФункции

Функция ТекстЗапросаСверткиИдентификаторовОснований()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ИдентификаторыОснований.ИдентификаторСвязи КАК ИдентификаторСвязи,
		|	ИдентификаторыОснований.ИдентификаторДокументооборота КАК ИдентификаторДокументооборота
		|ПОМЕСТИТЬ ВТ_ИдентификаторыОснований
		|ИЗ
		|	&ИдентификаторыОснований КАК ИдентификаторыОснований
		|;
		|
		|
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ДокументЭДО.ИдентификаторСвязи, ВТ_ИдентификаторыОснований.ИдентификаторСвязи) КАК ИдентификаторСвязи,
		|	ЕСТЬNULL(ДокументЭДО.ИдентификаторДокументооборота, ВТ_ИдентификаторыОснований.ИдентификаторДокументооборота) КАК
		|		ИдентификаторДокументооборота
		|ИЗ
		|	ВТ_ИдентификаторыОснований КАК ВТ_ИдентификаторыОснований
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящийЭДО КАК ДокументЭДО
		|		ПО ВТ_ИдентификаторыОснований.ИдентификаторДокументооборота = ДокументЭДО.ИдентификаторДокументооборота
		|		И ВТ_ИдентификаторыОснований.ИдентификаторДокументооборота <> """"
		|ГДЕ
		|	ВТ_ИдентификаторыОснований.ИдентификаторДокументооборота <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ДокументЭДО.ИдентификаторСвязи, ВТ_ИдентификаторыОснований.ИдентификаторСвязи) КАК ИдентификаторСвязи,
		|	ЕСТЬNULL(ДокументЭДО.ИдентификаторДокументооборота, ВТ_ИдентификаторыОснований.ИдентификаторДокументооборота) КАК
		|		ИдентификаторДокументооборота
		|ИЗ
		|	ВТ_ИдентификаторыОснований КАК ВТ_ИдентификаторыОснований
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящийЭДО КАК ДокументЭДО
		|		ПО ВТ_ИдентификаторыОснований.ИдентификаторСвязи = ДокументЭДО.ИдентификаторСвязи
		|		И ВТ_ИдентификаторыОснований.ИдентификаторСвязи <> """"
		|		И ВТ_ИдентификаторыОснований.ИдентификаторДокументооборота = """"
		|ГДЕ
		|	ВТ_ИдентификаторыОснований.ИдентификаторДокументооборота = """"
		|	И ВЫБОР
		|		КОГДА ДокументЭДО.ИдентификаторДокументооборота ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ
		|			НЕ ДокументЭДО.ИдентификаторДокументооборота В
		|				(ВЫБРАТЬ
		|					ИдентификаторДокументооборота
		|				ИЗ
		|					ВТ_ИдентификаторыОснований
		|				ГДЕ
		|					ВТ_ИдентификаторыОснований.ИдентификаторДокументооборота <> """")
		|	КОНЕЦ";
		
	Возврат ТекстЗапроса;
		
КонецФункции

Функция СоздатьВходящийДокумент(ПараметрыФормирования, ОписаниеСообщения, ИдентификаторыОснований = Неопределено)
	
	ДокументОбъект = Документы.ЭлектронныйДокументВходящийЭДО.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.ИдентификаторДокументооборота = ПараметрыФормирования.ИдентификаторДокументооборота;
	ДокументОбъект.ИдентификаторОрганизации = ПараметрыФормирования.ИдентификаторОрганизации;
	ДокументОбъект.ИдентификаторКонтрагента = ПараметрыФормирования.ИдентификаторКонтрагента;
	ДокументОбъект.ИдентификаторСвязи = ПараметрыФормирования.ИдентификаторСвязи;
	ДокументОбъект.Организация = ПараметрыФормирования.Организация;
	ДокументОбъект.Контрагент = ПараметрыФормирования.Контрагент;
	ДокументОбъект.ДоговорКонтрагента = ПараметрыФормирования.ДоговорКонтрагента;
	ДокументОбъект.СпособОбмена = ПараметрыФормирования.СпособОбмена;
	ДокументОбъект.ТипРегламента = ПараметрыФормирования.ТипРегламента;
	ДокументОбъект.ОбменБезПодписи = ПараметрыФормирования.ОбменБезПодписи;
	ДокументОбъект.ТребуетсяИзвещение = ПараметрыФормирования.ТребуетсяИзвещение;
	ДокументОбъект.ТребуетсяПодтверждение = ПараметрыФормирования.ТребуетсяПодтверждение;
	ДокументОбъект.Ответственный = ИнтеграцияЭДО.ОтвественныйПоДокументуЭДО(
		ДокументОбъект.Организация, ДокументОбъект.Контрагент, ДокументОбъект.ДоговорКонтрагента);
	
	ДокументОбъект.ВидДокумента = ОписаниеСообщения.ВидСообщения;
	Если ЗначениеЗаполнено(ОписаниеСообщения.Данные.Содержание) Тогда
		СодержаниеСообщения = ОписаниеСообщения.Данные.Содержание;
		ДокументОбъект.НомерДокумента = СодержаниеСообщения.НомерДокумента;
		ДокументОбъект.ДатаДокумента = СодержаниеСообщения.ДатаДокумента;
		ДокументОбъект.СуммаДокумента = СодержаниеСообщения.СуммаДокумента;
		ДокументОбъект.СодержитМаркируемыеТовары = СодержаниеСообщения.ЕстьМаркировка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторыОснований) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИдентификаторыОснований, ДокументОбъект.ИдентификаторыОснований);
	КонецЕсли;
	
	Если Не ДокументОбъект.ПроверитьЗаполнение() Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка заполнения входящего электронного документа'");
	КонецЕсли;
	
	ДокументОбъект.Записать();
	
	Возврат ДокументОбъект;
	
КонецФункции

Функция НовыеСведенияЗагруженныхДокументов()
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("ЭлектронныйДокумент", Новый ОписаниеТипов(
		"ДокументСсылка.ЭлектронныйДокументИсходящийЭДО, ДокументСсылка.ЭлектронныйДокументВходящийЭДО"));
	Результат.Колонки.Добавить("ВидДокумента", Новый ОписаниеТипов("СправочникСсылка.ВидыДокументовЭДО"));
	Результат.Колонки.Добавить("ТипДокумента", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыДокументовЭДО"));
	Результат.Колонки.Добавить("Организация", Неопределено);
	Результат.Колонки.Добавить("Контрагент",  Неопределено);
	Результат.Колонки.Добавить("ИдентификаторОтправителя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИдентификаторПолучателя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОписаниеДанных", Новый ОписаниеТипов("Структура"));
	Результат.Колонки.Добавить("ОписаниеДополнительныхДанных", Новый ОписаниеТипов("Структура"));
	Возврат Результат;
КонецФункции

Процедура ДобавитьСведенияЗагруженныхДокументов(СведенияЗагруженныхДокументов, ДанныеОбъектаКонтейнера, ПараметрыДокумента)
	НоваяСтрока = СведенияЗагруженныхДокументов.Добавить();
	НоваяСтрока.ЭлектронныйДокумент = ПараметрыДокумента.Ссылка;
	НоваяСтрока.ВидДокумента = ПараметрыДокумента.ВидДокумента;
	НоваяСтрока.ТипДокумента = ПараметрыДокумента.ТипДокумента;
	НоваяСтрока.Организация = ПараметрыДокумента.Организация;
	НоваяСтрока.Контрагент = ПараметрыДокумента.Контрагент;
	НоваяСтрока.ИдентификаторОтправителя = ПараметрыДокумента.ИдентификаторКонтрагента;
	НоваяСтрока.ИдентификаторПолучателя = ПараметрыДокумента.ИдентификаторОрганизации;
	НоваяСтрока.ОписаниеДанных = ДанныеОбъектаКонтейнера.ОписаниеДанных;
	НоваяСтрока.ОписаниеДополнительныхДанных = ДанныеОбъектаКонтейнера.ОписаниеДополнительныхДанных;
КонецПроцедуры

Функция СоздатьИзвещениеОПолучении(Основание, ПараметрыЗагрузки, КонтекстДиагностики)
	
	СвойстваОсновногоФайла = СвойстваФайлаОснованияСлужебногоДокумента();
	СвойстваОсновногоФайла.Ссылка = Основание.ОсновнойФайл;
	СвойстваОсновногоФайла.ПолноеИмяФайла = ПараметрыЗагрузки.ОписаниеСообщения.Данные.Документ.ИмяФайла;
	СвойстваОсновногоФайла.ДатаСоздания = Основание.Дата;
	
	ИзвещениеОбъект = СоздатьСлужебноеСообщение(ПараметрыЗагрузки.ПараметрыДокумента, 
		СвойстваОсновногоФайла, Перечисления.ТипыДокументовЭДО.ИзвещениеОПолучении, ПараметрыЗагрузки.ТипИзвещения);
	
	Если ИзвещениеОбъект = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ПараметрыЗагрузки.СостоянияСообщений.Добавить(), ИзвещениеОбъект);
	
	ДополненияСостоянийЭДО = Неопределено;
	Если Не ПараметрыЗагрузки.ПараметрыДокумента.ОбменБезПодписи Тогда
		
		ПараметрыМаршрута = СформироватьМаршрутПодписания(ИзвещениеОбъект);
		
		Если ЗначениеЗаполнено(ПараметрыМаршрута.ТаблицаПодписания) Тогда
			ПараметрыОповещенияПодписантов = Новый Структура("СообщениеОбъект, ТаблицаПодписания",
				ИзвещениеОбъект, ПараметрыМаршрута.ТаблицаПодписания);
			ПараметрыЗагрузки.ОповещенияПодписантов.Добавить(ПараметрыОповещенияПодписантов);
		КонецЕсли;
		
		ДополненияСостоянийЭДО = ДополненияСостоянийЭДОПриПодписании(ИзвещениеОбъект,
			ПараметрыЗагрузки.ПараметрыДокумента.ВидПодписи, ПараметрыМаршрута.ВесМаршрута);
		
	КонецЕсли;
	
	СостояниеДокумента = УстановитьСостояниеДокументаПриИзменении(ПараметрыЗагрузки.ПараметрыДокумента,
		ПараметрыЗагрузки.СостоянияСообщений, ИзвещениеОбъект.ДатаИзмененияСтатуса, КонтекстДиагностики,
		ДополненияСостоянийЭДО);
	
	ЗаписатьДействиеВЖурнал(ПараметрыЗагрузки.Действие, ПараметрыЗагрузки.ПараметрыДокумента, СостояниеДокумента,
		ИзвещениеОбъект.ДатаИзмененияСтатуса, ИзвещениеОбъект);
	
	Возврат ИзвещениеОбъект;
	
КонецФункции

Процедура ЗаблокироватьДанныеДокументаПриЗагрузке(ДанныеСообщения)
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("Документ.ЭлектронныйДокументВходящийЭДО");
	ЭлементБлокировки.УстановитьЗначение("ИдентификаторДокументооборота",
		ДанныеСообщения.ИдентификаторДокументооборота);
	
	ЭлементБлокировки = Блокировка.Добавить("Документ.ЭлектронныйДокументИсходящийЭДО");
	ЭлементБлокировки.УстановитьЗначение("ИдентификаторДокументооборота",
		ДанныеСообщения.ИдентификаторДокументооборота);
	
	Блокировка.Заблокировать();
	
КонецПроцедуры

Процедура ОтправитьНаОзнакомление(ЭлектронныйДокумент)
	
	Если НастройкиЭДО.ОзнакомлениеСЭлектроннымиДокументами() Тогда
		ДокументОбъект = ЭлектронныйДокумент.ПолучитьОбъект();
		ДокументОбъект.НаОзнакомлении = Истина;
		ДокументОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВернутьСОзнакомления(ЭлектронныйДокумент)
	ДокументОбъект = ЭлектронныйДокумент.ПолучитьОбъект();
	ДокументОбъект.НаОзнакомлении = Ложь;
	ДокументОбъект.Записать();
КонецПроцедуры

#КонецОбласти

#Область ОповещенияОСобытиях

Процедура ПослеЗагрузкиСообщения(РезультатЗагрузкиСообщения, КонтекстДиагностики)
	
	СостояниеДокумента = РезультатЗагрузкиСообщения.СостояниеДокумента;
	ПараметрыДокумента = РезультатЗагрузкиСообщения.ПараметрыДокумента;
	
	Если СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОбменЗавершен
		ИЛИ СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОбменЗавершенСИсправлением Тогда
		
		ЭлектронныеДокументыЭДОСобытия.ПослеЗавершенияОбменаЭлектроннымДокументом(
			ПараметрыДокумента.Ссылка, КонтекстДиагностики);
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.Аннулирован Тогда
		
		ЭлектронныеДокументыЭДОСобытия.ПослеАннулированияЭлектронногоДокумента(
			ПараметрыДокумента.Ссылка, КонтекстДиагностики);
		
	КонецЕсли;
	
	Если РезультатЗагрузкиСообщения.СообщениеОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипДокумента = ПараметрыДокумента.ТипДокумента;
	ТипЭлементаРегламента = РезультатЗагрузкиСообщения.СообщениеОбъект.ТипЭлементаРегламента;
	
	Если (ТипДокумента = Перечисления.ТипыДокументовЭДО.УПД
			ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетФактура)
		И (ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПДП
			ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПДО
			ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИОП
			ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИОП_ПДО) Тогда
		
		ДокументыПодтверждения = Новый ТаблицаЗначений;
		ДокументыПодтверждения.Колонки.Добавить("ТипЭлементаРегламента",
			Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЭлементовРегламентаЭДО"));
		ДокументыПодтверждения.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата", , ,
			Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		ДокументыПодтверждения.Колонки.Добавить("Текущий", Новый ОписаниеТипов("Булево"));
		
		Для Каждого СтрокаТаблицы Из РезультатЗагрузкиСообщения.СообщенияПоДокументу Цикл
			
			Если СтрокаТаблицы.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПДП
				ИЛИ СтрокаТаблицы.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПДО
				ИЛИ СтрокаТаблицы.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИОП
				ИЛИ СтрокаТаблицы.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИОП_ПДО Тогда
				
				НоваяСтрока = ДокументыПодтверждения.Добавить();
				НоваяСтрока.ТипЭлементаРегламента = СтрокаТаблицы.ТипЭлементаРегламента;
				НоваяСтрока.Дата = СтрокаТаблицы.Дата;
				НоваяСтрока.Текущий = ТипЭлементаРегламента = СтрокаТаблицы.ТипЭлементаРегламента;
			КонецЕсли;
			
		КонецЦикла;
		
		ЭлектронныеДокументыЭДОСобытия.ПослеЗагрузкиПодтвержденияПоСчетуФактуре(ПараметрыДокумента.Ссылка,
			ДокументыПодтверждения, КонтекстДиагностики);
		
	КонецЕсли;
	
	// Добавим в очередь приема Документооборота
	Если ОбменСКонтрагентамиДОСлужебный.НеобходимоДобавитьВОчередь(РезультатЗагрузкиСообщения.СообщениеОбъект) Тогда
		РегистрыСведений.ОчередьПриемаСообщенийЭДО.ДобавитьЗапись(РезультатЗагрузкиСообщения.СообщениеОбъект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЖурналДействий

Процедура ЗаписатьДействиеВЖурнал(Действие, СвойстваДокумента, СостояниеДокумента, ДатаИзменения, СвойстваСообщения, Комментарий = "")
	
	УстановитьПривилегированныйРежим(Истина);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЖурналДействийПоЭДО");
	ЭлементБлокировки.УстановитьЗначение("ЭлектронныйДокумент", СвойстваДокумента.Ссылка);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЖурналДействийПоЭДО.НомерЗаписи КАК НомерЗаписи
			|ИЗ
			|	РегистрСведений.ЖурналДействийПоЭДО КАК ЖурналДействийПоЭДО
			|ГДЕ
			|	ЖурналДействийПоЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент
			|УПОРЯДОЧИТЬ ПО
			|	НомерЗаписи УБЫВ";
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", СвойстваДокумента.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			НомерЗаписи = 1;
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			НомерЗаписи = Выборка.НомерЗаписи + 1;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.ЖурналДействийПоЭДО.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ЭлектронныйДокумент = СвойстваДокумента.Ссылка;
		МенеджерЗаписи.НомерЗаписи = НомерЗаписи;
		МенеджерЗаписи.Действие = Действие;
		МенеджерЗаписи.ДатаИзменения = ДатаИзменения;
		МенеджерЗаписи.СостояниеДокумента = СостояниеДокумента;
		МенеджерЗаписи.Ответственный = СвойстваДокумента.Ответственный;
		МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
		МенеджерЗаписи.Комментарий = Комментарий;
		
		Если СвойстваСообщения <> Неопределено Тогда
			МенеджерЗаписи.Сообщение = СвойстваСообщения.Ссылка;
			МенеджерЗаписи.СтатусСообщения = СвойстваСообщения.Статус;
		КонецЕсли;
		
		МенеджерЗаписи.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПриглашениями

Процедура ВозобновитьДокументыПослеПолученияСогласияПоПриглашению(ИдентификаторОрганизации, ИдентификаторКонтрагента, КонтекстДиагностики)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭлектронныйДокументВходящийЭДО.Ссылка КАК ЭлектронныйДокумент
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|ГДЕ
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторОрганизации = &ИдентификаторОрганизации
		|	И ЭлектронныйДокументВходящийЭДО.ИдентификаторКонтрагента = &ИдентификаторКонтрагента
		|	И ЭлектронныйДокументВходящийЭДО.Остановлен
		|	И ЭлектронныйДокументВходящийЭДО.ПричинаОстановки В (&ПричиныОстановки)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭлектронныйДокументИсходящийЭДО.Ссылка КАК ЭлектронныйДокумент
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|ГДЕ
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторОрганизации = &ИдентификаторОрганизации
		|	И ЭлектронныйДокументИсходящийЭДО.ИдентификаторКонтрагента = &ИдентификаторКонтрагента
		|	И ЭлектронныйДокументИсходящийЭДО.Остановлен
		|	И ЭлектронныйДокументИсходящийЭДО.ПричинаОстановки В (&ПричиныОстановки)";
	
	Запрос.УстановитьПараметр("ИдентификаторОрганизации", ИдентификаторОрганизации);
	Запрос.УстановитьПараметр("ИдентификаторКонтрагента", ИдентификаторКонтрагента);
	
	ПричиныОстановки = Новый Массив;
	ПричиныОстановки.Добавить(Перечисления.ПричиныОстановкиЭДО.ТребуетсяОтправкаПриглашения);
	ПричиныОстановки.Добавить(Перечисления.ПричиныОстановкиЭДО.ОжидаетсяОтветНаПриглашение);
	ПричиныОстановки.Добавить(Перечисления.ПричиныОстановкиЭДО.ОтклонениеПриглашения);
	Запрос.УстановитьПараметр("ПричиныОстановки", ПричиныОстановки);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыполнения = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	
	Действие = Перечисления.ДействияПоЭДО.Загрузить;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ВозобновитьДокумент(Выборка.ЭлектронныйДокумент, Действие, КонтекстДиагностики) Тогда
			ПараметрыВыполнения.ОбъектыДействий.ЭлектронныеДокументы.Добавить(Выборка.ЭлектронныйДокумент);
		КонецЕсли;
	КонецЦикла;
	
	ДобавитьДействие(ПараметрыВыполнения.НаборДействий, Перечисления.ДействияПоЭДО.ПодготовитьКОтправке);
	ВыполнитьДействияПоЭДО(ПараметрыВыполнения, КонтекстДиагностики);
	
КонецПроцедуры

Процедура ОстановитьДокументыПослеИзмененияПриглашения(ИдентификаторОрганизации, ИдентификаторКонтрагента, ПричинаОстановки, КонтекстДиагностики)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭлектронныйДокументВходящийЭДО.Ссылка КАК ЭлектронныйДокумент
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ПО СообщениеЭДО.ЭлектронныйДокумент = ЭлектронныйДокументВходящийЭДО.Ссылка
		|		И ЭлектронныйДокументВходящийЭДО.ИдентификаторОрганизации = &ИдентификаторОрганизации
		|		И ЭлектронныйДокументВходящийЭДО.ИдентификаторКонтрагента = &ИдентификаторКонтрагента
		|		И НЕ ЭлектронныйДокументВходящийЭДО.Остановлен
		|		И СообщениеЭДО.Состояние = &СостояниеДокумента
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЭлектронныйДокументИсходящийЭДО.Ссылка КАК ЭлектронныйДокумент
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ПО ЭлектронныйДокументИсходящийЭДО.Ссылка = СообщениеЭДО.ЭлектронныйДокумент
		|		И ЭлектронныйДокументИсходящийЭДО.ИдентификаторОрганизации = &ИдентификаторОрганизации
		|		И ЭлектронныйДокументИсходящийЭДО.ИдентификаторКонтрагента = &ИдентификаторКонтрагента
		|		И НЕ ЭлектронныйДокументИсходящийЭДО.Остановлен
		|		И СообщениеЭДО.Состояние = &СостояниеДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭлектронныйДокументВходящийЭДО.Ссылка КАК ЭлектронныйДокумент
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|ГДЕ
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторОрганизации = &ИдентификаторОрганизации
		|	И ЭлектронныйДокументВходящийЭДО.ИдентификаторКонтрагента = &ИдентификаторКонтрагента
		|	И ЭлектронныйДокументВходящийЭДО.Остановлен
		|	И ЭлектронныйДокументВходящийЭДО.ПричинаОстановки В (&ПричиныОстановки)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭлектронныйДокументИсходящийЭДО.Ссылка КАК ЭлектронныйДокумент
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|ГДЕ
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторОрганизации = &ИдентификаторОрганизации
		|	И ЭлектронныйДокументИсходящийЭДО.ИдентификаторКонтрагента = &ИдентификаторКонтрагента
		|	И ЭлектронныйДокументИсходящийЭДО.Остановлен
		|	И ЭлектронныйДокументИсходящийЭДО.ПричинаОстановки В (&ПричиныОстановки)";
	
	Запрос.УстановитьПараметр("ИдентификаторОрганизации", ИдентификаторОрганизации);
	Запрос.УстановитьПараметр("ИдентификаторКонтрагента", ИдентификаторКонтрагента);
	Запрос.УстановитьПараметр("СостояниеДокумента", Перечисления.СостоянияСообщенийЭДО.Отправка);
	
	ПричиныОстановки = Новый Массив;
	ПричиныОстановки.Добавить(Перечисления.ПричиныОстановкиЭДО.ТребуетсяОтправкаПриглашения);
	ПричиныОстановки.Добавить(Перечисления.ПричиныОстановкиЭДО.ОжидаетсяОтветНаПриглашение);
	ПричиныОстановки.Добавить(Перечисления.ПричиныОстановкиЭДО.ОтклонениеПриглашения);
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПричиныОстановки, ПричинаОстановки);
	Запрос.УстановитьПараметр("ПричиныОстановки", ПричиныОстановки);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Действие = Перечисления.ДействияПоЭДО.Загрузить;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОстановитьДокумент(Выборка.ЭлектронныйДокумент, ПричинаОстановки, Действие, КонтекстДиагностики);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление

Процедура Обновление_ЗаполнитьДокументПоНовойАрхитекртуре(Объект, ДанныеДляЗаполнения, ЭтоВходящийЭДО, Записать) Экспорт
	
	Если ЗначениеЗаполнено(Объект.ТипРегламента)
		ИЛИ Не ЗначениеЗаполнено(Объект.УдалитьВидДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВидДокумента) Тогда
		Объект.ВидДокумента = Обновление_ОпределитьВидДокумента(Объект);
	КонецЕсли;
	
	Объект.ТипРегламента = Обновление_ТипРегламентаПоНовойАрхитектуре(Объект.УдалитьТипЭлементаВерсииЭД);
	Объект.ПричинаОстановки = Обновление_ПричинаОстановкиПоНовойАрхитектуре(Объект, ЭтоВходящийЭДО);
	Объект.Остановлен = ЗначениеЗаполнено(Объект.ПричинаОстановки);
	Объект.Исправлен = Объект.УдалитьСостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ОбменЗавершенСИсправлением;
	Объект.ИдентификаторСвязи = ДанныеДляЗаполнения.ИдентификаторыСвязи[Объект.Ссылка];
	
	Обновление_ЗаполнитьОбъектыУчетаЭлектронногоДокументаПоНовойАрхитектуре(Объект, ЭтоВходящийЭДО);
	
	Отбор = Новый Структура("ЭлектронныйДокумент", Объект.Ссылка);
	ИсторияСобытийПоДокументу = ДанныеДляЗаполнения.ИсторияСобытий.НайтиСтроки(Отбор);
	
	Комментарий = "";
	СостояниеДополнение = "";
	Если Обновление_ДокументооборотЗавершенДоОбновления(Объект.УдалитьСостояниеЭДО) Тогда
		ТекущееСостояние = Объект.УдалитьСостояниеЭДО;
		ДатаИзменения = ?(ЗначениеЗаполнено(ИсторияСобытийПоДокументу),
			ИсторияСобытийПоДокументу[ИсторияСобытийПоДокументу.Количество() - 1].ДатаИзменения, Объект.Дата);
		Если ТекущееСостояние = Перечисления.СостоянияДокументовЭДО.Аннулирован
			ИЛИ ТекущееСостояние = Перечисления.СостоянияДокументовЭДО.ЗакрытСОтклонением Тогда
			Комментарий = Объект.УдалитьПричинаОтклонения;
		КонецЕсли;
	Иначе
		СостоянияСообщений = Обновление_СостоянияСообщений(Объект.Ссылка);
		ТекущееСостояние = РегламентыЭДО.СостояниеДокумента(Объект, СостоянияСообщений, ЭтоВходящийЭДО);
		ДатаИзменения = ?(ЗначениеЗаполнено(СостоянияСообщений), СостоянияСообщений[0].ДатаИзмененияСтатуса, Объект.Дата);
		СостояниеДополнение = Обновление_СостояниеДополнение(Объект, ТекущееСостояние, ЭтоВходящийЭДО, СостоянияСообщений);
	КонецЕсли;
	
	Обновление_ЗаписатьСостояниеДокумент(Объект.Ссылка, ТекущееСостояние, СостояниеДополнение, ДатаИзменения, Комментарий);
	
	Обновление_ЗаполнитьЖурналДействийПоНовойАрхитектуре(Объект, ИсторияСобытийПоДокументу, ТекущееСостояние,
		ЭтоВходящийЭДО);
	
	Записать = Истина;
	
КонецПроцедуры

Функция Обновление_СтатусСообщенияПоНовойАрхитектуре(СтатусДоОбновления, ТипРегламента, ТипЭлементаРегламента, Направление, ОбменБезПодписи) Экспорт
	
	Результат = СтатусДоОбновления;
	
	Если СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьПолностьюПодписан Тогда
		
		Результат = Перечисления.СтатусыСообщенийЭДО.Подписан
		
	ИначеЕсли СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьОтправкаЗаблокированаОператором
		ИЛИ СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьОшибкаПередачи Тогда
		// Обмен через оператора возможен только с подписью.
		Результат = Перечисления.СтатусыСообщенийЭДО.Подписан;
		
	ИначеЕсли СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьОтклонен
		ИЛИ СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьОтправленоУведомление Тогда
		// Отклонение доступно до отправки подтверждения.
		Если Направление = Перечисления.НаправленияЭДО.Входящий Тогда
			Результат = Перечисления.СтатусыСообщенийЭДО.Получен;
		Иначе
			Результат = Перечисления.СтатусыСообщенийЭДО.Отправлен;
		КонецЕсли;
		
	ИначеЕсли СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьПереданОператору
		ИЛИ СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьПолученоПодтверждениеОператора
		ИЛИ СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьАннулирован
		ИЛИ СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьСформированоПредложениеОбАннулировании
		ИЛИ СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьОтправленоПредложениеОбАннулировании
		ИЛИ СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьПолученоПредложениеОбАннулировании
		ИЛИ СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьДоставлен
		ИЛИ СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьДоставленоПодтверждение
		ИЛИ СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьОтклоненПолучателем
		ИЛИ СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьПодготовленоИзвещение
		ИЛИ СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьОтправленоИзвещение
		ИЛИ СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьПолученоИзвещение
		ИЛИ СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьПолученоУведомление
		ИЛИ ТипРегламента <> Перечисления.ТипыРегламентовЭДО.Неформализованный
			И (СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьПодготовленоПодтверждение
				ИЛИ СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьОтправленоПодтверждение
				ИЛИ СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьПолученоПодтверждение) Тогда
		
		Результат = Перечисления.СтатусыСообщенийЭДО.Отправлен;
		
	ИначеЕсли СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьПодготовленоПодтверждение
		ИЛИ СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьОтправленоПодтверждение
		ИЛИ СтатусДоОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьПолученоПодтверждение Тогда
		
		Результат = Перечисления.СтатусыСообщенийЭДО.Подтвержден;
		
	КонецЕсли;
	
	Если Результат = Перечисления.СтатусыСообщенийЭДО.Утвержден
		И Не (ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя
			ИЛИ ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПОА
				И Направление = Перечисления.НаправленияЭДО.Входящий) Тогда
		
		Результат = ?(Направление = Перечисления.НаправленияЭДО.Входящий,
			Перечисления.СтатусыСообщенийЭДО.Получен, Перечисления.СтатусыСообщенийЭДО.Сформирован);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Обновление_ДокументооборотЗавершенДоОбновления(СостояниеДоОбновления) Экспорт
	
	Возврат СостояниеДоОбновления = Перечисления.СостоянияДокументовЭДО.ОбменЗавершен
		ИЛИ СостояниеДоОбновления = Перечисления.СостоянияДокументовЭДО.ОбменЗавершенСИсправлением
		ИЛИ СостояниеДоОбновления = Перечисления.СостоянияДокументовЭДО.ЗакрытПринудительно
		ИЛИ СостояниеДоОбновления = Перечисления.СостоянияДокументовЭДО.Аннулирован
		ИЛИ СостояниеДоОбновления = Перечисления.СостоянияДокументовЭДО.ЗакрытСОтклонением;
	
КонецФункции

Функция Обновление_ДанныеДляЗаполненияДокументовПоНовойАрхитектуре(ВыбранныеДанные) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВыбранныеДанные.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВыбранныеДанные
		|ИЗ
		|	&ВыбранныеДанные КАК ВыбранныеДанные
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Сообщение,
		|	СообщениеЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
		|	СообщениеЭДО.Направление КАК Направление,
		|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента,
		|	ЖурналСобытийЭД.СтатусЭД КАК СтатусДоОбновления,
		|	ЖурналСобытийЭД.Дата КАК ДатаИзменения,
		|	ЖурналСобытийЭД.Пользователь КАК Пользователь,
		|	ЖурналСобытийЭД.Ответственный КАК Ответственный,
		|	ЖурналСобытийЭД.Комментарий КАК Комментарий
		|ИЗ
		|	ВыбранныеДанные КАК ВыбранныеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УдалитьЖурналСобытийЭД КАК ЖурналСобытийЭД
		|		ПО ВыбранныеДанные.Ссылка = ЖурналСобытийЭД.ВладелецЭД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|		ПО ЖурналСобытийЭД.ПрисоединенныйФайл = ПрисоединенныеФайлы.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ПО ПрисоединенныеФайлы.ВладелецФайла = СообщениеЭДО.Ссылка
		|УПОРЯДОЧИТЬ ПО
		|	ЭлектронныйДокумент,
		|	ДатаИзменения,
		|	ЖурналСобытийЭД.ПрисоединенныйФайл,
		|	ЖурналСобытийЭД.НомерЗаписи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыбранныеДанные.Ссылка КАК ЭлектронныйДокумент,
		|	ПрисоединенныеФайлы.УдалитьНомерЭД КАК ИдентификаторСвязи
		|ИЗ
		|	ВыбранныеДанные КАК ВыбранныеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ПО ВыбранныеДанные.Ссылка = СообщениеЭДО.ЭлектронныйДокумент
		|		И СообщениеЭДО.ТипЭлементаРегламента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|		ПО СообщениеЭДО.ОсновнойФайл = ПрисоединенныеФайлы.Ссылка";
	
	Запрос.УстановитьПараметр("ВыбранныеДанные", ВыбранныеДанные);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ИсторияСобытий = РезультатыЗапроса[1].Выгрузить();
	ИсторияСобытий.Индексы.Добавить("ЭлектронныйДокумент");
	
	ИдентификаторыСвязи = Новый Соответствие;
	Выборка = РезультатыЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		ИдентификаторыСвязи.Вставить(Выборка.ЭлектронныйДокумент, Выборка.ИдентификаторСвязи);
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ИсторияСобытий", ИсторияСобытий);
	Результат.Вставить("ИдентификаторыСвязи", ИдентификаторыСвязи);
	
	Возврат Результат;
	
КонецФункции

Функция Обновление_ТипРегламентаПоНовойАрхитектуре(ТипЭлементаВерсииЭД) Экспорт
	
	Результат = Перечисления.ТипыРегламентовЭДО.ПустаяСсылка();
	
	Если ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьДОПУПД
		ИЛИ ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьСЧФУПД
		ИЛИ ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьСЧФДОПУПД
		ИЛИ ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьДИСУКД
		ИЛИ ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьКСЧФУКД
		ИЛИ ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьКСЧФДИСУКД
		ИЛИ ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьКСЧФДИСУКД
		ИЛИ ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьЭСФ Тогда
		
		Результат = Перечисления.ТипыРегламентовЭДО.УПД;
		
	ИначеЕсли ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьДОП Тогда
		
		Результат = Перечисления.ТипыРегламентовЭДО.Формализованный;
		
	ИначеЕсли ТипЭлементаВерсииЭД = Перечисления.ТипыЭлементовРегламентаЭДО.УдалитьПервичныйЭД Тогда
		
		Результат = Перечисления.ТипыРегламентовЭДО.Неформализованный;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось определить тип регламента ЭДО'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Обновление_ОпределитьВидДокумента(СвойстваДокумента) Экспорт
	
	Результат = Справочники.ВидыДокументовЭДО.ПустаяСсылка();
	
	Если СвойстваДокумента.УдалитьВидДокумента = Перечисления.ТипыДокументовЭДО.Внутренний Тогда
		Результат = СвойстваДокумента.ВидДокумента;
	ИначеЕсли СвойстваДокумента.УдалитьВидДокумента = Перечисления.ТипыДокументовЭДО.Прикладной Тогда
		Результат = ЭлектронныеДокументыЭДО.ВидДокументаПоПрикладномуТипу(
			СвойстваДокумента.УдалитьВидПрикладногоДокумента);
	ИначеЕсли СвойстваДокумента.УдалитьВидДокумента = Перечисления.ТипыДокументовЭДО.УдалитьПроизвольный Тогда
		ТипДокумента = Обновление_ОпределитьТипДокументаПроизвольногоФормата(СвойстваДокумента.УдалитьТипДокумента);
		Результат = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(ТипДокумента);
	Иначе
		ТипДокумента = ЭлектронныеДокументыЭДО.Обновление_ТипДокументаПоНовойАрхитекртуре(
			СвойстваДокумента.УдалитьВидДокумента);
		Если ЗначениеЗаполнено(ТипДокумента) Тогда
			Результат = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(ТипДокумента);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось определить вид электронного документа'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Обновление_ОпределитьТипДокументаПроизвольногоФормата(ТипДокументаДоОбновления)
	
	Результат = Перечисления.ТипыДокументовЭДО.Прочее;
	
	Если ТипДокументаДоОбновления = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.АктВзаимозачета Тогда
		Результат = Перечисления.ТипыДокументовЭДО.АктВзаимозачета;
	ИначеЕсли ТипДокументаДоОбновления = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.АктВыполненныхРабот Тогда
		Результат = Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот;
	ИначеЕсли ТипДокументаДоОбновления = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.АктСверки Тогда
		Результат = Перечисления.ТипыДокументовЭДО.АктСверки;
	ИначеЕсли ТипДокументаДоОбновления = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.Ведомость Тогда
		Результат = Перечисления.ТипыДокументовЭДО.Ведомость;
	ИначеЕсли ТипДокументаДоОбновления = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.ГарантийноеПисьмо Тогда
		Результат = Перечисления.ТипыДокументовЭДО.ГарантийноеПисьмо;
	ИначеЕсли ТипДокументаДоОбновления = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.Договор Тогда
		Результат = Перечисления.ТипыДокументовЭДО.Договор;
	ИначеЕсли ТипДокументаДоОбновления = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.ДополнительноеСоглашение Тогда
		Результат = Перечисления.ТипыДокументовЭДО.ДополнительноеСоглашение;
	ИначеЕсли ТипДокументаДоОбновления = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.КС11 Тогда
		Результат = Перечисления.ТипыДокументовЭДО.КС11;
	ИначеЕсли ТипДокументаДоОбновления = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.КС2 Тогда
		Результат = Перечисления.ТипыДокументовЭДО.КС2;
	ИначеЕсли ТипДокументаДоОбновления = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.КС3 Тогда
		Результат = Перечисления.ТипыДокументовЭДО.КС3;
	ИначеЕсли ТипДокументаДоОбновления = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.Отчет Тогда
		Результат = Перечисления.ТипыДокументовЭДО.Отчет;
	ИначеЕсли ТипДокументаДоОбновления = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.ПлатежноеПоручение Тогда
		Результат = Перечисления.ТипыДокументовЭДО.ПлатежноеПоручение;
	ИначеЕсли ТипДокументаДоОбновления = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.ПриложениеКАкту Тогда
		Результат = Перечисления.ТипыДокументовЭДО.ПриложениеКАкту;
	ИначеЕсли ТипДокументаДоОбновления = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.СоглашениеОбЭДО Тогда
		Результат = Перечисления.ТипыДокументовЭДО.СоглашениеОбЭДО;
	ИначеЕсли ТипДокументаДоОбновления = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.Спецификация Тогда
		Результат = Перечисления.ТипыДокументовЭДО.Спецификация;
	ИначеЕсли ТипДокументаДоОбновления = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.СчетНаОплату Тогда
		Результат = Перечисления.ТипыДокументовЭДО.СчетНаОплату;
	ИначеЕсли ТипДокументаДоОбновления = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.ТоварнаяНакладная Тогда
		Результат = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная;
	ИначеЕсли ТипДокументаДоОбновления = Перечисления.УдалитьТипыПроизвольныхДокументовЭДО.Уведомление Тогда
		Результат = Перечисления.ТипыДокументовЭДО.Уведомление;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Обновление_ПричинаОстановкиПоНовойАрхитектуре(Объект, ЭтоВходящийЭДО)
	
	СостояниеДокумента = Объект.УдалитьСостояниеЭДО;
	
	Результат = Перечисления.ПричиныОстановкиЭДО.ПустаяСсылка();
	
	Если СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ЗакрытПринудительно Тогда
		
		Результат = Перечисления.ПричиныОстановкиЭДО.ЗакрытПринудительно;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ЗакрытСОтклонениемПриглашения Тогда
		
		Результат = Перечисления.ПричиныОстановкиЭДО.ОтклонениеПриглашения;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОжидаетсяОтветНаПриглашение Тогда
		
		Результат = Перечисления.ПричиныОстановкиЭДО.ОжидаетсяОтветНаПриглашение;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ТребуетсяИсправлениеОшибкиПередачи Тогда
		
		Результат = Перечисления.ПричиныОстановкиЭДО.ОшибкаПередачиБлокирующая;
		
	ИначеЕсли СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.УдалитьОтклоненОператором
		И Не ЭтоВходящийЭДО И Объект.УдалитьВидОшибкиПередачи = Перечисления.УдалитьВидыОшибокПередачиЭД.ОграничениеТарификации Тогда
		
		Результат = Перечисления.ПричиныОстановкиЭДО.ОшибкаПередачиНеблокирующая;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура Обновление_ЗаполнитьОбъектыУчетаЭлектронногоДокументаПоНовойАрхитектуре(Объект, ЭтоВходящийЭДО)
	
	Если Не ЗначениеЗаполнено(Объект.УдалитьДокументыОснования) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ОбъектыУчетаДокументовЭДО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЭлектронныйДокумент.Установить(Объект.Ссылка);
	
	Для Каждого СтрокаТаблицы Из Объект.УдалитьДокументыОснования Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ЭлектронныйДокумент = Объект.Ссылка;
		НоваяЗапись.ОбъектУчета = СтрокаТаблицы.ДокументОснование;
		Если ЭтоВходящийЭДО Тогда
			НоваяЗапись.СпособОбработки = СтрокаТаблицы.СпособОбработки;
		КонецЕсли;
	КонецЦикла;
	
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	
КонецПроцедуры

Функция Обновление_СостоянияСообщений(ЭлектронныйДокумент);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Документ.СообщениеЭДО");
	ЭлементБлокировки.УстановитьЗначение("ЭлектронныйДокумент", ЭлектронныйДокумент);
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Ссылка,
		|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента,
		|	СообщениеЭДО.Состояние КАК Состояние,
		|	СообщениеЭДО.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент
		|УПОРЯДОЧИТЬ ПО
		|	ДатаИзмененияСтатуса УБЫВ";
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция Обновление_СостояниеДополнение(Объект, Состояние, ЭтоВходящийЭДО, СостоянияСообщений)
	
	Результат = "";
	
	Если ЭтоВходящийЭДО
		ИЛИ Состояние <> Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИнформацияОтправителя = СостоянияСообщений.Найти(Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя,
		"ТипЭлементаРегламента");
	
	Если ИнформацияОтправителя = Неопределено Тогда
		Возврат ИнформацияОтправителя;
	КонецЕсли;
	
	Подписи = УстановленныеПодписи(ИнформацияОтправителя.Ссылка, Объект.ВидПодписи);
	
	Возврат МаршрутыПодписанияБЭД.ПредставлениеПрогрессаПодписания(Объект.МаршрутПодписания, Подписи.Количество());
	
КонецФункции

Процедура Обновление_ЗаписатьСостояниеДокумент(ЭлектронныйДокумент, Состояние, СостояниеДополнение, ДатаИзменения, Комментарий)
	НаборЗаписей = РегистрыСведений.СостоянияДокументовЭДО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЭлектронныйДокумент.Установить(ЭлектронныйДокумент);
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ЭлектронныйДокумент = ЭлектронныйДокумент;
	НоваяЗапись.Состояние = Состояние;
	НоваяЗапись.СостояниеДополнение = СостояниеДополнение;
	НоваяЗапись.ДатаИзменения = ДатаИзменения;
	НоваяЗапись.Комментарий = Комментарий;
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
КонецПроцедуры

Процедура Обновление_ЗаполнитьЖурналДействийПоНовойАрхитектуре(Объект, ИсторияСобытийПоДокументу, ТекущееСостояние, ЭтоВходящийЭДО)
	
	Если Не ЗначениеЗаполнено(ИсторияСобытийПоДокументу) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ЖурналДействийПоЭДО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЭлектронныйДокумент.Установить(Объект.Ссылка);
	
	СостоянияЭлементовРегламента = РегламентыЭДО.НовыеСостоянияЭлементовРегламента();
	
	СвойстваСообщения = Новый Структура;
	СвойстваСообщения.Вставить("ТипЭлементаРегламента", Перечисления.ТипыЭлементовРегламентаЭДО.ПустаяСсылка());
	СвойстваСообщения.Вставить("Статус", Перечисления.СтатусыСообщенийЭДО.ПустаяСсылка());
	СвойстваСообщения.Вставить("Направление", Перечисления.НаправленияЭДО.ПустаяСсылка());
	
	Отбор = Новый Структура("ТипЭлементаРегламента", Перечисления.ТипыЭлементовРегламентаЭДО.ПустаяСсылка());
	
	РасчетСостоянияВозможен = Истина;
	
	Счетчик = 1;
	Для Каждого СведенияОСобытии Из ИсторияСобытийПоДокументу Цикл
		
		СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ПустаяСсылка();
		Статус = Перечисления.СтатусыСообщенийЭДО.ПустаяСсылка();
		Действие = Перечисления.ДействияПоЭДО.ПустаяСсылка();
		
		Если Не ЗначениеЗаполнено(СведенияОСобытии.СтатусДоОбновления) Тогда
			РасчетСостоянияВозможен = Ложь;
		ИначеЕсли РасчетСостоянияВозможен Тогда 
			
			СвойстваСообщения.ТипЭлементаРегламента = СведенияОСобытии.ТипЭлементаРегламента;
			СвойстваСообщения.Направление = СведенияОСобытии.Направление;
			СвойстваСообщения.Статус = Обновление_СтатусСообщенияПоНовойАрхитектуре(СведенияОСобытии.СтатусДоОбновления,
				Объект.ТипРегламента, СведенияОСобытии.ТипЭлементаРегламента, СведенияОСобытии.Направление, Объект.ОбменБезПодписи);
			
			СостояниеСообщения = РегламентыЭДО.СостояниеСообщения(СвойстваСообщения, Объект);
			
			Отбор.ТипЭлементаРегламента = СведенияОСобытии.ТипЭлементаРегламента;
			НайденныеСтроки = СостоянияЭлементовРегламента.НайтиСтроки(Отбор);
			КоличествоСтрок = НайденныеСтроки.Количество();
			Если КоличествоСтрок = 0 Тогда
				Элемент = СостоянияЭлементовРегламента.Добавить();
				Элемент.ТипЭлементаРегламента = СведенияОСобытии.ТипЭлементаРегламента;
				Элемент.Состояние = СостояниеСообщения;
			Иначе
				ЭлементРегламента = НайденныеСтроки[КоличествоСтрок - 1];
				Если ЭлементРегламента.Состояние = СостояниеСообщения Тогда
					Продолжить;
				Иначе
					ЭлементРегламента.Состояние = СостояниеСообщения;
				КонецЕсли;
			КонецЕсли;
			
			Статус = СвойстваСообщения.Статус;
			
			СостояниеДокумента = Обновление_СостояниеДокумента(Объект, СостоянияЭлементовРегламента, ЭтоВходящийЭДО);
			
			Действие = Обновление_ДействиеПоСтатусу(СведенияОСобытии.ТипЭлементаРегламента,
				СведенияОСобытии.Направление, СвойстваСообщения.Статус);
			
		КонецЕсли;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.НомерЗаписи = Счетчик;
		НоваяЗапись.Сообщение = СведенияОСобытии.Сообщение;
		НоваяЗапись.ЭлектронныйДокумент = СведенияОСобытии.ЭлектронныйДокумент;
		НоваяЗапись.ДатаИзменения = СведенияОСобытии.ДатаИзменения;
		НоваяЗапись.Ответственный = СведенияОСобытии.Ответственный;
		НоваяЗапись.Пользователь = СведенияОСобытии.Пользователь;
		НоваяЗапись.Комментарий = СведенияОСобытии.Комментарий;
		
		НоваяЗапись.СостояниеДокумента = СостояниеДокумента;
		НоваяЗапись.СтатусСообщения = Статус;
		НоваяЗапись.Действие = Действие;
		
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	Если Счетчик > 1 Тогда
		
		ПоследняяЗапись = НаборЗаписей[Счетчик - 2];
		Если ПоследняяЗапись.СостояниеДокумента <> ТекущееСостояние Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ПоследняяЗапись);
			НоваяЗапись.НомерЗаписи = Счетчик;
			НоваяЗапись.СостояниеДокумента = ТекущееСостояние;
			НоваяЗапись.Комментарий = НСтр("ru = 'Скорректировано автоматически'");
			Если ТекущееСостояние = Перечисления.СостоянияДокументовЭДО.ЗакрытПринудительно Тогда
				НоваяЗапись.Действие = Перечисления.ДействияПоЭДО.ЗакрытьПринудительно;
				НоваяЗапись.Сообщение = Документы.СообщениеЭДО.ПустаяСсылка();
				НоваяЗапись.СтатусСообщения = Перечисления.СтатусыСообщенийЭДО.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	
КонецПроцедуры

Функция Обновление_СостояниеДокумента(Объект, СостоянияЭлементовРегламента, ЭтоВходящийЭДО)
	
	Если Объект.ТипРегламента = Перечисления.ТипыРегламентовЭДО.УПД Тогда
		МенеджерРегламента =  РегламентыЭДО_УПД;
	ИначеЕсли Объект.ТипРегламента = Перечисления.ТипыРегламентовЭДО.Неформализованный Тогда
		МенеджерРегламента = РегламентыЭДО_Неформализованный;
	ИначеЕсли Объект.ТипРегламента = Перечисления.ТипыРегламентовЭДО.Формализованный Тогда
		МенеджерРегламента = РегламентыЭДО_Формализованный;
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Некорректный тип регламента ЭДО: %1'"), Объект.ТипРегламента);
	КонецЕсли;
	
	Если ЭтоВходящийЭДО Тогда
		СостояниеДокумента = МенеджерРегламента.СостояниеВходящегоДокумента(Объект, СостоянияЭлементовРегламента);
	Иначе
		СостояниеДокумента = МенеджерРегламента.СостояниеИсходящегоДокумента(Объект, СостоянияЭлементовРегламента);
	КонецЕсли;
	
	Возврат СостояниеДокумента;
	
КонецФункции

Функция Обновление_ДействиеПоСтатусу(ТипЭлементаРегламента, Направление, СтатусПослеОбновления)
	
	Если СтатусПослеОбновления = Перечисления.СтатусыСообщенийЭДО.Сформирован Тогда
		
		Если ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПОА Тогда
			
			Результат = Перечисления.ДействияПоЭДО.Аннулировать;
			
		ИначеЕсли ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.УОУ Тогда
			
			Результат = Перечисления.ДействияПоЭДО.Отклонить;
			
		ИначеЕсли ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПОА_УОУ Тогда
			
			Результат = Перечисления.ДействияПоЭДО.ОтклонитьАннулирование;
			
		Иначе
			
			Результат = Перечисления.ДействияПоЭДО.Сформировать;
			
		КонецЕсли;
		
	ИначеЕсли СтатусПослеОбновления = Перечисления.СтатусыСообщенийЭДО.Получен Тогда
		
		Результат = Перечисления.ДействияПоЭДО.Загрузить;
		
	ИначеЕсли СтатусПослеОбновления = Перечисления.СтатусыСообщенийЭДО.Утвержден Тогда
		
		Если ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПОА Тогда
			
			Результат = Перечисления.ДействияПоЭДО.ПринятьАннулирование;
			
		Иначе
			
			Результат = Перечисления.ДействияПоЭДО.Утвердить;
			
		КонецЕсли;
		
	ИначеЕсли СтатусПослеОбновления = Перечисления.СтатусыСообщенийЭДО.ЧастичноПодписан
		ИЛИ СтатусПослеОбновления = Перечисления.СтатусыСообщенийЭДО.Подписан
		ИЛИ СтатусПослеОбновления = Перечисления.СтатусыСообщенийЭДО.УдалитьПолностьюПодписан Тогда
		
		Результат = Перечисления.ДействияПоЭДО.Подписать;
		
	ИначеЕсли СтатусПослеОбновления = Перечисления.СтатусыСообщенийЭДО.ПодготовленКОтправке Тогда 
		
		Результат = Перечисления.ДействияПоЭДО.ПодготовитьКОтправке;
		
	ИначеЕсли СтатусПослеОбновления = Перечисления.СтатусыСообщенийЭДО.Отправлен Тогда 
		
		Результат = Перечисления.ДействияПоЭДО.Отправить;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ИнтеграцияБРОЭДО

Функция РезультатЗапросаДанныхДляВыгрузкиВФНС(ОбъектыУчета, ТипыДокументов, ТипыЭлементовРегламента)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыДокументовЭДО.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВидыДокументов
		|ИЗ
		|	Справочник.ВидыДокументовЭДО КАК ВидыДокументовЭДО
		|ГДЕ
		|	ВидыДокументовЭДО.ТипДокумента В (&ТипыДокументов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭлектронныеДокументыОбъектовУчета.ОбъектУчета КАК ОбъектУчета,
		|	ВидыДокументов.Ссылка.ТипДокумента КАК ТипДокумента,
		|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента,
		|	СообщениеЭДО.ОсновнойФайл КАК Файл,
		|	ПрисоединенныеФайлы.ПолноеИмяФайла КАК ПолноеИмяФайла
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЭлектронныеДокументыОбъектовУчета КАК ЭлектронныеДокументыОбъектовУчета
		|		ПО СообщениеЭДО.ЭлектронныйДокумент = ЭлектронныеДокументыОбъектовУчета.ЭлектронныйДокумент
		|		И СообщениеЭДО.ТипЭлементаРегламента В (&ТипыЭлементовРегламента)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|		ПО СообщениеЭДО.ЭлектронныйДокумент = СостоянияДокументовЭДО.ЭлектронныйДокумент
		|		И СостоянияДокументовЭДО.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.ОбменЗавершен)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВидыДокументов КАК ВидыДокументов
		|		ПО СообщениеЭДО.ВидСообщения = ВидыДокументов.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СообщениеЭДОПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|		ПО СообщениеЭДО.ОсновнойФайл = ПрисоединенныеФайлы.Ссылка";
	
	Отбор = ИнтеграцияЭДО.НовыйОтборАктуальныхЭлектронныхДокументов();
	Отбор.ОбъектыУчета = "&ОбъектыУчета";
	ОписаниеЗапроса = ИнтеграцияЭДО.ЗапросАктуальныхЭлектронныхДокументов("ЭлектронныеДокументыОбъектовУчета", Отбор);
	Запрос = ОбщегоНазначенияБЭД.СоединитьЗапросы(Запрос, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОписаниеЗапроса));
	
	Запрос.УстановитьПараметр("ОбъектыУчета", ОбъектыУчета);
	Запрос.УстановитьПараметр("ТипыДокументов", ТипыДокументов);
	Запрос.УстановитьПараметр("ТипыЭлементовРегламента", ТипыЭлементовРегламента);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция НовыеДанныеФайлаДляВыгрузкиВФНС()
	ДанныеФайла = Новый Структура;
	ДанныеФайла.Вставить("Тип", "");
	ДанныеФайла.Вставить("КНД", "");
	ДанныеФайла.Вставить("Данные", "");
	ДанныеФайла.Вставить("Имя", "");
	Возврат ДанныеФайла;
КонецФункции

Функция ДанныеФайлаДляВыгрузкиФНС(ЭлектронныйДокумент, ТипЭлементаРегламента)
	
	Результат = Новый Структура("ИмяФайла, ДвоичныеДанные, Размер, КНД, УстановленныеПодписи");

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщениеЭДО.ОсновнойФайл,
		|	СообщениеЭДО.ВидСообщения.ТипДокумента КАК ТипДокумента,
		|	СообщениеЭДО.ЭлектронныйДокумент.ТипРегламента  КАК ТипРегламента
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент
		|	И СообщениеЭДО.ТипЭлементаРегламента = &ТипЭлементаРегламента";
	
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	Запрос.УстановитьПараметр("ТипЭлементаРегламента", ТипЭлементаРегламента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ПараметрыДанныхФайла = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
		ПараметрыДанныхФайла.ПолучатьСсылкуНаДвоичныеДанные = Истина;
		ДанныеФайла = РаботаСФайлами.ДанныеФайла(Выборка.ОсновнойФайл, ПараметрыДанныхФайла);
		Результат.ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
		Результат.ИмяФайла = ДанныеФайла.ИмяФайла;
		Результат.Размер = ДанныеФайла.Размер;
		Результат.УстановленныеПодписи = ЭлектроннаяПодпись.УстановленныеПодписи(Выборка.ОсновнойФайл);
		
		СвойстваДокумента = ФорматыЭДО.НовыйПараметрыПолученияКНД();
		СвойстваДокумента.ТипДокумента = Выборка.ТипДокумента;
		СвойстваДокумента.ТипРегламента = Выборка.ТипРегламента;
		СвойстваДокумента.ИмяФайла = ДанныеФайла.ИмяФайла;	
		СвойстваДокумента.Подтверждение = ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияПолучателя;		
		
		Результат.КНД = ФорматыЭДО.КНДПоСвойствамДокумента(СвойстваДокумента);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
